import { ElectionData } from './election'

export const electionData: ElectionData = {
  "กระบี่": [
    {
      "district": 1,
      "total_votes": 96391,
      "party_votes": {
        "ก้าวไกล": 15211,
        "คลองไทย": 71,
        "ประชาธิปัตย์": 30877,
        "พลังประชารัฐ": 417,
        "ภูมิใจไทย": 39520,
        "รวมไทยสร้างชาติ": 6308,
        "เพื่อไทย": 2388,
        "เสรีรวมไทย": 705,
        "ไทยภักดี": 333,
        "ไทยสร้างไทย": 561
      }
    },
    {
      "district": 2,
      "total_votes": 87158,
      "party_votes": {
        "ก้าวไกล": 10038,
        "ประชาธิปัตย์": 12439,
        "พลังธรรมใหม่": 163,
        "พลังประชารัฐ": 13903,
        "ภูมิใจไทย": 44378,
        "รวมไทยสร้างชาติ": 3234,
        "รักษ์ผืนป่าประเทศไทย": 563,
        "เพื่อชาติไทย": 327,
        "เพื่อไทย": 1976,
        "เสรีรวมไทย": 137
      }
    },
    {
      "district": 3,
      "total_votes": 94001,
      "party_votes": {
        "ก้าวไกล": 9481,
        "คลองไทย": 119,
        "ประชาธิปัตย์": 25484,
        "พลังประชารัฐ": 829,
        "ภูมิใจไทย": 52499,
        "รวมไทยสร้างชาติ": 2423,
        "เพื่อไทย": 2656,
        "เสรีรวมไทย": 510
      }
    }
  ],
  "กรุงเทพมหานคร": [
    {
      "district": 1,
      "total_votes": 90092,
      "party_votes": {
        "ก้าวไกล": 37438,
        "คลองไทย": 71,
        "ชาติพัฒนากล้า": 1247,
        "ทางเลือกใหม่": 140,
        "ประชาธิปัตย์": 11544,
        "พลังประชารัฐ": 1495,
        "ภูมิใจไทย": 656,
        "รวมไทยสร้างชาติ": 18261,
        "เพื่อชาติ": 133,
        "เพื่อไทย": 15289,
        "เสรีรวมไทย": 625,
        "เส้นด้าย": 264,
        "ไทยภักดี": 431,
        "ไทยศรีวิไลย์": 130,
        "ไทยสร้างไทย": 2368
      }
    },
    {
      "district": 2,
      "total_votes": 92198,
      "party_votes": {
        "ก้าวไกล": 41148,
        "คลองไทย": 125,
        "ชาติพัฒนากล้า": 1567,
        "ชาติไทยพัฒนา": 486,
        "ประชาธิปัตย์": 7392,
        "พลังประชารัฐ": 2631,
        "ภูมิใจไทย": 5237,
        "รวมไทยสร้างชาติ": 17908,
        "เพื่อชาติ": 270,
        "เพื่อชาติไทย": 224,
        "เพื่อไทย": 12235,
        "เสรีรวมไทย": 572,
        "เส้นด้าย": 665,
        "ไทยภักดี": 338,
        "ไทยสร้างไทย": 1400
      }
    },
    {
      "district": 3,
      "total_votes": 84283,
      "party_votes": {
        "ก้าวไกล": 35189,
        "คลองไทย": 47,
        "ชาติพัฒนากล้า": 2333,
        "ชาติไทยพัฒนา": 735,
        "ประชาธิปัตย์": 10515,
        "ประชาไทย": 78,
        "พลังประชารัฐ": 546,
        "ภูมิใจไทย": 668,
        "รวมแผ่นดิน": 304,
        "รวมไทยสร้างชาติ": 16233,
        "เพื่อชาติ": 105,
        "เพื่อไทย": 14833,
        "เสรีรวมไทย": 702,
        "เส้นด้าย": 244,
        "ไทยชนะ": 158,
        "ไทยภักดี": 494,
        "ไทยสร้างไทย": 1099
      }
    },
    {
      "district": 4,
      "total_votes": 85368,
      "party_votes": {
        "ก้าวไกล": 33381,
        "คลองไทย": 67,
        "ชาติพัฒนากล้า": 983,
        "ประชากรไทย": 81,
        "ประชาธิปัตย์": 14908,
        "ประชาไทย": 101,
        "พลังประชารัฐ": 506,
        "ภูมิใจไทย": 9643,
        "รวมไทยสร้างชาติ": 12992,
        "เพื่อชาติ": 275,
        "เพื่อชาติไทย": 127,
        "เพื่อไทย": 10901,
        "เสรีรวมไทย": 541,
        "ไทยภักดี": 273,
        "ไทยสร้างไทย": 589
      }
    },
    {
      "district": 5,
      "total_votes": 95078,
      "party_votes": {
        "ก้าวไกล": 47147,
        "คลองไทย": 124,
        "ชาติพัฒนากล้า": 1627,
        "ทางเลือกใหม่": 190,
        "ประชาธิปัตย์": 1835,
        "พลังประชารัฐ": 763,
        "ภูมิใจไทย": 9693,
        "รวมไทยสร้างชาติ": 15886,
        "เพื่อชาติ": 177,
        "เพื่อไทย": 15443,
        "เสรีรวมไทย": 816,
        "เส้นด้าย": 305,
        "ไทยภักดี": 289,
        "ไทยสร้างไทย": 783
      }
    },
    {
      "district": 6,
      "total_votes": 103314,
      "party_votes": {
        "ก้าวไกล": 46082,
        "ชาติพัฒนากล้า": 1460,
        "ชาติไทยพัฒนา": 646,
        "ทางเลือกใหม่": 68,
        "ประชาธิปัตย์": 3966,
        "พลังประชารัฐ": 1939,
        "ภูมิใจไทย": 3361,
        "รวมไทยสร้างชาติ": 24040,
        "เพื่อชาติ": 225,
        "เพื่อไทย": 16718,
        "เสรีรวมไทย": 625,
        "เส้นด้าย": 2574,
        "แนวทางใหม่": 321,
        "ไทยภักดี": 368,
        "ไทยสร้างไทย": 921
      }
    },
    {
      "district": 7,
      "total_votes": 94976,
      "party_votes": {
        "ก้าวไกล": 45049,
        "ชาติพัฒนากล้า": 1287,
        "ทางเลือกใหม่": 288,
        "ประชาธิปัตย์": 2283,
        "พลังประชารัฐ": 1296,
        "ภูมิใจไทย": 391,
        "รวมไทยสร้างชาติ": 24883,
        "เปลี่ยนอนาคต": 106,
        "เพื่อชาติ": 106,
        "เพื่อไทย": 17267,
        "เสรีรวมไทย": 701,
        "เส้นด้าย": 252,
        "ไทยภักดี": 264,
        "ไทยศรีวิไลย์": 185,
        "ไทยสร้างไทย": 618
      }
    },
    {
      "district": 8,
      "total_votes": 103549,
      "party_votes": {
        "ก้าวไกล": 40011,
        "ชาติพัฒนากล้า": 2259,
        "ทางเลือกใหม่": 223,
        "ประชากรไทย": 91,
        "ประชาธิปัตย์": 8261,
        "ประชาไทย": 87,
        "พลังประชารัฐ": 5431,
        "พลังสังคมใหม่": 108,
        "ภูมิใจไทย": 811,
        "รวมไทยสร้างชาติ": 18207,
        "เพื่อชาติ": 202,
        "เพื่อชาติไทย": 208,
        "เพื่อไทย": 25174,
        "เสรีรวมไทย": 580,
        "เส้นด้าย": 516,
        "ไทยภักดี": 414,
        "ไทยสมาร์ท": 70,
        "ไทยสร้างไทย": 896
      }
    },
    {
      "district": 9,
      "total_votes": 101921,
      "party_votes": {
        "ก้าวไกล": 50132,
        "ชาติพัฒนากล้า": 2415,
        "ประชาธิปัตย์": 2372,
        "พลังประชารัฐ": 2475,
        "ภูมิใจไทย": 1006,
        "รวมไทยสร้างชาติ": 18866,
        "เพื่อไทย": 20573,
        "เสรีรวมไทย": 996,
        "เส้นด้าย": 594,
        "ไทยภักดี": 466,
        "ไทยสร้างไทย": 2026
      }
    },
    {
      "district": 10,
      "total_votes": 99736,
      "party_votes": {
        "ก้าวไกล": 38313,
        "ชาติพัฒนากล้า": 751,
        "ชาติไทยพัฒนา": 385,
        "ทางเลือกใหม่": 85,
        "ประชากรไทย": 79,
        "ประชาธิปัตย์": 9545,
        "พลังประชารัฐ": 895,
        "ภูมิใจไทย": 316,
        "รวมไทยสร้างชาติ": 11065,
        "เพื่อชาติ": 329,
        "เพื่อชาติไทย": 111,
        "เพื่อไทย": 14745,
        "เสรีรวมไทย": 516,
        "ไทยภักดี": 109,
        "ไทยสร้างไทย": 22492
      }
    },
    {
      "district": 11,
      "total_votes": 99116,
      "party_votes": {
        "ก้าวไกล": 36985,
        "ชาติพัฒนากล้า": 402,
        "ทางเลือกใหม่": 79,
        "ประชาธิปัตย์": 879,
        "พลังประชารัฐ": 827,
        "ภูมิใจไทย": 14645,
        "รวมไทยสร้างชาติ": 7658,
        "อนาคตไทย": 181,
        "เพื่อไทย": 14325,
        "เสรีรวมไทย": 436,
        "เส้นด้าย": 263,
        "ไทยภักดี": 194,
        "ไทยสร้างไทย": 22242
      }
    },
    {
      "district": 12,
      "total_votes": 101975,
      "party_votes": {
        "ก้าวไกล": 45797,
        "คลองไทย": 58,
        "ชาติพัฒนากล้า": 1077,
        "ชาติไทยพัฒนา": 438,
        "ทางเลือกใหม่": 123,
        "ประชาธิปัตย์": 12405,
        "พลังประชารัฐ": 5245,
        "ภูมิใจไทย": 922,
        "รวมไทยสร้างชาติ": 13608,
        "อนาคตไทย": 232,
        "เพื่อชาติ": 447,
        "เพื่อไทย": 18633,
        "เสมอภาค": 309,
        "เสรีรวมไทย": 989,
        "ไทยภักดี": 266,
        "ไทยสร้างไทย": 1426
      }
    },
    {
      "district": 13,
      "total_votes": 96249,
      "party_votes": {
        "ก้าวไกล": 43186,
        "คลองไทย": 345,
        "ชาติพัฒนากล้า": 1361,
        "ประชาธิปัตย์": 5380,
        "พลังประชารัฐ": 661,
        "ภูมิใจไทย": 2378,
        "รวมไทยสร้างชาติ": 17591,
        "เพื่อชาติ": 222,
        "เพื่อไทย": 22312,
        "เสรีรวมไทย": 517,
        "เส้นด้าย": 188,
        "แนวทางใหม่": 254,
        "ไทยภักดี": 296,
        "ไทยศรีวิไลย์": 179,
        "ไทยสร้างไทย": 1379
      }
    },
    {
      "district": 14,
      "total_votes": 97891,
      "party_votes": {
        "ก้าวไกล": 42218,
        "คลองไทย": 95,
        "ชาติพัฒนากล้า": 1495,
        "ทางเลือกใหม่": 193,
        "ประชากรไทย": 112,
        "ประชาธิปัตย์": 1812,
        "พลังประชารัฐ": 1363,
        "ภูมิใจไทย": 1103,
        "รวมไทยสร้างชาติ": 29106,
        "เพื่อชาติ": 109,
        "เพื่อไทย": 17530,
        "เสรีรวมไทย": 547,
        "ไทยภักดี": 322,
        "ไทยสร้างไทย": 1886
      }
    },
    {
      "district": 15,
      "total_votes": 92172,
      "party_votes": {
        "ก้าวไกล": 35904,
        "คลองไทย": 106,
        "ชาติพัฒนากล้า": 919,
        "ทางเลือกใหม่": 130,
        "ประชาธิปัตย์": 2311,
        "ประชาไทย": 72,
        "พลังประชารัฐ": 646,
        "ภูมิใจไทย": 891,
        "รวมไทยสร้างชาติ": 15111,
        "เพื่อไทย": 28122,
        "เสรีรวมไทย": 687,
        "เส้นด้าย": 302,
        "แนวทางใหม่": 85,
        "ไทยภักดี": 193,
        "ไทยสมาร์ท": 80,
        "ไทยสร้างไทย": 6613
      }
    },
    {
      "district": 16,
      "total_votes": 97752,
      "party_votes": {
        "ก้าวไกล": 40129,
        "ชาติพัฒนากล้า": 880,
        "ทางเลือกใหม่": 273,
        "ประชาธิปัตย์": 12784,
        "พลังประชารัฐ": 560,
        "ภูมิใจไทย": 603,
        "รวมไทยสร้างชาติ": 12357,
        "ราษฎร์วิถี": 115,
        "เพื่อชาติไทย": 457,
        "เพื่อไทย": 27111,
        "เสรีรวมไทย": 584,
        "แนวทางใหม่": 444,
        "ไทยธรรม": 118,
        "ไทยภักดี": 413,
        "ไทยสร้างไทย": 924
      }
    },
    {
      "district": 17,
      "total_votes": 81898,
      "party_votes": {
        "ก้าวไกล": 30439,
        "คลองไทย": 209,
        "ชาติพัฒนากล้า": 486,
        "ชาติไทยพัฒนา": 2930,
        "ทางเลือกใหม่": 312,
        "ประชากรไทย": 87,
        "ประชาธิปัตย์": 1051,
        "พลังประชารัฐ": 18034,
        "ภราดรภาพ": 326,
        "ภูมิใจไทย": 549,
        "รวมไทยสร้างชาติ": 6340,
        "เพื่อชาติไทย": 70,
        "เพื่อไทย": 19155,
        "เสรีรวมไทย": 509,
        "เส้นด้าย": 376,
        "ไทยภักดี": 627,
        "ไทยสร้างไทย": 398
      }
    },
    {
      "district": 18,
      "total_votes": 85070,
      "party_votes": {
        "ก้าวไกล": 36884,
        "คลองไทย": 441,
        "ชาติพัฒนากล้า": 714,
        "ชาติไทยพัฒนา": 304,
        "ทางเลือกใหม่": 379,
        "ประชาธิปัตย์": 1857,
        "พลังประชารัฐ": 14843,
        "ภูมิใจไทย": 924,
        "รวมไทยสร้างชาติ": 8930,
        "เพื่อชาติ": 395,
        "เพื่อไทย": 17236,
        "เสรีรวมไทย": 595,
        "แนวทางใหม่": 267,
        "ไทยภักดี": 892,
        "ไทยสร้างไทย": 409
      }
    },
    {
      "district": 19,
      "total_votes": 96535,
      "party_votes": {
        "ก้าวไกล": 41841,
        "คลองไทย": 66,
        "ชาติพัฒนากล้า": 752,
        "ทางเลือกใหม่": 288,
        "ประชาธิปัตย์": 2144,
        "พลังประชารัฐ": 3411,
        "ภูมิใจไทย": 875,
        "รวมไทยสร้างชาติ": 17176,
        "ราษฎร์วิถี": 250,
        "เป็นธรรม": 356,
        "เพื่อชาติไทย": 218,
        "เพื่อไทย": 26670,
        "เสรีรวมไทย": 734,
        "เส้นด้าย": 118,
        "แนวทางใหม่": 187,
        "ไทยภักดี": 735,
        "ไทยสร้างไทย": 714
      }
    },
    {
      "district": 20,
      "total_votes": 86092,
      "party_votes": {
        "ก้าวไกล": 34745,
        "คลองไทย": 252,
        "ชาติพัฒนากล้า": 790,
        "ชาติไทยพัฒนา": 265,
        "ประชาธิปัตย์": 1501,
        "ประชาไทย": 114,
        "พลังประชารัฐ": 893,
        "ภูมิใจไทย": 1017,
        "รวมไทยสร้างชาติ": 9446,
        "เพื่อชาติไทย": 135,
        "เพื่อไทย": 34749,
        "เสรีรวมไทย": 766,
        "แนวทางใหม่": 177,
        "ไทยภักดี": 534,
        "ไทยสร้างไทย": 708
      }
    },
    {
      "district": 21,
      "total_votes": 95539,
      "party_votes": {
        "ก้าวไกล": 44959,
        "คลองไทย": 270,
        "ชาติพัฒนากล้า": 807,
        "ชาติไทยพัฒนา": 360,
        "ประชาธิปัตย์": 16496,
        "พลังประชารัฐ": 785,
        "ภูมิใจไทย": 1010,
        "รวมไทยสร้างชาติ": 13518,
        "อนาคตไทย": 358,
        "เพื่อไทย": 14694,
        "เสรีรวมไทย": 915,
        "แนวทางใหม่": 387,
        "ไทยภักดี": 260,
        "ไทยสร้างไทย": 720
      }
    },
    {
      "district": 22,
      "total_votes": 92651,
      "party_votes": {
        "ก้าวไกล": 43083,
        "คลองไทย": 126,
        "ชาติพัฒนากล้า": 1038,
        "ทางเลือกใหม่": 200,
        "ประชาธิปัตย์": 6526,
        "พลังประชารัฐ": 2113,
        "ภูมิใจไทย": 7283,
        "รวมไทยสร้างชาติ": 16377,
        "เพื่อชาติ": 120,
        "เพื่อไทย": 13466,
        "เสรีรวมไทย": 569,
        "เส้นด้าย": 475,
        "ไทยภักดี": 252,
        "ไทยสร้างไทย": 1023
      }
    },
    {
      "district": 23,
      "total_votes": 101343,
      "party_votes": {
        "ก้าวไกล": 47225,
        "คลองไทย": 70,
        "ชาติพัฒนากล้า": 1487,
        "ชาติไทยพัฒนา": 1323,
        "ทางเลือกใหม่": 218,
        "ประชาธิปัตย์": 4547,
        "พลังประชารัฐ": 3314,
        "ภูมิใจไทย": 1002,
        "รวมไทยสร้างชาติ": 17956,
        "ราษฎร์วิถี": 73,
        "อนาคตไทย": 311,
        "เพื่อไทย": 17100,
        "เสรีรวมไทย": 856,
        "เส้นด้าย": 348,
        "ไทยภักดี": 205,
        "ไทยสร้างไทย": 5308
      }
    },
    {
      "district": 24,
      "total_votes": 97818,
      "party_votes": {
        "ก้าวไกล": 48317,
        "ชาติพัฒนากล้า": 728,
        "ชาติไทยพัฒนา": 456,
        "ประชาธิปัตย์": 6284,
        "พลังประชารัฐ": 2033,
        "ภูมิใจไทย": 775,
        "รวมไทยสร้างชาติ": 18320,
        "อนาคตไทย": 252,
        "เพื่อชาติ": 122,
        "เพื่อชาติไทย": 297,
        "เพื่อไทย": 17316,
        "เสรีรวมไทย": 868,
        "ไทยภักดี": 357,
        "ไทยสร้างไทย": 1693
      }
    },
    {
      "district": 25,
      "total_votes": 88869,
      "party_votes": {
        "ก้าวไกล": 35623,
        "ชาติพัฒนากล้า": 1127,
        "ชาติไทยพัฒนา": 396,
        "ทางเลือกใหม่": 87,
        "ประชาธิปัตย์": 5517,
        "พลังประชารัฐ": 1808,
        "ภูมิใจไทย": 670,
        "รวมไทยสร้างชาติ": 12264,
        "อนาคตไทย": 502,
        "เพื่อชาติ": 212,
        "เพื่อไทย": 28189,
        "เสรีรวมไทย": 490,
        "เส้นด้าย": 164,
        "แนวทางใหม่": 153,
        "ไทยภักดี": 354,
        "ไทยสร้างไทย": 1313
      }
    },
    {
      "district": 26,
      "total_votes": 96708,
      "party_votes": {
        "ก้าวไกล": 46570,
        "ชาติพัฒนากล้า": 470,
        "ชาติไทยพัฒนา": 488,
        "ประชาธิปัตย์": 8892,
        "พลังประชารัฐ": 362,
        "ภูมิใจไทย": 2282,
        "รวมไทยสร้างชาติ": 13150,
        "เพื่อไทย": 19813,
        "เสรีรวมไทย": 534,
        "ไทยภักดี": 425,
        "ไทยสร้างไทย": 3722
      }
    },
    {
      "district": 27,
      "total_votes": 97753,
      "party_votes": {
        "ก้าวไกล": 50035,
        "ชาติพัฒนากล้า": 527,
        "ชาติไทยพัฒนา": 345,
        "ประชาธิปัตย์": 23351,
        "พลังประชารัฐ": 717,
        "ภูมิใจไทย": 252,
        "รวมไทยสร้างชาติ": 6973,
        "เพื่อชาติ": 109,
        "เพื่อไทย": 13593,
        "เสมอภาค": 132,
        "เสรีรวมไทย": 484,
        "แนวทางใหม่": 174,
        "ไทยภักดี": 102,
        "ไทยสร้างไทย": 959
      }
    },
    {
      "district": 28,
      "total_votes": 101245,
      "party_votes": {
        "ก้าวไกล": 47592,
        "ชาติพัฒนากล้า": 681,
        "ประชาธิปัตย์": 11405,
        "พลังประชารัฐ": 646,
        "ภราดรภาพ": 311,
        "ภูมิใจไทย": 380,
        "รวมไทยสร้างชาติ": 10579,
        "เพื่อไทย": 26479,
        "เสรีรวมไทย": 671,
        "ไทยภักดี": 460,
        "ไทยสร้างไทย": 2041
      }
    },
    {
      "district": 29,
      "total_votes": 103561,
      "party_votes": {
        "ก้าวไกล": 47652,
        "คลองไทย": 116,
        "ชาติพัฒนากล้า": 5772,
        "ประชาธิปัตย์": 5045,
        "พลังประชารัฐ": 1948,
        "ภูมิใจไทย": 558,
        "รวมไทยสร้างชาติ": 15700,
        "เพื่อไทย": 23541,
        "เสรีรวมไทย": 992,
        "ไทยศรีวิไลย์": 278,
        "ไทยสร้างไทย": 1959
      }
    },
    {
      "district": 30,
      "total_votes": 99788,
      "party_votes": {
        "ก้าวไกล": 49770,
        "ชาติพัฒนากล้า": 1273,
        "ทางเลือกใหม่": 128,
        "ประชาธิปัตย์": 2633,
        "พลังประชารัฐ": 645,
        "ภูมิใจไทย": 577,
        "รวมไทยสร้างชาติ": 15783,
        "เพื่อไทย": 24520,
        "เสมอภาค": 282,
        "เสรีรวมไทย": 729,
        "ไทยภักดี": 502,
        "ไทยศรีวิไลย์": 196,
        "ไทยสมาร์ท": 394,
        "ไทยสร้างไทย": 2356
      }
    },
    {
      "district": 31,
      "total_votes": 105309,
      "party_votes": {
        "ก้าวไกล": 46405,
        "คลองไทย": 161,
        "ชาติพัฒนากล้า": 1367,
        "ทางเลือกใหม่": 245,
        "ประชาธิปัตย์": 3591,
        "พลังประชารัฐ": 2088,
        "ภูมิใจไทย": 1357,
        "รวมไทยสร้างชาติ": 23617,
        "เป็นธรรม": 247,
        "เพื่อชาติไทย": 322,
        "เพื่อไทย": 18479,
        "เสรีรวมไทย": 1964,
        "เส้นด้าย": 227,
        "ไทยภักดี": 597,
        "ไทยสร้างไทย": 4642
      }
    },
    {
      "district": 32,
      "total_votes": 96402,
      "party_votes": {
        "ก้าวไกล": 43115,
        "คลองไทย": 99,
        "ชาติพัฒนากล้า": 1383,
        "ชาติไทยพัฒนา": 482,
        "ทางเลือกใหม่": 335,
        "ประชาธิปัตย์": 11633,
        "พลังประชารัฐ": 935,
        "พลังสังคม": 114,
        "ภูมิใจไทย": 1597,
        "รวมไทยสร้างชาติ": 14888,
        "เป็นธรรม": 448,
        "เพื่อไทย": 18736,
        "เสรีรวมไทย": 899,
        "เส้นด้าย": 336,
        "ไทยภักดี": 444,
        "ไทยสร้างไทย": 958
      }
    },
    {
      "district": 33,
      "total_votes": 104231,
      "party_votes": {
        "ก้าวไกล": 45189,
        "ชาติพัฒนากล้า": 791,
        "ทางเลือกใหม่": 88,
        "ประชาธิปัตย์": 15817,
        "พลังประชารัฐ": 1041,
        "พลังสังคมใหม่": 142,
        "ภูมิใจไทย": 4100,
        "รวมไทยสร้างชาติ": 18628,
        "เพื่อชาติ": 215,
        "เพื่อชาติไทย": 153,
        "เพื่อไทย": 15053,
        "เสรีรวมไทย": 905,
        "เส้นด้าย": 229,
        "ไทยภักดี": 652,
        "ไทยสมาร์ท": 150,
        "ไทยสร้างไทย": 1078
      }
    }
  ],
  "กาญจนบุรี": [
    {
      "district": 1,
      "total_votes": 98623,
      "party_votes": {
        "ก้าวไกล": 25720,
        "ประชาธิปัตย์": 726,
        "พลังประชารัฐ": 19856,
        "พลังสังคมใหม่": 166,
        "ภูมิใจไทย": 7879,
        "รวมไทยสร้างชาติ": 9538,
        "เปลี่ยน": 289,
        "เพื่อชาติไทย": 287,
        "เพื่อไทย": 33183,
        "เสรีรวมไทย": 481,
        "ไทยสร้างไทย": 498
      }
    },
    {
      "district": 2,
      "total_votes": 102428,
      "party_votes": {
        "ก้าวไกล": 17531,
        "ชาติพัฒนากล้า": 184,
        "ประชาธิปัตย์": 18196,
        "พลังประชารัฐ": 20165,
        "พลังสังคมใหม่": 105,
        "ภูมิใจไทย": 18951,
        "รวมแผ่นดิน": 283,
        "รวมไทยสร้างชาติ": 2608,
        "เปลี่ยน": 417,
        "เพื่อชาติไทย": 51,
        "เพื่อไทย": 23278,
        "เสรีรวมไทย": 293,
        "ไทยสร้างไทย": 366
      }
    },
    {
      "district": 3,
      "total_votes": 107426,
      "party_votes": {
        "ก้าวไกล": 14071,
        "คลองไทย": 288,
        "ประชาธิปัตย์": 999,
        "พลังประชารัฐ": 910,
        "พลังสังคมใหม่": 87,
        "ภูมิใจไทย": 44813,
        "รวมไทยสร้างชาติ": 1501,
        "เพื่อไทย": 44033,
        "เสรีรวมไทย": 454,
        "ไทยสร้างไทย": 270
      }
    },
    {
      "district": 4,
      "total_votes": 96256,
      "party_votes": {
        "ก้าวไกล": 16125,
        "ครูไทยเพื่อประชาชน": 673,
        "ประชาธิปัตย์": 693,
        "พลังประชารัฐ": 27466,
        "ภูมิใจไทย": 1730,
        "รวมไทยสร้างชาติ": 1686,
        "เพื่อชาติไทย": 80,
        "เพื่อไทย": 45812,
        "เสรีรวมไทย": 195,
        "ไทยสร้างไทย": 1796
      }
    },
    {
      "district": 5,
      "total_votes": 81837,
      "party_votes": {
        "ก้าวไกล": 15983,
        "คลองไทย": 380,
        "ประชาธิปัตย์": 796,
        "พลังประชารัฐ": 21346,
        "พลังสังคมใหม่": 90,
        "ภูมิใจไทย": 8270,
        "รวมไทยสร้างชาติ": 2268,
        "เพื่อชาติไทย": 130,
        "เพื่อไทย": 31164,
        "เสรีรวมไทย": 427,
        "ไทยศรีวิไลย์": 565,
        "ไทยสร้างไทย": 418
      }
    }
  ],
  "กาฬสินธุ์": [
    {
      "district": 1,
      "total_votes": 89863,
      "party_votes": {
        "ก้าวไกล": 23039,
        "ประชาธิปัตย์": 465,
        "พลังประชารัฐ": 891,
        "พลังสังคมใหม่": 487,
        "ภูมิใจไทย": 3901,
        "รวมไทยสร้างชาติ": 2485,
        "เพื่อไทย": 56569,
        "เสรีรวมไทย": 557,
        "ไทยภักดี": 292,
        "ไทยสมาร์ท": 201,
        "ไทยสร้างไทย": 976
      }
    },
    {
      "district": 2,
      "total_votes": 87105,
      "party_votes": {
        "ก้าวไกล": 10427,
        "ประชาธิปัตย์": 288,
        "พลังประชารัฐ": 1398,
        "พลังสังคมใหม่": 319,
        "ภูมิใจไทย": 123,
        "รวมไทยสร้างชาติ": 849,
        "เพื่อไทย": 49784,
        "เสรีรวมไทย": 132,
        "ไทยภักดี": 227,
        "ไทยสมาร์ท": 63,
        "ไทยสร้างไทย": 23495
      }
    },
    {
      "district": 3,
      "total_votes": 80871,
      "party_votes": {
        "ก้าวไกล": 17936,
        "ประชาธิปัตย์": 551,
        "พลังประชารัฐ": 37044,
        "พลังปวงชนไทย": 150,
        "พลังสังคมใหม่": 302,
        "ภูมิใจไทย": 503,
        "รวมไทยสร้างชาติ": 1444,
        "เพื่อไทย": 21604,
        "เสรีรวมไทย": 981,
        "ไทยภักดี": 356
      }
    },
    {
      "district": 4,
      "total_votes": 90030,
      "party_votes": {
        "ก้าวไกล": 22020,
        "ประชาธิปัตย์": 563,
        "พลังประชารัฐ": 1804,
        "พลังปวงชนไทย": 154,
        "พลังสังคมใหม่": 207,
        "ภูมิใจไทย": 31536,
        "รวมไทยสร้างชาติ": 5700,
        "เพื่อไทย": 26766,
        "เสรีรวมไทย": 300,
        "ไทยภักดี": 386,
        "ไทยสร้างไทย": 594
      }
    },
    {
      "district": 5,
      "total_votes": 91506,
      "party_votes": {
        "ก้าวไกล": 15178,
        "ประชาธิปัตย์": 216,
        "พลังประชารัฐ": 32286,
        "พลังปวงชนไทย": 71,
        "พลังสังคมใหม่": 204,
        "ภูมิใจไทย": 714,
        "รวมไทยสร้างชาติ": 631,
        "เพื่อชาติ": 141,
        "เพื่อไทย": 39998,
        "เสรีรวมไทย": 950,
        "แนวทางใหม่": 211,
        "ไทยภักดี": 117,
        "ไทยสมาร์ท": 449,
        "ไทยสร้างไทย": 340
      }
    },
    {
      "district": 6,
      "total_votes": 88803,
      "party_votes": {
        "ก้าวไกล": 22935,
        "คลองไทย": 165,
        "ประชาธิปัตย์": 530,
        "พลังประชารัฐ": 9596,
        "พลังปวงชนไทย": 196,
        "พลังสังคมใหม่": 282,
        "ภูมิใจไทย": 2285,
        "รวมไทยสร้างชาติ": 5010,
        "เพื่อชาติ": 120,
        "เพื่อไทย": 44002,
        "เสรีรวมไทย": 1061,
        "ไทยภักดี": 155,
        "ไทยสร้างไทย": 2466
      }
    }
  ],
  "กำแพงเพชร": [
    {
      "district": 1,
      "total_votes": 96928,
      "party_votes": {
        "ก้าวไกล": 28944,
        "คลองไทย": 78,
        "ประชาธิปัตย์": 934,
        "พลังประชารัฐ": 36187,
        "พลังปวงชนไทย": 328,
        "รวมไทยสร้างชาติ": 10693,
        "เพื่อไทย": 18462,
        "เสรีรวมไทย": 757,
        "ไทยสร้างไทย": 424,
        "ไทยเป็นหนึ่ง": 121
      }
    },
    {
      "district": 2,
      "total_votes": 95664,
      "party_votes": {
        "ก้าวไกล": 24196,
        "ประชาธิปัตย์": 831,
        "พลังประชารัฐ": 41143,
        "รวมไทยสร้างชาติ": 6214,
        "เพื่อไทย": 18465,
        "เสรีรวมไทย": 575,
        "ไทยสร้างไทย": 3999,
        "ไทยเป็นหนึ่ง": 241
      }
    },
    {
      "district": 3,
      "total_votes": 87629,
      "party_votes": {
        "ก้าวไกล": 19584,
        "คลองไทย": 157,
        "ท้องที่ไทย": 395,
        "ประชาธิปัตย์": 2568,
        "พลังประชารัฐ": 37149,
        "พลังปวงชนไทย": 1127,
        "มิติใหม่": 220,
        "รวมไทยสร้างชาติ": 3943,
        "เพื่อไทย": 19626,
        "เสรีรวมไทย": 830,
        "ใหม่": 513,
        "ไทยศรีวิไลย์": 272,
        "ไทยสร้างไทย": 908,
        "ไทยเป็นหนึ่ง": 337
      }
    },
    {
      "district": 4,
      "total_votes": 90372,
      "party_votes": {
        "ก้าวไกล": 19232,
        "คลองไทย": 116,
        "ประชาธิปัตย์": 620,
        "พลังประชารัฐ": 36132,
        "พลังปวงชนไทย": 231,
        "พลังสหกรณ์": 216,
        "รวมไทยสร้างชาติ": 11067,
        "เพื่อไทย": 21741,
        "เสรีรวมไทย": 853,
        "ใหม่": 164
      }
    }
  ],
  "ขอนแก่น": [
    {
      "district": 1,
      "total_votes": 91799,
      "party_votes": {
        "ก้าวไกล": 39046,
        "คลองไทย": 138,
        "ทางเลือกใหม่": 59,
        "ประชาธิปัตย์": 873,
        "ประชาธิปไตยใหม่": 134,
        "ประชาไทย": 126,
        "พลังประชารัฐ": 4015,
        "ภูมิใจไทย": 1068,
        "รวมแผ่นดิน": 154,
        "รวมไทยสร้างชาติ": 16129,
        "เพื่อชาติไทย": 160,
        "เพื่อไทย": 26592,
        "เสรีรวมไทย": 1027,
        "ไทยชนะ": 138,
        "ไทยภักดี": 308,
        "ไทยศรีวิไลย์": 288,
        "ไทยสร้างไทย": 1544
      }
    },
    {
      "district": 2,
      "total_votes": 100727,
      "party_votes": {
        "ก้าวไกล": 38984,
        "คลองไทย": 208,
        "ประชาธิปัตย์": 858,
        "ประชาไทย": 457,
        "พลังประชารัฐ": 1153,
        "ภูมิใจไทย": 23515,
        "รวมแผ่นดิน": 181,
        "รวมไทยสร้างชาติ": 5302,
        "เพื่อชาติไทย": 212,
        "เพื่อไทย": 28502,
        "เสรีรวมไทย": 735,
        "แนวทางใหม่": 84,
        "ไทยชนะ": 147,
        "ไทยภักดี": 223,
        "ไทยศรีวิไลย์": 109,
        "ไทยสมาร์ท": 57
      }
    },
    {
      "district": 3,
      "total_votes": 93239,
      "party_votes": {
        "ก้าวไกล": 36731,
        "คลองไทย": 236,
        "ชาติไทยพัฒนา": 30085,
        "ทางเลือกใหม่": 153,
        "ประชาธิปัตย์": 194,
        "พลังประชารัฐ": 517,
        "ภูมิใจไทย": 3446,
        "รวมไทยสร้างชาติ": 1802,
        "เพื่อไทย": 17576,
        "เสรีรวมไทย": 533,
        "แนวทางใหม่": 832,
        "ไทยชนะ": 60,
        "ไทยภักดี": 83,
        "ไทยสมาร์ท": 388,
        "ไทยสร้างไทย": 603
      }
    },
    {
      "district": 4,
      "total_votes": 94639,
      "party_votes": {
        "ก้าวไกล": 26948,
        "คลองไทย": 166,
        "ทางเลือกใหม่": 580,
        "ประชาธิปัตย์": 297,
        "พลังประชารัฐ": 1140,
        "ภูมิใจไทย": 33104,
        "รวมแผ่นดิน": 211,
        "รวมใจไทย": 198,
        "รวมไทยสร้างชาติ": 1619,
        "ราษฎร์วิถี": 899,
        "เพื่อชาติไทย": 988,
        "เพื่อไทย": 26416,
        "เสรีรวมไทย": 706,
        "แนวทางใหม่": 78,
        "ไทยชนะ": 394,
        "ไทยภักดี": 73,
        "ไทยศรีวิไลย์": 342,
        "ไทยสมาร์ท": 93,
        "ไทยสร้างไทย": 387
      }
    },
    {
      "district": 5,
      "total_votes": 83050,
      "party_votes": {
        "ก้าวไกล": 19127,
        "คลองไทย": 34,
        "ประชาธิปัตย์": 854,
        "ประชาธิปไตยใหม่": 190,
        "พลังประชารัฐ": 1926,
        "ภูมิใจไทย": 573,
        "รวมแผ่นดิน": 389,
        "รวมไทยสร้างชาติ": 4212,
        "รักษ์ผืนป่าประเทศไทย": 988,
        "เปลี่ยนอนาคต": 393,
        "เพื่อชาติไทย": 418,
        "เพื่อไทย": 50429,
        "เสรีรวมไทย": 1797,
        "แนวทางใหม่": 70,
        "ไทยภักดี": 224,
        "ไทยศรีวิไลย์": 648,
        "ไทยสมาร์ท": 184,
        "ไทยสร้างไทย": 594
      }
    },
    {
      "district": 6,
      "total_votes": 86539,
      "party_votes": {
        "ก้าวไกล": 16543,
        "คลองไทย": 118,
        "ประชาธิปัตย์": 345,
        "พลังประชารัฐ": 7321,
        "พลังปวงชนไทย": 76,
        "พลังสังคมใหม่": 135,
        "ภูมิใจไทย": 29219,
        "รวมแผ่นดิน": 177,
        "รวมไทยสร้างชาติ": 1823,
        "เพื่อชาติไทย": 207,
        "เพื่อไทย": 29293,
        "เสรีรวมไทย": 571,
        "ไทยภักดี": 105,
        "ไทยสมาร์ท": 388,
        "ไทยสร้างไทย": 218
      }
    },
    {
      "district": 7,
      "total_votes": 93393,
      "party_votes": {
        "ก้าวไกล": 16263,
        "คลองไทย": 149,
        "ประชาธิปัตย์": 198,
        "พลังประชารัฐ": 22490,
        "ภูมิใจไทย": 12777,
        "รวมแผ่นดิน": 503,
        "รวมไทยสร้างชาติ": 775,
        "เพื่อไทย": 37980,
        "เสรีรวมไทย": 413,
        "แนวทางใหม่": 413,
        "ไทยชนะ": 107,
        "ไทยภักดี": 90,
        "ไทยศรีวิไลย์": 191,
        "ไทยสมาร์ท": 65,
        "ไทยสร้างไทย": 979
      }
    },
    {
      "district": 8,
      "total_votes": 96554,
      "party_votes": {
        "ก้าวไกล": 19879,
        "ชาติพัฒนากล้า": 432,
        "ประชาธิปัตย์": 647,
        "พลังประชารัฐ": 17888,
        "ภูมิใจไทย": 6064,
        "รวมแผ่นดิน": 186,
        "รวมไทยสร้างชาติ": 6174,
        "เพื่อไทย": 43191,
        "เสรีรวมไทย": 530,
        "ไทยชนะ": 615,
        "ไทยศรีวิไลย์": 276,
        "ไทยสมาร์ท": 294,
        "ไทยสร้างไทย": 378
      }
    },
    {
      "district": 9,
      "total_votes": 83036,
      "party_votes": {
        "ก้าวไกล": 15141,
        "ประชาธิปัตย์": 461,
        "ประชาธิปไตยใหม่": 282,
        "พลังประชารัฐ": 7821,
        "ภูมิใจไทย": 8934,
        "รวมแผ่นดิน": 93,
        "รวมไทยสร้างชาติ": 3052,
        "เพื่อชาติไทย": 262,
        "เพื่อไทย": 46057,
        "เสรีรวมไทย": 506,
        "ไทยชนะ": 268,
        "ไทยภักดี": 159
      }
    },
    {
      "district": 10,
      "total_votes": 87904,
      "party_votes": {
        "ก้าวไกล": 15185,
        "ครูไทยเพื่อประชาชน": 498,
        "คลองไทย": 422,
        "ชาติพัฒนากล้า": 170,
        "ประชาธิปัตย์": 381,
        "พลังประชารัฐ": 24296,
        "ภูมิใจไทย": 232,
        "รวมแผ่นดิน": 163,
        "รวมไทยสร้างชาติ": 1482,
        "เพื่อชาติไทย": 330,
        "เพื่อไทย": 44173,
        "เสรีรวมไทย": 399,
        "ไทยภักดี": 111,
        "ไทยสมาร์ท": 62
      }
    },
    {
      "district": 11,
      "total_votes": 90944,
      "party_votes": {
        "ก้าวไกล": 12029,
        "ประชาธิปัตย์": 373,
        "ประชาไทย": 209,
        "พลังประชารัฐ": 1271,
        "ภูมิใจไทย": 37529,
        "รวมไทยสร้างชาติ": 6270,
        "เพื่อไทย": 32864,
        "เสรีรวมไทย": 292,
        "ไทยภักดี": 63,
        "ไทยสมาร์ท": 44
      }
    }
  ],
  "จันทบุรี": [
    {
      "district": 1,
      "total_votes": 107873,
      "party_votes": {
        "ก้าวไกล": 37600,
        "ประชาธิปัตย์": 5629,
        "พลังประชารัฐ": 26055,
        "พลังปวงชนไทย": 124,
        "ภูมิใจไทย": 4359,
        "รวมไทยสร้างชาติ": 15930,
        "เพื่อไทย": 14473,
        "เสรีรวมไทย": 1034,
        "ไทยภักดี": 258,
        "ไทยสร้างไทย": 2411
      }
    },
    {
      "district": 2,
      "total_votes": 99264,
      "party_votes": {
        "ก้าวไกล": 34894,
        "ประชาธิปัตย์": 18322,
        "พลังประชารัฐ": 1090,
        "พลังปวงชนไทย": 191,
        "รวมไทยสร้างชาติ": 10992,
        "เพื่อไทย": 31610,
        "เสรีรวมไทย": 1713,
        "ไทยภักดี": 452
      }
    },
    {
      "district": 3,
      "total_votes": 98622,
      "party_votes": {
        "ก้าวไกล": 35428,
        "ประชาธิปัตย์": 1495,
        "พลังประชารัฐ": 20519,
        "พลังปวงชนไทย": 165,
        "ภูมิใจไทย": 18022,
        "รวมไทยสร้างชาติ": 5959,
        "เพื่อไทย": 15375,
        "เสรีรวมไทย": 593,
        "ไทยภักดี": 342,
        "ไทยสร้างไทย": 724
      }
    }
  ],
  "ฉะเชิงเทรา": [
    {
      "district": 1,
      "total_votes": 116536,
      "party_votes": {
        "ก้าวไกล": 26001,
        "คลองไทย": 254,
        "ชาติไทยพัฒนา": 4151,
        "ประชาธิปัตย์": 1409,
        "พลังประชารัฐ": 13595,
        "พลังปวงชนไทย": 171,
        "ภูมิใจไทย": 1223,
        "รวมไทยสร้างชาติ": 33000,
        "รักษ์ผืนป่าประเทศไทย": 70,
        "เพื่อไทย": 35488,
        "เสรีรวมไทย": 821,
        "ไทยภักดี": 119,
        "ไทยศรีวิไลย์": 234
      }
    },
    {
      "district": 2,
      "total_votes": 112133,
      "party_votes": {
        "ก้าวไกล": 22793,
        "คลองไทย": 185,
        "ประชาธิปัตย์": 1715,
        "พลังประชารัฐ": 42777,
        "พลังปวงชนไทย": 363,
        "ภูมิใจไทย": 387,
        "รวมไทยสร้างชาติ": 2798,
        "เพื่อไทย": 40785,
        "เสรีรวมไทย": 330
      }
    },
    {
      "district": 3,
      "total_votes": 105623,
      "party_votes": {
        "ก้าวไกล": 21955,
        "คลองไทย": 136,
        "ประชาธิปัตย์": 507,
        "พลังประชารัฐ": 928,
        "ภูมิใจไทย": 141,
        "รวมไทยสร้างชาติ": 34886,
        "เพื่อไทย": 45874,
        "เสรีรวมไทย": 562,
        "ไทยภักดี": 221,
        "ไทยศรีวิไลย์": 413
      }
    },
    {
      "district": 4,
      "total_votes": 116346,
      "party_votes": {
        "ก้าวไกล": 37381,
        "ประชาธิปัตย์": 874,
        "พลังประชารัฐ": 26873,
        "พลังปวงชนไทย": 179,
        "ภูมิใจไทย": 942,
        "รวมไทยสร้างชาติ": 26415,
        "เพื่อไทย": 22850,
        "เสรีรวมไทย": 674,
        "ไทยศรีวิไลย์": 158
      }
    }
  ],
  "ชลบุรี": [
    {
      "district": 1,
      "total_votes": 100045,
      "party_votes": {
        "ก้าวไกล": 36462,
        "คลองไทย": 57,
        "ประชาธิปัตย์": 751,
        "พลังประชารัฐ": 540,
        "ภูมิใจไทย": 445,
        "รวมไทยสร้างชาติ": 32543,
        "เพื่อไทย": 27786,
        "เสรีรวมไทย": 539,
        "ไทยภักดี": 403,
        "ไทยสมาร์ท": 85,
        "ไทยสร้างไทย": 434
      }
    },
    {
      "district": 2,
      "total_votes": 84875,
      "party_votes": {
        "ก้าวไกล": 30162,
        "คลองไทย": 105,
        "ประชาธิปัตย์": 528,
        "พลังประชารัฐ": 8612,
        "ภูมิใจไทย": 275,
        "รวมไทยสร้างชาติ": 23381,
        "สังคมประชาธิปไตยไทย": 103,
        "เพื่อไทย": 20667,
        "เสรีรวมไทย": 354,
        "ไทยภักดี": 251,
        "ไทยสมาร์ท": 75,
        "ไทยสร้างไทย": 362
      }
    },
    {
      "district": 3,
      "total_votes": 94699,
      "party_votes": {
        "ก้าวไกล": 33183,
        "คลองไทย": 151,
        "ประชาธิปัตย์": 505,
        "พลังประชารัฐ": 2359,
        "ภูมิใจไทย": 635,
        "รวมไทยสร้างชาติ": 25623,
        "สังคมประชาธิปไตยไทย": 87,
        "เพื่อไทย": 30095,
        "เสรีรวมไทย": 679,
        "ไทยภักดี": 178,
        "ไทยสมาร์ท": 278,
        "ไทยสร้างไทย": 926
      }
    },
    {
      "district": 4,
      "total_votes": 88355,
      "party_votes": {
        "ก้าวไกล": 24835,
        "คลองไทย": 254,
        "ประชาธิปัตย์": 1062,
        "พลังประชารัฐ": 450,
        "ภูมิใจไทย": 331,
        "รวมไทยสร้างชาติ": 36128,
        "เพื่อไทย": 24431,
        "เสรีรวมไทย": 358,
        "ไทยภักดี": 111,
        "ไทยสร้างไทย": 395
      }
    },
    {
      "district": 5,
      "total_votes": 105275,
      "party_votes": {
        "ก้าวไกล": 24038,
        "คลองไทย": 63,
        "ประชาธิปัตย์": 459,
        "พลังประชารัฐ": 3369,
        "ภูมิใจไทย": 367,
        "รวมไทยสร้างชาติ": 33814,
        "เพื่อไทย": 41939,
        "เสรีรวมไทย": 480,
        "ไทยภักดี": 200,
        "ไทยสร้างไทย": 546
      }
    },
    {
      "district": 6,
      "total_votes": 97578,
      "party_votes": {
        "ก้าวไกล": 37572,
        "คลองไทย": 150,
        "ประชาธิปัตย์": 774,
        "พลังประชารัฐ": 367,
        "ภูมิใจไทย": 4538,
        "รวมไทยสร้างชาติ": 24158,
        "สังคมประชาธิปไตยไทย": 122,
        "เพื่อไทย": 27879,
        "เสรีรวมไทย": 1208,
        "ไทยภักดี": 354,
        "ไทยสมาร์ท": 136,
        "ไทยสร้างไทย": 320
      }
    },
    {
      "district": 7,
      "total_votes": 89027,
      "party_votes": {
        "ก้าวไกล": 40918,
        "คลองไทย": 159,
        "ประชาธิปัตย์": 608,
        "พลังประชารัฐ": 421,
        "ภูมิใจไทย": 641,
        "มิติใหม่": 385,
        "รวมไทยสร้างชาติ": 13900,
        "สังคมประชาธิปไตยไทย": 410,
        "เพื่อชาติ": 295,
        "เพื่อไทย": 28983,
        "เสรีรวมไทย": 1247,
        "ไทยภักดี": 227,
        "ไทยสร้างไทย": 833
      }
    },
    {
      "district": 8,
      "total_votes": 91934,
      "party_votes": {
        "ก้าวไกล": 35270,
        "คลองไทย": 142,
        "ประชาธิปัตย์": 1860,
        "พลังประชารัฐ": 493,
        "ภูมิใจไทย": 515,
        "รวมไทยสร้างชาติ": 18269,
        "เพื่อไทย": 32699,
        "เสรีรวมไทย": 1473,
        "ไทยภักดี": 756,
        "ไทยสร้างไทย": 457
      }
    },
    {
      "district": 9,
      "total_votes": 72840,
      "party_votes": {
        "ก้าวไกล": 30459,
        "คลองไทย": 103,
        "ประชาธิปัตย์": 544,
        "พลังประชารัฐ": 807,
        "ภูมิใจไทย": 659,
        "รวมไทยสร้างชาติ": 19253,
        "เพื่อไทย": 19327,
        "เสรีรวมไทย": 717,
        "ไทยภักดี": 606,
        "ไทยสร้างไทย": 365
      }
    },
    {
      "district": 10,
      "total_votes": 87961,
      "party_votes": {
        "ก้าวไกล": 25957,
        "คลองไทย": 225,
        "ประชาธิปัตย์": 419,
        "พลังประชารัฐ": 27461,
        "ภูมิใจไทย": 356,
        "รวมไทยสร้างชาติ": 5087,
        "เพื่อชาติ": 331,
        "เพื่อไทย": 27387,
        "ไทยภักดี": 283,
        "ไทยสร้างไทย": 455
      }
    }
  ],
  "ชัยนาท": [
    {
      "district": 1,
      "total_votes": 94988,
      "party_votes": {
        "ก้าวไกล": 27497,
        "คลองไทย": 164,
        "ชาติพัฒนากล้า": 3236,
        "ประชาธิปัตย์": 1744,
        "ภูมิใจไทย": 792,
        "รวมไทยสร้างชาติ": 43935,
        "เพื่อไทย": 16410,
        "เสรีรวมไทย": 346,
        "ไทยภักดี": 220,
        "ไทยสร้างไทย": 644
      }
    },
    {
      "district": 2,
      "total_votes": 96042,
      "party_votes": {
        "ก้าวไกล": 20676,
        "ชาติพัฒนากล้า": 1124,
        "ประชาธิปัตย์": 529,
        "พลังประชารัฐ": 1995,
        "ภูมิใจไทย": 52205,
        "รวมไทยสร้างชาติ": 1581,
        "เพื่อไทย": 16352,
        "เสรีรวมไทย": 478,
        "ไทยภักดี": 192,
        "ไทยสร้างไทย": 910
      }
    }
  ],
  "ชัยภูมิ": [
    {
      "district": 1,
      "total_votes": 91107,
      "party_votes": {
        "ก้าวไกล": 24247,
        "คลองไทย": 131,
        "ประชาธิปัตย์": 374,
        "พลังประชารัฐ": 21888,
        "ภูมิใจไทย": 226,
        "รวมแผ่นดิน": 14775,
        "รวมไทยสร้างชาติ": 2846,
        "เพื่อไทย": 26130,
        "เสรีรวมไทย": 242,
        "ไทยภักดี": 248
      }
    },
    {
      "district": 2,
      "total_votes": 91083,
      "party_votes": {
        "ก้าวไกล": 17823,
        "คลองไทย": 129,
        "ประชาธิปัตย์": 739,
        "พลังประชารัฐ": 6877,
        "ภูมิใจไทย": 115,
        "รวมไทยสร้างชาติ": 2540,
        "เพื่อไทย": 61414,
        "เสรีรวมไทย": 473,
        "ไทยภักดี": 423,
        "ไทยสร้างไทย": 550
      }
    },
    {
      "district": 3,
      "total_votes": 84249,
      "party_votes": {
        "ก้าวไกล": 12303,
        "คลองไทย": 96,
        "ประชาธิปัตย์": 330,
        "ประชาธิปไตยใหม่": 57,
        "พลังประชารัฐ": 14246,
        "ภูมิใจไทย": 35846,
        "รวมไทยสร้างชาติ": 1170,
        "เพื่ออนาคตไทย": 102,
        "เพื่อไทย": 19142,
        "เสรีรวมไทย": 212,
        "ไทยสร้างไทย": 745
      }
    },
    {
      "district": 4,
      "total_votes": 76596,
      "party_votes": {
        "ก้าวไกล": 14817,
        "ประชาธิปัตย์": 422,
        "ประชาธิปไตยใหม่": 138,
        "พลังประชารัฐ": 21432,
        "ภูมิใจไทย": 18846,
        "รวมแผ่นดิน": 348,
        "รวมไทยสร้างชาติ": 1422,
        "เพื่อไทย": 16755,
        "เสรีรวมไทย": 305,
        "ไทยภักดี": 90,
        "ไทยสร้างไทย": 2021
      }
    },
    {
      "district": 5,
      "total_votes": 87470,
      "party_votes": {
        "ก้าวไกล": 15634,
        "ประชาธิปัตย์": 1056,
        "พลังประชารัฐ": 31178,
        "ภูมิใจไทย": 212,
        "รวมไทยสร้างชาติ": 937,
        "เพื่อไทย": 35000,
        "เสรีรวมไทย": 606,
        "ไทยภักดี": 323,
        "ไทยสร้างไทย": 2524
      }
    },
    {
      "district": 6,
      "total_votes": 92261,
      "party_votes": {
        "ก้าวไกล": 15439,
        "ครูไทยเพื่อประชาชน": 632,
        "ประชาธิปัตย์": 264,
        "พลังประชารัฐ": 2185,
        "ภูมิใจไทย": 38452,
        "รวมไทยสร้างชาติ": 908,
        "เพื่ออนาคตไทย": 59,
        "เพื่อไทย": 22816,
        "เสรีรวมไทย": 173,
        "ไทยภักดี": 100,
        "ไทยสร้างไทย": 11233
      }
    },
    {
      "district": 7,
      "total_votes": 85479,
      "party_votes": {
        "ก้าวไกล": 22980,
        "ครูไทยเพื่อประชาชน": 310,
        "ชาติไทยพัฒนา": 990,
        "ประชาธิปัตย์": 245,
        "พลังประชารัฐ": 38498,
        "ภูมิใจไทย": 161,
        "รวมไทยสร้างชาติ": 1162,
        "เพื่อไทย": 15201,
        "เสรีรวมไทย": 231,
        "ไทยภักดี": 95,
        "ไทยสร้างไทย": 5606
      }
    }
  ],
  "ชุมพร": [
    {
      "district": 1,
      "total_votes": 102510,
      "party_votes": {
        "กรีน": 274,
        "ก้าวไกล": 13645,
        "คลองไทย": 142,
        "ประชาธิปัตย์": 32084,
        "พลังประชารัฐ": 15592,
        "ภูมิใจไทย": 398,
        "รวมไทยสร้างชาติ": 36222,
        "เพื่อชาติ": 1017,
        "เพื่อไทย": 1963,
        "เสรีรวมไทย": 396,
        "ไทยภักดี": 125,
        "ไทยศรีวิไลย์": 162,
        "ไทยสร้างไทย": 490
      }
    },
    {
      "district": 2,
      "total_votes": 101759,
      "party_votes": {
        "ก้าวไกล": 14211,
        "คลองไทย": 440,
        "ความหวังใหม่": 499,
        "ชาติพัฒนากล้า": 4845,
        "ประชาธิปัตย์": 15518,
        "พลังประชารัฐ": 25232,
        "ภูมิใจไทย": 4007,
        "รวมแผ่นดิน": 1034,
        "รวมไทยสร้างชาติ": 32500,
        "เพื่อไทย": 2447,
        "ไทยภักดี": 612,
        "ไทยสร้างไทย": 414
      }
    },
    {
      "district": 3,
      "total_votes": 94678,
      "party_votes": {
        "ก้าวไกล": 16650,
        "คลองไทย": 390,
        "ประชาธิปัตย์": 27414,
        "พลังประชารัฐ": 1438,
        "ภูมิใจไทย": 780,
        "รวมไทยสร้างชาติ": 41231,
        "เพื่อไทย": 4411,
        "เสรีรวมไทย": 1707,
        "ไทยสร้างไทย": 657
      }
    }
  ],
  "ตรัง": [
    {
      "district": 1,
      "total_votes": 96267,
      "party_votes": {
        "กรีน": 447,
        "ก้าวไกล": 17688,
        "คลองไทย": 270,
        "ประชาธิปัตย์": 7096,
        "พลังประชารัฐ": 21022,
        "ภูมิใจไทย": 19179,
        "รวมแผ่นดิน": 213,
        "รวมไทยสร้างชาติ": 25970,
        "เปลี่ยน": 257,
        "เพื่อไทย": 3317,
        "เสรีรวมไทย": 238,
        "ไทยภักดี": 228,
        "ไทยสร้างไทย": 342
      }
    },
    {
      "district": 2,
      "total_votes": 98666,
      "party_votes": {
        "กรีน": 458,
        "ก้าวไกล": 10553,
        "คลองไทย": 137,
        "ประชาธิปัตย์": 17238,
        "พลังประชารัฐ": 63182,
        "ภูมิใจไทย": 1231,
        "รวมแผ่นดิน": 475,
        "รวมไทยสร้างชาติ": 2802,
        "เปลี่ยน": 183,
        "เพื่อไทย": 1510,
        "เสรีรวมไทย": 237,
        "ไทยสร้างไทย": 660
      }
    },
    {
      "district": 3,
      "total_votes": 85914,
      "party_votes": {
        "กรีน": 418,
        "ก้าวไกล": 16483,
        "คลองไทย": 198,
        "ประชาธิปัตย์": 31846,
        "พลังธรรมใหม่": 934,
        "พลังประชารัฐ": 14866,
        "พลังปวงชนไทย": 148,
        "ภูมิใจไทย": 2767,
        "รวมไทยสร้างชาติ": 9245,
        "เปลี่ยน": 382,
        "เพื่อชาติ": 455,
        "เพื่อไทย": 5864,
        "เสรีรวมไทย": 976,
        "แรงงานสร้างชาติ": 262,
        "ไทยภักดี": 491,
        "ไทยสร้างไทย": 579
      }
    },
    {
      "district": 4,
      "total_votes": 96660,
      "party_votes": {
        "ก้าวไกล": 11237,
        "คลองไทย": 267,
        "ประชาธิปัตย์": 29594,
        "พลังประชารัฐ": 16236,
        "พลังปวงชนไทย": 415,
        "ภูมิใจไทย": 29202,
        "รวมไทยสร้างชาติ": 4963,
        "เปลี่ยน": 282,
        "เพื่อชาติไทย": 225,
        "เพื่อไทย": 2719,
        "เสรีรวมไทย": 372,
        "ไทยภักดี": 186,
        "ไทยสร้างไทย": 962
      }
    }
  ],
  "ตราด": [
    {
      "district": 1,
      "total_votes": 121082,
      "party_votes": {
        "ก้าวไกล": 47046,
        "ประชาธิปัตย์": 7798,
        "พลังประชารัฐ": 19082,
        "ภูมิใจไทย": 8624,
        "รวมไทยสร้างชาติ": 11684,
        "เพื่อไทย": 24966,
        "เสรีรวมไทย": 1410,
        "ไทยสร้างไทย": 472
      }
    }
  ],
  "ตาก": [
    {
      "district": 1,
      "total_votes": 103556,
      "party_votes": {
        "ก้าวไกล": 27664,
        "ครูไทยเพื่อประชาชน": 876,
        "คลองไทย": 228,
        "ประชาธิปัตย์": 3962,
        "พลังประชารัฐ": 21013,
        "พลังปวงชนไทย": 469,
        "ภูมิใจไทย": 21704,
        "รวมไทยสร้างชาติ": 3644,
        "เพื่อชาติ": 583,
        "เพื่อไทย": 20798,
        "เสรีรวมไทย": 795,
        "ไทยสร้างไทย": 1820
      }
    },
    {
      "district": 2,
      "total_votes": 85630,
      "party_votes": {
        "ก้าวไกล": 24133,
        "ประชาธิปัตย์": 739,
        "พลังประชารัฐ": 9946,
        "พลังปวงชนไทย": 260,
        "ภูมิใจไทย": 13566,
        "รวมไทยสร้างชาติ": 2671,
        "เพื่อชาติ": 15621,
        "เพื่อไทย": 15705,
        "เสรีรวมไทย": 524,
        "ไทยสร้างไทย": 2465
      }
    },
    {
      "district": 3,
      "total_votes": 88114,
      "party_votes": {
        "ก้าวไกล": 17380,
        "ประชาธิปัตย์": 9212,
        "พลังประชารัฐ": 31550,
        "พลังปวงชนไทย": 344,
        "ภูมิใจไทย": 14164,
        "รวมไทยสร้างชาติ": 1824,
        "เพื่อชาติ": 1103,
        "เพื่อไทย": 11048,
        "เสรีรวมไทย": 1030,
        "ไทยสร้างไทย": 459
      }
    }
  ],
  "นครนายก": [
    {
      "district": 1,
      "total_votes": 79785,
      "party_votes": {
        "ก้าวไกล": 13431,
        "ประชาธิปัตย์": 1313,
        "พลังประชารัฐ": 421,
        "ภูมิใจไทย": 25191,
        "รวมไทยสร้างชาติ": 6654,
        "เพื่อไทย": 32030,
        "เสรีรวมไทย": 301,
        "ใหม่": 289,
        "ไทยภักดี": 155
      }
    },
    {
      "district": 2,
      "total_votes": 84123,
      "party_votes": {
        "ก้าวไกล": 14406,
        "ประชาธิปัตย์": 2132,
        "พลังประชารัฐ": 371,
        "ภาคีเครือข่ายไทย": 107,
        "ภูมิใจไทย": 24479,
        "รวมไทยสร้างชาติ": 2292,
        "เพื่อไทย": 39496,
        "เสรีรวมไทย": 236,
        "ใหม่": 399,
        "ไทยภักดี": 205
      }
    }
  ],
  "นครปฐม": [
    {
      "district": 1,
      "total_votes": 102216,
      "party_votes": {
        "ก้าวไกล": 27106,
        "ชาติไทยพัฒนา": 39899,
        "ช่วยชาติ": 279,
        "ประชาธิปัตย์": 659,
        "พลังประชารัฐ": 422,
        "ภูมิใจไทย": 96,
        "รวมแผ่นดิน": 404,
        "รวมไทยสร้างชาติ": 25108,
        "เพื่อไทย": 7118,
        "เสรีรวมไทย": 461,
        "ไทยภักดี": 147,
        "ไทยสร้างไทย": 517
      }
    },
    {
      "district": 2,
      "total_votes": 93691,
      "party_votes": {
        "ก้าวไกล": 32056,
        "ชาติไทยพัฒนา": 963,
        "ประชาธิปัตย์": 1095,
        "พลังประชารัฐ": 15465,
        "ภูมิใจไทย": 392,
        "รวมไทยสร้างชาติ": 33770,
        "เพื่อไทย": 8950,
        "เสรีรวมไทย": 746,
        "ไทยภักดี": 254
      }
    },
    {
      "district": 3,
      "total_votes": 90960,
      "party_votes": {
        "ก้าวไกล": 24814,
        "ชาติพัฒนากล้า": 286,
        "ชาติไทยพัฒนา": 42825,
        "ประชาธิปัตย์": 527,
        "พลังประชารัฐ": 1402,
        "รวมไทยสร้างชาติ": 3479,
        "เพื่อไทย": 15920,
        "เสรีรวมไทย": 854,
        "ไทยภักดี": 436,
        "ไทยสร้างไทย": 417
      }
    },
    {
      "district": 4,
      "total_votes": 101691,
      "party_votes": {
        "ก้าวไกล": 24898,
        "ชาติพัฒนากล้า": 658,
        "ชาติไทยพัฒนา": 19861,
        "ประชาธิปัตย์": 16281,
        "พลังประชารัฐ": 12999,
        "ภูมิใจไทย": 7780,
        "รวมไทยสร้างชาติ": 2547,
        "เพื่อไทย": 15305,
        "เสรีรวมไทย": 512,
        "ไทยภักดี": 237,
        "ไทยสร้างไทย": 613
      }
    },
    {
      "district": 5,
      "total_votes": 102473,
      "party_votes": {
        "ก้าวไกล": 24896,
        "ชาติพัฒนากล้า": 387,
        "ชาติไทยพัฒนา": 36422,
        "ประชาธิปัตย์": 555,
        "พลังประชารัฐ": 510,
        "ภูมิใจไทย": 24156,
        "รวมไทยสร้างชาติ": 6357,
        "เพื่อไทย": 8452,
        "เสรีรวมไทย": 609,
        "ไทยภักดี": 129
      }
    },
    {
      "district": 6,
      "total_votes": 92194,
      "party_votes": {
        "ก้าวไกล": 38812,
        "คลองไทย": 198,
        "ชาติพัฒนากล้า": 580,
        "ชาติไทยพัฒนา": 19742,
        "ประชาธิปัตย์": 1140,
        "พลังประชารัฐ": 839,
        "ภูมิใจไทย": 309,
        "รวมไทยสร้างชาติ": 17560,
        "เพื่อไทย": 11020,
        "เสรีรวมไทย": 978,
        "ไทยภักดี": 161,
        "ไทยศรีวิไลย์": 339,
        "ไทยสร้างไทย": 516
      }
    }
  ],
  "นครพนม": [
    {
      "district": 1,
      "total_votes": 95494,
      "party_votes": {
        "ก้าวไกล": 11637,
        "ช่วยชาติ": 158,
        "ประชาธิปัตย์": 351,
        "พลังประชารัฐ": 799,
        "พลังสังคมใหม่": 216,
        "ภูมิใจไทย": 33977,
        "รวมไทยสร้างชาติ": 482,
        "ราษฎร์วิถี": 103,
        "เพื่อไทย": 44712,
        "เสรีรวมไทย": 436,
        "ไทยภักดี": 78,
        "ไทยสมาร์ท": 374,
        "ไทยสร้างไทย": 2171
      }
    },
    {
      "district": 2,
      "total_votes": 94938,
      "party_votes": {
        "ก้าวไกล": 16235,
        "ประชาธิปัตย์": 450,
        "พลังประชารัฐ": 5538,
        "ภูมิใจไทย": 30528,
        "รวมไทยสร้างชาติ": 673,
        "เพื่อไทย": 39856,
        "เสรีรวมไทย": 348,
        "ไทยภักดี": 94,
        "ไทยศรีวิไลย์": 201,
        "ไทยสร้างไทย": 1015
      }
    },
    {
      "district": 3,
      "total_votes": 93958,
      "party_votes": {
        "ก้าวไกล": 16872,
        "ทางเลือกใหม่": 220,
        "ประชาธิปัตย์": 258,
        "พลังประชารัฐ": 1758,
        "ภูมิใจไทย": 41738,
        "รวมไทยสร้างชาติ": 574,
        "เพื่อไทย": 28966,
        "เสรีรวมไทย": 391,
        "แนวทางใหม่": 473,
        "ไทยพร้อม": 627,
        "ไทยภักดี": 359,
        "ไทยศรีวิไลย์": 114,
        "ไทยสมาร์ท": 388,
        "ไทยสร้างไทย": 1220
      }
    },
    {
      "district": 4,
      "total_votes": 95673,
      "party_votes": {
        "ก้าวไกล": 12994,
        "ชาติไทยพัฒนา": 848,
        "ประชาธิปัตย์": 248,
        "พลังประชาธิปไตย": 296,
        "พลังประชารัฐ": 382,
        "พลังปวงชนไทย": 245,
        "ภูมิใจไทย": 25253,
        "รวมไทยสร้างชาติ": 1195,
        "เพื่อไทย": 21658,
        "เสรีรวมไทย": 20840,
        "แนวทางใหม่": 111,
        "ไทยพร้อม": 484,
        "ไทยภักดี": 152,
        "ไทยศรีวิไลย์": 94,
        "ไทยสร้างไทย": 10873
      }
    }
  ],
  "นครราชสีมา": [
    {
      "district": 1,
      "total_votes": 94025,
      "party_votes": {
        "ก้าวไกล": 37043,
        "ชาติพัฒนากล้า": 29142,
        "ประชากรไทย": 261,
        "ประชาธิปัตย์": 952,
        "พลังประชารัฐ": 5452,
        "ภูมิใจไทย": 902,
        "รวมไทยสร้างชาติ": 7456,
        "รักษ์ธรรม": 232,
        "เพื่อไทย": 9224,
        "เสรีรวมไทย": 475,
        "แนวทางใหม่": 1197,
        "ไทยภักดี": 337,
        "ไทยศรีวิไลย์": 755,
        "ไทยสร้างไทย": 597
      }
    },
    {
      "district": 2,
      "total_votes": 99896,
      "party_votes": {
        "ก้าวไกล": 42401,
        "ชาติพัฒนากล้า": 30062,
        "ประชากรไทย": 646,
        "ประชาธิปัตย์": 574,
        "พลังประชารัฐ": 9849,
        "ภูมิใจไทย": 591,
        "รวมไทยสร้างชาติ": 4345,
        "เพื่อชาติไทย": 534,
        "เพื่อไทย": 8888,
        "เสรีรวมไทย": 670,
        "ไทยภักดี": 254,
        "ไทยศรีวิไลย์": 444,
        "ไทยสร้างไทย": 638
      }
    },
    {
      "district": 3,
      "total_votes": 98837,
      "party_votes": {
        "ก้าวไกล": 38982,
        "ชาติพัฒนากล้า": 31768,
        "ทางเลือกใหม่": 196,
        "ประชากรไทย": 955,
        "ประชาธิปัตย์": 1398,
        "พลังประชารัฐ": 881,
        "ภูมิใจไทย": 877,
        "รวมไทยสร้างชาติ": 5359,
        "เพื่อชาติไทย": 748,
        "เพื่อไทย": 15853,
        "เสรีรวมไทย": 618,
        "แนวทางใหม่": 83,
        "ไทยภักดี": 377,
        "ไทยศรีวิไลย์": 215,
        "ไทยสร้างไทย": 527
      }
    },
    {
      "district": 4,
      "total_votes": 96267,
      "party_votes": {
        "ก้าวไกล": 19683,
        "ชาติพัฒนากล้า": 31216,
        "ประชาธิปัตย์": 552,
        "พลังประชารัฐ": 704,
        "ภูมิใจไทย": 3707,
        "รวมไทยสร้างชาติ": 2416,
        "เพื่อไทย": 37150,
        "เสรีรวมไทย": 515,
        "ไทยภักดี": 130,
        "ไทยสร้างไทย": 194
      }
    },
    {
      "district": 5,
      "total_votes": 95662,
      "party_votes": {
        "ก้าวไกล": 15653,
        "ชาติพัฒนากล้า": 156,
        "ประชากรไทย": 158,
        "ประชาธิปัตย์": 351,
        "ประชาไทย": 159,
        "พลังประชารัฐ": 29118,
        "ภูมิใจไทย": 1611,
        "รวมไทยสร้างชาติ": 1573,
        "เพื่อไทย": 46479,
        "ไทยพร้อม": 310,
        "ไทยภักดี": 94
      }
    },
    {
      "district": 6,
      "total_votes": 86830,
      "party_votes": {
        "ก้าวไกล": 16857,
        "คลองไทย": 193,
        "ชาติพัฒนากล้า": 605,
        "ประชาธิปัตย์": 277,
        "พลังประชารัฐ": 19172,
        "ภูมิใจไทย": 13126,
        "รวมไทยสร้างชาติ": 3287,
        "เพื่อไทย": 32136,
        "เสรีรวมไทย": 298,
        "แนวทางใหม่": 140,
        "ไทยภักดี": 256,
        "ไทยสร้างไทย": 483
      }
    },
    {
      "district": 7,
      "total_votes": 87029,
      "party_votes": {
        "ก้าวไกล": 10291,
        "คลองไทย": 495,
        "ชาติพัฒนากล้า": 344,
        "ประชาธิปัตย์": 454,
        "พลังประชารัฐ": 22130,
        "ภูมิใจไทย": 495,
        "รวมไทยสร้างชาติ": 1012,
        "เพื่อไทย": 51348,
        "เสรีรวมไทย": 327,
        "ไทยธรรม": 54,
        "ไทยภักดี": 79
      }
    },
    {
      "district": 8,
      "total_votes": 92391,
      "party_votes": {
        "ก้าวไกล": 11795,
        "ชาติพัฒนากล้า": 648,
        "ประชาธิปัตย์": 2112,
        "พลังประชารัฐ": 23578,
        "ภูมิใจไทย": 211,
        "รวมไทยสร้างชาติ": 2004,
        "เพื่อชาติไทย": 302,
        "เพื่อไทย": 51320,
        "เสรีรวมไทย": 218,
        "แนวทางใหม่": 125,
        "ไทยภักดี": 78
      }
    },
    {
      "district": 9,
      "total_votes": 94994,
      "party_votes": {
        "ก้าวไกล": 11666,
        "ชาติพัฒนากล้า": 328,
        "ประชาธิปัตย์": 258,
        "พลังประชารัฐ": 18070,
        "ภูมิใจไทย": 38241,
        "รวมไทยสร้างชาติ": 1486,
        "เพื่อไทย": 24527,
        "เสรีรวมไทย": 129,
        "ไทยภักดี": 289
      }
    },
    {
      "district": 10,
      "total_votes": 108903,
      "party_votes": {
        "ก้าวไกล": 15170,
        "คลองไทย": 426,
        "ชาติพัฒนากล้า": 243,
        "ประชาธิปัตย์": 165,
        "พลังประชารัฐ": 182,
        "ภูมิใจไทย": 37466,
        "รวมไทยสร้างชาติ": 3233,
        "เพื่อไทย": 51206,
        "เสรีรวมไทย": 564,
        "แนวทางใหม่": 96,
        "ไทยภักดี": 152
      }
    },
    {
      "district": 11,
      "total_votes": 97011,
      "party_votes": {
        "ก้าวไกล": 12754,
        "คลองไทย": 105,
        "ชาติพัฒนากล้า": 194,
        "ประชาธิปัตย์": 358,
        "พลังประชารัฐ": 345,
        "ภูมิใจไทย": 20982,
        "รวมไทยสร้างชาติ": 1151,
        "เพื่อไทย": 60326,
        "เสรีรวมไทย": 453,
        "แนวทางใหม่": 169,
        "ไทยภักดี": 174
      }
    },
    {
      "district": 12,
      "total_votes": 98989,
      "party_votes": {
        "ก้าวไกล": 12326,
        "คลองไทย": 224,
        "ชาติพัฒนากล้า": 306,
        "ประชาธิปัตย์": 104,
        "พลังประชารัฐ": 906,
        "ภูมิใจไทย": 30824,
        "รวมไทยสร้างชาติ": 9283,
        "เพื่อไทย": 44072,
        "เสรีรวมไทย": 232,
        "แนวทางใหม่": 117,
        "ไทยภักดี": 71,
        "ไทยสร้างไทย": 524
      }
    },
    {
      "district": 13,
      "total_votes": 87887,
      "party_votes": {
        "ก้าวไกล": 17398,
        "คลองไทย": 213,
        "ชาติพัฒนากล้า": 293,
        "ประชาธิปัตย์": 389,
        "พลังประชารัฐ": 16110,
        "ภูมิใจไทย": 796,
        "รวมไทยสร้างชาติ": 3693,
        "เพื่อไทย": 47000,
        "เสรีรวมไทย": 566,
        "ไทยภักดี": 176,
        "ไทยศรีวิไลย์": 770,
        "ไทยสร้างไทย": 483
      }
    },
    {
      "district": 14,
      "total_votes": 90645,
      "party_votes": {
        "ก้าวไกล": 23829,
        "ชาติพัฒนากล้า": 270,
        "ประชาธิปัตย์": 15175,
        "พลังประชารัฐ": 11998,
        "ภูมิใจไทย": 1643,
        "รวมไทยสร้างชาติ": 4115,
        "เพื่อไทย": 32596,
        "เสรีรวมไทย": 380,
        "ไทยภักดี": 120,
        "ไทยสร้างไทย": 519
      }
    },
    {
      "district": 15,
      "total_votes": 101264,
      "party_votes": {
        "ก้าวไกล": 13329,
        "คลองไทย": 145,
        "ชาติพัฒนากล้า": 342,
        "ชาติรุ่งเรือง": 68,
        "ประชากรไทย": 64,
        "ประชาธิปัตย์": 508,
        "พลังประชารัฐ": 11382,
        "ภูมิใจไทย": 27915,
        "รวมไทยสร้างชาติ": 1991,
        "เพื่อชาติไทย": 456,
        "เพื่อไทย": 44121,
        "เสรีรวมไทย": 239,
        "ไทยภักดี": 449,
        "ไทยศรีวิไลย์": 255
      }
    },
    {
      "district": 16,
      "total_votes": 93136,
      "party_votes": {
        "ก้าวไกล": 14581,
        "คลองไทย": 144,
        "ชาติพัฒนากล้า": 173,
        "ประชาธิปัตย์": 1061,
        "พลังประชารัฐ": 24895,
        "ภูมิใจไทย": 12784,
        "รวมไทยสร้างชาติ": 1175,
        "เพื่อไทย": 37412,
        "เสรีรวมไทย": 245,
        "ไทยธรรม": 61,
        "ไทยภักดี": 437,
        "ไทยสร้างไทย": 168
      }
    }
  ],
  "นครศรีธรรมราช": [
    {
      "district": 1,
      "total_votes": 85937,
      "party_votes": {
        "ก้าวไกล": 18875,
        "ชาติพัฒนากล้า": 1104,
        "ทางเลือกใหม่": 223,
        "ประชาธิปัตย์": 20334,
        "พลังประชารัฐ": 17304,
        "พลังปวงชนไทย": 131,
        "ภูมิใจไทย": 9237,
        "รวมไทยสร้างชาติ": 13139,
        "เพื่อไทย": 3509,
        "เสรีรวมไทย": 916,
        "แนวทางใหม่": 100,
        "ไทยภักดี": 312,
        "ไทยสมาร์ท": 108,
        "ไทยสร้างไทย": 645
      }
    },
    {
      "district": 2,
      "total_votes": 91267,
      "party_votes": {
        "ก้าวไกล": 15831,
        "ประชาชาติ": 1344,
        "ประชาธิปัตย์": 31617,
        "พลังประชารัฐ": 19718,
        "พลังปวงชนไทย": 225,
        "ภูมิใจไทย": 822,
        "รวมไทยสร้างชาติ": 17473,
        "สังคมประชาธิปไตยไทย": 212,
        "เพื่อไทย": 1810,
        "เสรีรวมไทย": 873,
        "ไทยภักดี": 753,
        "ไทยสร้างไทย": 589
      }
    },
    {
      "district": 3,
      "total_votes": 89740,
      "party_votes": {
        "ก้าวไกล": 9499,
        "ทางเลือกใหม่": 91,
        "ประชาธิปัตย์": 31827,
        "พลังประชารัฐ": 14164,
        "ภูมิใจไทย": 21277,
        "รวมไทยสร้างชาติ": 10670,
        "เพื่อไทย": 870,
        "เสรีรวมไทย": 410,
        "ไทยภักดี": 318,
        "ไทยสมาร์ท": 392,
        "ไทยสร้างไทย": 222
      }
    },
    {
      "district": 4,
      "total_votes": 85540,
      "party_votes": {
        "ก้าวไกล": 9331,
        "คลองไทย": 285,
        "ชาติพัฒนากล้า": 18196,
        "ประชาธิปัตย์": 22394,
        "พลังประชารัฐ": 11015,
        "ภูมิใจไทย": 4542,
        "รวมไทยสร้างชาติ": 15297,
        "เพื่อไทย": 2486,
        "เสรีรวมไทย": 483,
        "ไทยภักดี": 794,
        "ไทยสมาร์ท": 163,
        "ไทยสร้างไทย": 554
      }
    },
    {
      "district": 5,
      "total_votes": 89576,
      "party_votes": {
        "ก้าวไกล": 10369,
        "คลองไทย": 220,
        "ชาติพัฒนากล้า": 1347,
        "ประชาธิปัตย์": 48403,
        "พลังประชารัฐ": 2246,
        "ภูมิใจไทย": 619,
        "รวมไทยสร้างชาติ": 23827,
        "เพื่อไทย": 1011,
        "เสรีรวมไทย": 127,
        "ไทยภักดี": 681,
        "ไทยสมาร์ท": 249,
        "ไทยสร้างไทย": 477
      }
    },
    {
      "district": 6,
      "total_votes": 80408,
      "party_votes": {
        "ก้าวไกล": 10009,
        "คลองไทย": 197,
        "ชาติพัฒนากล้า": 1609,
        "ทางเลือกใหม่": 289,
        "ประชาธิปัตย์": 5349,
        "พลังประชารัฐ": 26285,
        "พลังปวงชนไทย": 174,
        "พลังสังคมใหม่": 91,
        "ภูมิใจไทย": 22314,
        "รวมไทยสร้างชาติ": 6988,
        "เพื่อไทย": 5376,
        "เสรีรวมไทย": 622,
        "ไทยภักดี": 596,
        "ไทยสร้างไทย": 509
      }
    },
    {
      "district": 7,
      "total_votes": 84747,
      "party_votes": {
        "ก้าวไกล": 20842,
        "คลองไทย": 191,
        "ทางเลือกใหม่": 220,
        "ประชาธิปัตย์": 8879,
        "พลังประชารัฐ": 984,
        "พลังปวงชนไทย": 403,
        "ภูมิใจไทย": 27943,
        "รวมไทยสร้างชาติ": 18877,
        "เพื่อไทย": 3625,
        "เสรีรวมไทย": 1632,
        "ไทยภักดี": 374,
        "ไทยสมาร์ท": 185,
        "ไทยสร้างไทย": 592
      }
    },
    {
      "district": 8,
      "total_votes": 82858,
      "party_votes": {
        "ก้าวไกล": 11587,
        "คลองไทย": 208,
        "ทางเลือกใหม่": 242,
        "ประชาธิปัตย์": 10529,
        "พลังประชารัฐ": 17448,
        "ภูมิใจไทย": 23393,
        "รวมไทยสร้างชาติ": 8731,
        "เพื่อไทย": 8771,
        "เสรีรวมไทย": 354,
        "ไทยภักดี": 729,
        "ไทยสมาร์ท": 230,
        "ไทยสร้างไทย": 636
      }
    },
    {
      "district": 9,
      "total_votes": 85254,
      "party_votes": {
        "ก้าวไกล": 11565,
        "คลองไทย": 106,
        "ชาติพัฒนากล้า": 530,
        "ประชาธิปัตย์": 35976,
        "พลังประชารัฐ": 1980,
        "ภูมิใจไทย": 26523,
        "รวมไทยสร้างชาติ": 6363,
        "เพื่อไทย": 1322,
        "เสรีรวมไทย": 391,
        "ไทยภักดี": 199,
        "ไทยสร้างไทย": 299
      }
    },
    {
      "district": 10,
      "total_votes": 90772,
      "party_votes": {
        "ก้าวไกล": 10513,
        "คลองไทย": 266,
        "ประชาธิปัตย์": 17883,
        "พลังประชารัฐ": 3596,
        "ภูมิใจไทย": 2662,
        "รวมไทยสร้างชาติ": 44233,
        "เพื่อชาติ": 1385,
        "เพื่อไทย": 7430,
        "เสรีรวมไทย": 916,
        "ไทยภักดี": 822,
        "ไทยสมาร์ท": 434,
        "ไทยสร้างไทย": 632
      }
    }
  ],
  "นครสวรรค์": [
    {
      "district": 1,
      "total_votes": 99045,
      "party_votes": {
        "ก้าวไกล": 31671,
        "ครูไทยเพื่อประชาชน": 161,
        "คลองไทย": 160,
        "ประชาธิปัตย์": 13289,
        "ประชาภิวัฒน์": 178,
        "พลังประชารัฐ": 762,
        "ภูมิใจไทย": 27035,
        "รวมไทยสร้างชาติ": 6697,
        "เพื่อไทย": 16896,
        "เสรีรวมไทย": 624,
        "ไทยสร้างไทย": 710,
        "ไทยเป็นหนึ่ง": 862
      }
    },
    {
      "district": 2,
      "total_votes": 99976,
      "party_votes": {
        "ก้าวไกล": 18029,
        "ประชาธิปัตย์": 609,
        "ประชาภิวัฒน์": 406,
        "พลังประชารัฐ": 13137,
        "ภูมิใจไทย": 24844,
        "รวมแผ่นดิน": 712,
        "รวมไทยสร้างชาติ": 3688,
        "เพื่อไทย": 37510,
        "เสรีรวมไทย": 580,
        "ไทยสร้างไทย": 461
      }
    },
    {
      "district": 3,
      "total_votes": 102038,
      "party_votes": {
        "ก้าวไกล": 20969,
        "คลองไทย": 337,
        "ประชาธิปัตย์": 545,
        "ประชาภิวัฒน์": 372,
        "พลังประชารัฐ": 21121,
        "ภูมิใจไทย": 437,
        "มิติใหม่": 590,
        "รวมไทยสร้างชาติ": 32100,
        "เพื่อไทย": 24317,
        "เสรีรวมไทย": 406,
        "ไทยสร้างไทย": 512,
        "ไทยเป็นหนึ่ง": 332
      }
    },
    {
      "district": 4,
      "total_votes": 97571,
      "party_votes": {
        "ก้าวไกล": 16051,
        "คลองไทย": 109,
        "ประชาธิปัตย์": 345,
        "พลังประชารัฐ": 20932,
        "ภูมิใจไทย": 32934,
        "รวมไทยสร้างชาติ": 1481,
        "เพื่อไทย": 25073,
        "เสรีรวมไทย": 250,
        "ไทยสร้างไทย": 260,
        "ไทยเป็นหนึ่ง": 136
      }
    },
    {
      "district": 5,
      "total_votes": 98476,
      "party_votes": {
        "ก้าวไกล": 17352,
        "คลองไทย": 152,
        "ท้องที่ไทย": 445,
        "ประชาธิปัตย์": 456,
        "ประชาภิวัฒน์": 351,
        "พลังประชารัฐ": 12577,
        "ภูมิใจไทย": 46438,
        "รวมไทยสร้างชาติ": 2911,
        "เปลี่ยนอนาคต": 136,
        "เพื่อไทย": 16873,
        "เสรีรวมไทย": 431,
        "ไทยสร้างไทย": 158,
        "ไทยเป็นหนึ่ง": 196
      }
    },
    {
      "district": 6,
      "total_votes": 91500,
      "party_votes": {
        "ก้าวไกล": 11408,
        "ครูไทยเพื่อประชาชน": 357,
        "คลองไทย": 380,
        "ชาติพัฒนากล้า": 24089,
        "ประชาธิปัตย์": 414,
        "พลังประชารัฐ": 315,
        "ภูมิใจไทย": 16847,
        "รวมไทยสร้างชาติ": 22428,
        "เพื่อไทย": 14663,
        "เสรีรวมไทย": 277,
        "ไทยสร้างไทย": 249,
        "ไทยเป็นหนึ่ง": 73
      }
    }
  ],
  "นนทบุรี": [
    {
      "district": 1,
      "total_votes": 100698,
      "party_votes": {
        "ก้าวไกล": 45615,
        "ประชาธิปัตย์": 1473,
        "พลังประชารัฐ": 842,
        "ภูมิใจไทย": 1037,
        "รวมไทยสร้างชาติ": 28166,
        "เพื่อไทย": 20640,
        "เสรีรวมไทย": 1018,
        "ไทยภักดี": 445,
        "ไทยสร้างไทย": 1462
      }
    },
    {
      "district": 2,
      "total_votes": 90006,
      "party_votes": {
        "ก้าวไกล": 39086,
        "คลองไทย": 103,
        "ทางเลือกใหม่": 72,
        "ประชาธิปัตย์": 1520,
        "พลังประชารัฐ": 666,
        "มิติใหม่": 333,
        "รวมไทยสร้างชาติ": 25079,
        "เพื่อไทย": 19423,
        "เสรีรวมไทย": 611,
        "ไทยภักดี": 640,
        "ไทยสร้างไทย": 2473
      }
    },
    {
      "district": 3,
      "total_votes": 100312,
      "party_votes": {
        "ก้าวไกล": 44369,
        "คลองไทย": 176,
        "ทางเลือกใหม่": 367,
        "ประชาธิปัตย์": 1636,
        "พลังประชารัฐ": 3361,
        "พลังสังคม": 88,
        "ภูมิใจไทย": 774,
        "รวมไทยสร้างชาติ": 25626,
        "เพื่อไทย": 17148,
        "เสรีรวมไทย": 1101,
        "ไทยภักดี": 332,
        "ไทยสร้างไทย": 5334
      }
    },
    {
      "district": 4,
      "total_votes": 91317,
      "party_votes": {
        "ก้าวไกล": 36249,
        "ทางเลือกใหม่": 281,
        "ประชาธิปัตย์": 1395,
        "พลังประชารัฐ": 611,
        "ภูมิใจไทย": 749,
        "รวมไทยสร้างชาติ": 25442,
        "เพื่อไทย": 24446,
        "เสรีรวมไทย": 579,
        "ไทยภักดี": 282,
        "ไทยศรีวิไลย์": 433,
        "ไทยสร้างไทย": 850
      }
    },
    {
      "district": 5,
      "total_votes": 94393,
      "party_votes": {
        "ก้าวไกล": 48055,
        "ประชาธิปัตย์": 3469,
        "พลังประชารัฐ": 4618,
        "ภูมิใจไทย": 2145,
        "รวมไทยสร้างชาติ": 14684,
        "เพื่อไทย": 19897,
        "เสรีรวมไทย": 856,
        "ไทยภักดี": 669
      }
    },
    {
      "district": 6,
      "total_votes": 100958,
      "party_votes": {
        "ก้าวไกล": 48169,
        "ทางเลือกใหม่": 176,
        "ประชาธิปัตย์": 1454,
        "พลังประชารัฐ": 1557,
        "ภูมิใจไทย": 590,
        "รวมไทยสร้างชาติ": 24252,
        "เพื่อไทย": 23508,
        "เสรีรวมไทย": 785,
        "ไทยภักดี": 467
      }
    },
    {
      "district": 7,
      "total_votes": 99944,
      "party_votes": {
        "ก้าวไกล": 41356,
        "ชาติพัฒนากล้า": 880,
        "ทางเลือกใหม่": 236,
        "ประชาธิปัตย์": 11299,
        "พลังประชารัฐ": 5567,
        "ภูมิใจไทย": 12854,
        "รวมไทยสร้างชาติ": 10679,
        "เพื่อไทย": 16098,
        "เสรีรวมไทย": 748,
        "ไทยภักดี": 227
      }
    },
    {
      "district": 8,
      "total_votes": 96221,
      "party_votes": {
        "ก้าวไกล": 41734,
        "ประชาธิปัตย์": 1868,
        "พลังประชารัฐ": 469,
        "ภูมิใจไทย": 14090,
        "รวมไทยสร้างชาติ": 11475,
        "เพื่อไทย": 24335,
        "เสรีรวมไทย": 918,
        "ไทยภักดี": 283,
        "ไทยสร้างไทย": 1049
      }
    }
  ],
  "นราธิวาส": [
    {
      "district": 1,
      "total_votes": 90225,
      "party_votes": {
        "ก้าวไกล": 8299,
        "ประชาชาติ": 17413,
        "ประชาธิปัตย์": 1134,
        "พลังประชารัฐ": 6371,
        "ภูมิใจไทย": 26370,
        "รวมไทยสร้างชาติ": 29006,
        "เพื่อไทย": 802,
        "เสรีรวมไทย": 176,
        "ไทยศรีวิไลย์": 90,
        "ไทยสร้างไทย": 564
      }
    },
    {
      "district": 2,
      "total_votes": 74188,
      "party_votes": {
        "คลองไทย": 77,
        "ประชาชาติ": 11835,
        "ประชาธิปัตย์": 17447,
        "พลังประชารัฐ": 31289,
        "ภูมิใจไทย": 188,
        "รวมไทยสร้างชาติ": 10645,
        "เพื่อไทย": 2355,
        "เสรีรวมไทย": 352
      }
    },
    {
      "district": 3,
      "total_votes": 72022,
      "party_votes": {
        "ประชาชาติ": 29951,
        "ประชาธิปัตย์": 912,
        "พลังประชารัฐ": 34411,
        "ภูมิใจไทย": 745,
        "รวมไทยสร้างชาติ": 4075,
        "เป็นธรรม": 613,
        "เพื่อไทย": 1001,
        "เสรีรวมไทย": 214,
        "ไทยศรีวิไลย์": 100
      }
    },
    {
      "district": 4,
      "total_votes": 78257,
      "party_votes": {
        "ก้าวไกล": 3622,
        "ประชาชาติ": 27166,
        "ประชาธิปัตย์": 1343,
        "พลังประชารัฐ": 13288,
        "พลังสังคมใหม่": 114,
        "ภูมิใจไทย": 30966,
        "รวมไทยสร้างชาติ": 591,
        "เพื่อไทย": 517,
        "เสรีรวมไทย": 85,
        "ไทยสร้างไทย": 565
      }
    },
    {
      "district": 5,
      "total_votes": 88486,
      "party_votes": {
        "ก้าวไกล": 3312,
        "คลองไทย": 88,
        "ประชาชาติ": 31457,
        "ประชาธิปัตย์": 765,
        "พลังประชารัฐ": 16595,
        "ภูมิใจไทย": 21909,
        "รวมไทยสร้างชาติ": 12455,
        "เพื่อไทย": 1412,
        "เสรีรวมไทย": 125,
        "ไทยสร้างไทย": 368
      }
    }
  ],
  "น่าน": [
    {
      "district": 1,
      "total_votes": 102815,
      "party_votes": {
        "ก้าวไกล": 34088,
        "คลองไทย": 1363,
        "ประชาธิปัตย์": 1497,
        "พลังประชารัฐ": 22043,
        "ภูมิใจไทย": 825,
        "รวมไทยสร้างชาติ": 5586,
        "เพื่อไทย": 35314,
        "เสรีรวมไทย": 531,
        "ไทยศรีวิไลย์": 160,
        "ไทยสร้างไทย": 1408
      }
    },
    {
      "district": 2,
      "total_votes": 95483,
      "party_votes": {
        "ก้าวไกล": 22834,
        "คลองไทย": 206,
        "ประชาธิปัตย์": 1184,
        "พลังประชารัฐ": 3147,
        "ภูมิใจไทย": 813,
        "รวมไทยสร้างชาติ": 9806,
        "เพื่อไทย": 56746,
        "เสรีรวมไทย": 387,
        "ไทยศรีวิไลย์": 360
      }
    },
    {
      "district": 3,
      "total_votes": 84675,
      "party_votes": {
        "ก้าวไกล": 26621,
        "ประชาธิปัตย์": 880,
        "พลังประชารัฐ": 22896,
        "ภูมิใจไทย": 750,
        "รวมไทยสร้างชาติ": 2192,
        "เพื่อไทย": 29379,
        "เสรีรวมไทย": 438,
        "ไทยศรีวิไลย์": 570,
        "ไทยสร้างไทย": 949
      }
    }
  ],
  "บึงกาฬ": [
    {
      "district": 1,
      "total_votes": 72241,
      "party_votes": {
        "ก้าวไกล": 17325,
        "คลองไทย": 74,
        "ประชาธิปัตย์": 291,
        "พลังประชารัฐ": 746,
        "ภูมิใจไทย": 25295,
        "รวมไทยสร้างชาติ": 666,
        "เพื่อไทย": 25007,
        "เสรีรวมไทย": 391,
        "ไทยภักดี": 207,
        "ไทยสร้างไทย": 2239
      }
    },
    {
      "district": 2,
      "total_votes": 73052,
      "party_votes": {
        "ก้าวไกล": 16568,
        "คลองไทย": 128,
        "ประชาธิปัตย์": 130,
        "พลังประชารัฐ": 6350,
        "ภูมิใจไทย": 26541,
        "รวมแผ่นดิน": 438,
        "รวมไทยสร้างชาติ": 773,
        "เพื่อไทย": 18713,
        "เสรีรวมไทย": 772,
        "แรงงานสร้างชาติ": 353,
        "ไทยภักดี": 218,
        "ไทยสร้างไทย": 2068
      }
    },
    {
      "district": 3,
      "total_votes": 75394,
      "party_votes": {
        "ก้าวไกล": 21524,
        "ประชาธิปัตย์": 377,
        "พลังประชารัฐ": 160,
        "ภูมิใจไทย": 19239,
        "รวมไทยสร้างชาติ": 1219,
        "ราษฎร์วิถี": 137,
        "เพื่อไทย": 30277,
        "เสรีรวมไทย": 638,
        "ไทยภักดี": 378,
        "ไทยสร้างไทย": 1445
      }
    }
  ],
  "บุรีรัมย์": [
    {
      "district": 1,
      "total_votes": 83708,
      "party_votes": {
        "ก้าวไกล": 28305,
        "ประชาธิปัตย์": 652,
        "พลังประชารัฐ": 3298,
        "ภูมิใจไทย": 36739,
        "รวมแผ่นดิน": 103,
        "รวมไทยสร้างชาติ": 1847,
        "เพื่อไทย": 11039,
        "เสรีรวมไทย": 677,
        "แนวทางใหม่": 427,
        "ไทยภักดี": 152,
        "ไทยสร้างไทย": 469
      }
    },
    {
      "district": 2,
      "total_votes": 82284,
      "party_votes": {
        "ก้าวไกล": 16740,
        "ประชาธิปัตย์": 420,
        "พลังประชารัฐ": 3955,
        "พลังสังคมใหม่": 212,
        "ภูมิใจไทย": 46729,
        "รวมแผ่นดิน": 918,
        "รวมไทยสร้างชาติ": 1324,
        "เพื่อไทย": 10813,
        "เสรีรวมไทย": 620,
        "ไทยภักดี": 113,
        "ไทยสร้างไทย": 440
      }
    },
    {
      "district": 3,
      "total_votes": 78061,
      "party_votes": {
        "ก้าวไกล": 20017,
        "ประชาธิปัตย์": 276,
        "ประชาไทย": 291,
        "พลังประชารัฐ": 797,
        "พลังปวงชนไทย": 164,
        "พลังสังคมใหม่": 248,
        "ภูมิใจไทย": 38468,
        "รวมไทยสร้างชาติ": 1410,
        "เพื่อไทย": 15313,
        "เสรีรวมไทย": 473,
        "ไทยภักดี": 67,
        "ไทยสร้างไทย": 537
      }
    },
    {
      "district": 4,
      "total_votes": 77059,
      "party_votes": {
        "ก้าวไกล": 11965,
        "ประชาธิปัตย์": 427,
        "พลังประชารัฐ": 1210,
        "พลังปวงชนไทย": 86,
        "ภูมิใจไทย": 37706,
        "รวมไทยสร้างชาติ": 1007,
        "เพื่อไทย": 24054,
        "เสรีรวมไทย": 310,
        "ไทยภักดี": 78,
        "ไทยสร้างไทย": 216
      }
    },
    {
      "district": 5,
      "total_votes": 84322,
      "party_votes": {
        "ก้าวไกล": 14179,
        "คลองไทย": 61,
        "ประชาธิปัตย์": 1731,
        "พลังประชารัฐ": 832,
        "ภูมิใจไทย": 47746,
        "รวมไทยสร้างชาติ": 1209,
        "เพื่อไทย": 17144,
        "เสรีรวมไทย": 169,
        "ไทยภักดี": 274,
        "ไทยสร้างไทย": 977
      }
    },
    {
      "district": 6,
      "total_votes": 81612,
      "party_votes": {
        "ก้าวไกล": 17371,
        "ประชาธิปัตย์": 866,
        "พลังประชารัฐ": 2647,
        "ภูมิใจไทย": 35362,
        "รวมไทยสร้างชาติ": 2490,
        "เพื่อชาติไทย": 122,
        "เพื่อไทย": 20184,
        "เสรีรวมไทย": 500,
        "แนวทางใหม่": 384,
        "ไทยธรรม": 532,
        "ไทยภักดี": 175,
        "ไทยสร้างไทย": 979
      }
    },
    {
      "district": 7,
      "total_votes": 81882,
      "party_votes": {
        "ก้าวไกล": 18535,
        "คลองไทย": 178,
        "ประชาธิปัตย์": 831,
        "พลังประชารัฐ": 762,
        "ภูมิใจไทย": 28685,
        "รวมไทยสร้างชาติ": 1138,
        "เพื่อชาติ": 177,
        "เพื่อไทย": 28470,
        "เสรีรวมไทย": 630,
        "แนวทางใหม่": 1164,
        "แผ่นดินธรรม": 338,
        "ไทยภักดี": 250,
        "ไทยสร้างไทย": 724
      }
    },
    {
      "district": 8,
      "total_votes": 86139,
      "party_votes": {
        "ก้าวไกล": 23148,
        "ประชาธิปัตย์": 643,
        "พลังประชารัฐ": 8327,
        "ภูมิใจไทย": 34429,
        "รวมไทยสร้างชาติ": 1197,
        "เพื่อชาติไทย": 282,
        "เพื่ออนาคตไทย": 435,
        "เพื่อไทย": 16660,
        "เสรีรวมไทย": 390,
        "ไทยภักดี": 162,
        "ไทยสร้างไทย": 466
      }
    },
    {
      "district": 9,
      "total_votes": 83019,
      "party_votes": {
        "ก้าวไกล": 9682,
        "ประชาธิปัตย์": 406,
        "พลังประชารัฐ": 591,
        "พลังปวงชนไทย": 93,
        "ภูมิใจไทย": 45059,
        "รวมแผ่นดิน": 817,
        "รวมไทยสร้างชาติ": 839,
        "เพื่อไทย": 24682,
        "เสรีรวมไทย": 388,
        "ไทยภักดี": 92,
        "ไทยสร้างไทย": 370
      }
    },
    {
      "district": 10,
      "total_votes": 76999,
      "party_votes": {
        "ก้าวไกล": 16230,
        "ประชาธิปัตย์": 882,
        "พลังประชารัฐ": 450,
        "ภูมิใจไทย": 39006,
        "รวมไทยสร้างชาติ": 3094,
        "เพื่อชาติไทย": 172,
        "เพื่อไทย": 15879,
        "เสรีรวมไทย": 329,
        "ไทยภักดี": 307,
        "ไทยสร้างไทย": 650
      }
    }
  ],
  "ปทุมธานี": [
    {
      "district": 1,
      "total_votes": 103463,
      "party_votes": {
        "ก้าวไกล": 29272,
        "ประชาธิปัตย์": 751,
        "พลังประชารัฐ": 17361,
        "ภูมิใจไทย": 22297,
        "รวมไทยสร้างชาติ": 4343,
        "เพื่อไทย": 27439,
        "เสรีรวมไทย": 948,
        "ไทยภักดี": 360,
        "ไทยสร้างไทย": 692
      }
    },
    {
      "district": 2,
      "total_votes": 102344,
      "party_votes": {
        "ก้าวไกล": 40215,
        "ประชาธิปัตย์": 1558,
        "พลังประชารัฐ": 11187,
        "ภูมิใจไทย": 1233,
        "รวมไทยสร้างชาติ": 9178,
        "ราษฎร์วิถี": 338,
        "เพื่อไทย": 37011,
        "เสรีรวมไทย": 1034,
        "ไทยภักดี": 590
      }
    },
    {
      "district": 3,
      "total_votes": 95288,
      "party_votes": {
        "ก้าวไกล": 43096,
        "ประชาธิปัตย์": 1082,
        "พลังประชารัฐ": 2332,
        "พลังปวงชนไทย": 96,
        "ภูมิใจไทย": 15570,
        "รวมไทยสร้างชาติ": 5410,
        "เพื่อไทย": 25619,
        "เสรีรวมไทย": 692,
        "ไทยภักดี": 545,
        "ไทยสร้างไทย": 846
      }
    },
    {
      "district": 4,
      "total_votes": 100871,
      "party_votes": {
        "ก้าวไกล": 41705,
        "ประชาธิปัตย์": 1296,
        "พลังประชารัฐ": 1620,
        "พลังปวงชนไทย": 119,
        "ภูมิใจไทย": 21716,
        "รวมแผ่นดิน": 548,
        "รวมไทยสร้างชาติ": 7895,
        "เพื่อไทย": 24519,
        "เสรีรวมไทย": 664,
        "ไทยภักดี": 225,
        "ไทยสร้างไทย": 564
      }
    },
    {
      "district": 5,
      "total_votes": 110323,
      "party_votes": {
        "ก้าวไกล": 32541,
        "ประชาธิปัตย์": 859,
        "ประชาธิปไตยใหม่": 250,
        "พลังประชารัฐ": 989,
        "ภูมิใจไทย": 33885,
        "รวมไทยสร้างชาติ": 5390,
        "เพื่อไทย": 35078,
        "เสรีรวมไทย": 969,
        "ไทยภักดี": 362
      }
    },
    {
      "district": 6,
      "total_votes": 107771,
      "party_votes": {
        "ก้าวไกล": 48900,
        "ชาติไทยพัฒนา": 1639,
        "ประชาธิปัตย์": 1021,
        "ประชาธิปไตยใหม่": 198,
        "พลังประชารัฐ": 16651,
        "ภูมิใจไทย": 1455,
        "รวมไทยสร้างชาติ": 12846,
        "เพื่อชาติ": 160,
        "เพื่อไทย": 22363,
        "เสรีรวมไทย": 1583,
        "ไทยภักดี": 150,
        "ไทยสร้างไทย": 805
      }
    },
    {
      "district": 7,
      "total_votes": 107343,
      "party_votes": {
        "ก้าวไกล": 36227,
        "ประชาธิปัตย์": 650,
        "ประชาธิปไตยใหม่": 617,
        "พลังประชารัฐ": 1005,
        "พลังปวงชนไทย": 83,
        "ภูมิใจไทย": 30272,
        "รวมไทยสร้างชาติ": 7111,
        "เพื่อไทย": 29997,
        "เสรีรวมไทย": 600,
        "ไทยภักดี": 292,
        "ไทยสร้างไทย": 489
      }
    }
  ],
  "ประจวบคีรีขันธ์": [
    {
      "district": 1,
      "total_votes": 107884,
      "party_votes": {
        "ก้าวไกล": 18047,
        "คลองไทย": 236,
        "ประชาธิปัตย์": 34486,
        "พลังประชารัฐ": 6040,
        "ภูมิใจไทย": 36719,
        "รวมไทยสร้างชาติ": 3338,
        "เพื่อไทย": 7982,
        "เสรีรวมไทย": 335,
        "แนวทางใหม่": 143,
        "ไทยภักดี": 113,
        "ไทยศรีวิไลย์": 109,
        "ไทยสร้างไทย": 336
      }
    },
    {
      "district": 2,
      "total_votes": 104193,
      "party_votes": {
        "ก้าวไกล": 20797,
        "คลองไทย": 110,
        "ประชาธิปัตย์": 42736,
        "พลังประชารัฐ": 7894,
        "ภูมิใจไทย": 217,
        "รวมไทยสร้างชาติ": 4726,
        "เพื่อไทย": 26197,
        "เสรีรวมไทย": 721,
        "แนวทางใหม่": 177,
        "ไทยสร้างไทย": 618
      }
    },
    {
      "district": 3,
      "total_votes": 97116,
      "party_votes": {
        "ก้าวไกล": 17491,
        "คลองไทย": 251,
        "ประชาธิปัตย์": 23215,
        "พลังประชารัฐ": 17601,
        "ภูมิใจไทย": 14119,
        "รวมไทยสร้างชาติ": 18214,
        "เพื่อไทย": 4769,
        "เสรีรวมไทย": 624,
        "ไทยภักดี": 832
      }
    }
  ],
  "ปราจีนบุรี": [
    {
      "district": 1,
      "total_votes": 95465,
      "party_votes": {
        "ก้าวไกล": 31197,
        "ประชาธิปัตย์": 636,
        "พลังประชารัฐ": 8167,
        "ภูมิใจไทย": 35641,
        "รวมไทยสร้างชาติ": 4296,
        "เพื่อไทย": 13455,
        "เสรีรวมไทย": 676,
        "ไทยภักดี": 486,
        "ไทยสร้างไทย": 911
      }
    },
    {
      "district": 2,
      "total_votes": 104308,
      "party_votes": {
        "ก้าวไกล": 35451,
        "ประชาธิปัตย์": 1662,
        "พลังประชารัฐ": 867,
        "ภูมิใจไทย": 31194,
        "รวมไทยสร้างชาติ": 4004,
        "เพื่อไทย": 29332,
        "เสรีรวมไทย": 664,
        "ไทยภักดี": 343,
        "ไทยสร้างไทย": 791
      }
    },
    {
      "district": 3,
      "total_votes": 94966,
      "party_votes": {
        "ก้าวไกล": 27327,
        "ประชาธิปัตย์": 766,
        "ประชาไทย": 105,
        "พลังประชารัฐ": 389,
        "ภูมิใจไทย": 30833,
        "รวมไทยสร้างชาติ": 15609,
        "เพื่อไทย": 18490,
        "เสรีรวมไทย": 552,
        "แนวทางใหม่": 201,
        "ไทยภักดี": 355,
        "ไทยสร้างไทย": 339
      }
    }
  ],
  "ปัตตานี": [
    {
      "district": 1,
      "total_votes": 70318,
      "party_votes": {
        "ก้าวไกล": 10132,
        "ประชาชาติ": 14452,
        "ประชาธิปัตย์": 12328,
        "พลังประชารัฐ": 12363,
        "พลังสังคมใหม่": 93,
        "ภูมิใจไทย": 12770,
        "รวมไทยสร้างชาติ": 3370,
        "เปลี่ยน": 122,
        "เป็นธรรม": 719,
        "เพื่อชาติ": 70,
        "เพื่อไทย": 1333,
        "เสรีรวมไทย": 285,
        "ไทยภักดี": 1960,
        "ไทยศรีวิไลย์": 72,
        "ไทยสร้างไทย": 249
      }
    },
    {
      "district": 2,
      "total_votes": 79936,
      "party_votes": {
        "ก้าวไกล": 5979,
        "คลองไทย": 117,
        "ประชาชาติ": 13268,
        "ประชาธิปัตย์": 6679,
        "ประชาธิปไตยใหม่": 2134,
        "พลังประชารัฐ": 23483,
        "พลังสังคมใหม่": 67,
        "ภูมิใจไทย": 14833,
        "รวมไทยสร้างชาติ": 11122,
        "เปลี่ยน": 252,
        "เป็นธรรม": 472,
        "เพื่อชาติ": 121,
        "เพื่อไทย": 728,
        "เสรีรวมไทย": 197,
        "ไทยศรีวิไลย์": 135,
        "ไทยสร้างไทย": 349
      }
    },
    {
      "district": 3,
      "total_votes": 67707,
      "party_votes": {
        "ก้าวไกล": 4546,
        "ประชาชาติ": 23636,
        "ประชาธิปัตย์": 12478,
        "พลังประชารัฐ": 20294,
        "ภูมิใจไทย": 794,
        "รวมไทยสร้างชาติ": 812,
        "เป็นธรรม": 750,
        "เพื่อชาติ": 79,
        "เพื่อไทย": 551,
        "เสรีรวมไทย": 124,
        "ไทยภักดี": 229,
        "ไทยศรีวิไลย์": 2811,
        "ไทยสร้างไทย": 603
      }
    },
    {
      "district": 4,
      "total_votes": 80181,
      "party_votes": {
        "ก้าวไกล": 4558,
        "คลองไทย": 66,
        "ประชาชาติ": 13895,
        "ประชาธิปัตย์": 21556,
        "ประชาธิปไตยใหม่": 2764,
        "พลังประชารัฐ": 1595,
        "พลังสังคมใหม่": 170,
        "ภูมิใจไทย": 14095,
        "รวมไทยสร้างชาติ": 19360,
        "เปลี่ยน": 166,
        "เป็นธรรม": 838,
        "เพื่อชาติ": 148,
        "เพื่อไทย": 641,
        "เสรีรวมไทย": 119,
        "ไทยภักดี": 84,
        "ไทยสร้างไทย": 126
      }
    },
    {
      "district": 5,
      "total_votes": 74495,
      "party_votes": {
        "ก้าวไกล": 4539,
        "คลองไทย": 3239,
        "ประชาชาติ": 37068,
        "ประชาธิปัตย์": 365,
        "ประชาธิปไตยใหม่": 97,
        "พลังประชารัฐ": 26544,
        "ภูมิใจไทย": 939,
        "รวมไทยสร้างชาติ": 681,
        "เพื่อไทย": 771,
        "เสรีรวมไทย": 117,
        "ไทยภักดี": 135
      }
    }
  ],
  "พระนครศรีอยุธยา": [
    {
      "district": 1,
      "total_votes": 102821,
      "party_votes": {
        "ก้าวไกล": 41081,
        "ประชาธิปัตย์": 1014,
        "พลังประชารัฐ": 1250,
        "ภูมิใจไทย": 35676,
        "รวมไทยสร้างชาติ": 6677,
        "เพื่อชาติไทย": 98,
        "เพื่อไทย": 15289,
        "เสรีรวมไทย": 751,
        "ไทยภักดี": 364,
        "ไทยสร้างไทย": 621
      }
    },
    {
      "district": 2,
      "total_votes": 100226,
      "party_votes": {
        "ก้าวไกล": 27467,
        "ประชาธิปัตย์": 793,
        "พลังประชารัฐ": 24683,
        "ภูมิใจไทย": 26804,
        "รวมแผ่นดิน": 532,
        "รวมไทยสร้างชาติ": 4370,
        "เพื่อไทย": 14855,
        "เสรีรวมไทย": 276,
        "ไทยภักดี": 446
      }
    },
    {
      "district": 3,
      "total_votes": 102673,
      "party_votes": {
        "ก้าวไกล": 34584,
        "ประชาธิปัตย์": 433,
        "พลังประชารัฐ": 2120,
        "ภูมิใจไทย": 47117,
        "รวมพลัง": 911,
        "รวมไทยสร้างชาติ": 3374,
        "เพื่อไทย": 13061,
        "เสรีรวมไทย": 646,
        "ไทยภักดี": 137,
        "ไทยสร้างไทย": 290
      }
    },
    {
      "district": 4,
      "total_votes": 109107,
      "party_votes": {
        "ก้าวไกล": 31073,
        "ประชาธิปัตย์": 355,
        "พลังประชารัฐ": 414,
        "ภูมิใจไทย": 50080,
        "รวมไทยสร้างชาติ": 2939,
        "เพื่อชาติไทย": 261,
        "เพื่อไทย": 23229,
        "เสรีรวมไทย": 418,
        "ไทยภักดี": 338
      }
    },
    {
      "district": 5,
      "total_votes": 101511,
      "party_votes": {
        "ก้าวไกล": 22100,
        "ชาติไทยพัฒนา": 601,
        "ประชาธิปัตย์": 836,
        "พลังประชารัฐ": 209,
        "ภูมิใจไทย": 37275,
        "รวมไทยสร้างชาติ": 8786,
        "เพื่อชาติไทย": 219,
        "เพื่อไทย": 30120,
        "เสรีรวมไทย": 273,
        "ไทยภักดี": 377,
        "ไทยศรีวิไลย์": 374,
        "ไทยสร้างไทย": 341
      }
    }
  ],
  "พะเยา": [
    {
      "district": 1,
      "total_votes": 94159,
      "party_votes": {
        "ก้าวไกล": 27862,
        "ประชาธิปัตย์": 718,
        "พลังประชารัฐ": 53963,
        "ภูมิใจไทย": 458,
        "รวมไทยสร้างชาติ": 1881,
        "เพื่อไทย": 8804,
        "เสรีรวมไทย": 473
      }
    },
    {
      "district": 2,
      "total_votes": 91494,
      "party_votes": {
        "ก้าวไกล": 25904,
        "ประชาธิปัตย์": 574,
        "พลังประชารัฐ": 32779,
        "พลังปวงชนไทย": 136,
        "ภูมิใจไทย": 447,
        "รวมไทยสร้างชาติ": 1249,
        "เพื่อไทย": 30405
      }
    },
    {
      "district": 3,
      "total_votes": 95643,
      "party_votes": {
        "ก้าวไกล": 16921,
        "ประชาธิปัตย์": 429,
        "พลังประชารัฐ": 34720,
        "พลังปวงชนไทย": 390,
        "ภูมิใจไทย": 441,
        "รวมไทยสร้างชาติ": 17982,
        "เพื่อไทย": 23624,
        "เสรีรวมไทย": 470,
        "ไทยสร้างไทย": 666
      }
    }
  ],
  "พังงา": [
    {
      "district": 1,
      "total_votes": 72616,
      "party_votes": {
        "ก้าวไกล": 10284,
        "คลองไทย": 135,
        "ประชาธิปัตย์": 15850,
        "พลังประชารัฐ": 1137,
        "ภูมิใจไทย": 34457,
        "รวมไทยสร้างชาติ": 6194,
        "เพื่อชาติ": 507,
        "เพื่อไทย": 2594,
        "เสมอภาค": 428,
        "เสรีรวมไทย": 482,
        "ไทยสร้างไทย": 548
      }
    },
    {
      "district": 2,
      "total_votes": 75493,
      "party_votes": {
        "ประชาธิปัตย์": 7466,
        "พลังประชารัฐ": 21506,
        "ภูมิใจไทย": 14065,
        "มิติใหม่": 543,
        "รวมไทยสร้างชาติ": 7598,
        "เพื่อไทย": 21397,
        "เสมอภาค": 426,
        "เสรีรวมไทย": 950,
        "ไทยสร้างไทย": 1542
      }
    }
  ],
  "พัทลุง": [
    {
      "district": 1,
      "total_votes": 108573,
      "party_votes": {
        "ก้าวไกล": 9539,
        "คลองไทย": 247,
        "ประชาธิปัตย์": 49471,
        "พลังประชารัฐ": 6917,
        "พลังปวงชนไทย": 158,
        "ภูมิใจไทย": 38132,
        "รวมไทยสร้างชาติ": 2658,
        "เพื่อไทย": 823,
        "ไทยศรีวิไลย์": 434,
        "ไทยสร้างไทย": 194
      }
    },
    {
      "district": 2,
      "total_votes": 116434,
      "party_votes": {
        "ก้าวไกล": 10342,
        "ชาติพัฒนากล้า": 2453,
        "ประชาธิปัตย์": 10442,
        "พลังประชารัฐ": 9196,
        "ภูมิใจไทย": 39581,
        "รวมไทยสร้างชาติ": 41201,
        "เพื่อไทย": 1993,
        "เสรีรวมไทย": 292,
        "ไทยภักดี": 231,
        "ไทยสร้างไทย": 703
      }
    },
    {
      "district": 3,
      "total_votes": 106699,
      "party_votes": {
        "ก้าวไกล": 13742,
        "ประชาธิปัตย์": 47848,
        "พลังประชารัฐ": 3233,
        "ภูมิใจไทย": 31165,
        "รวมไทยสร้างชาติ": 5691,
        "เพื่อไทย": 2695,
        "เสรีรวมไทย": 497,
        "ไทยศรีวิไลย์": 500,
        "ไทยสร้างไทย": 1328
      }
    }
  ],
  "พิจิตร": [
    {
      "district": 1,
      "total_votes": 102297,
      "party_votes": {
        "ก้าวไกล": 18133,
        "คลองไทย": 83,
        "ประชาธิปัตย์": 1412,
        "พลังประชารัฐ": 12282,
        "ภูมิใจไทย": 43965,
        "รวมไทยสร้างชาติ": 3517,
        "เพื่อไทย": 21985,
        "เสรีรวมไทย": 204,
        "ไทยภักดี": 262,
        "ไทยสร้างไทย": 454
      }
    },
    {
      "district": 2,
      "total_votes": 93805,
      "party_votes": {
        "ก้าวไกล": 14756,
        "ประชาธิปัตย์": 14682,
        "พลังประชารัฐ": 5429,
        "ภูมิใจไทย": 33390,
        "รวมไทยสร้างชาติ": 3955,
        "เพื่อไทย": 20646,
        "เสรีรวมไทย": 407,
        "ไทยภักดี": 540
      }
    },
    {
      "district": 3,
      "total_votes": 99520,
      "party_votes": {
        "ก้าวไกล": 14358,
        "คลองไทย": 308,
        "ประชาธิปัตย์": 482,
        "พลังประชารัฐ": 10075,
        "ภูมิใจไทย": 33996,
        "รวมไทยสร้างชาติ": 24821,
        "เพื่อไทย": 14603,
        "เสรีรวมไทย": 611,
        "ไทยภักดี": 266
      }
    }
  ],
  "พิษณุโลก": [
    {
      "district": 1,
      "total_votes": 98763,
      "party_votes": {
        "ก้าวไกล": 40842,
        "คลองไทย": 147,
        "ประชาธิปัตย์": 3979,
        "พลังประชารัฐ": 19096,
        "พลังปวงชนไทย": 67,
        "พลังสังคม": 154,
        "ภูมิใจไทย": 2478,
        "รวมพลัง": 209,
        "รวมไทยสร้างชาติ": 10229,
        "เพื่อไทย": 18180,
        "เสรีรวมไทย": 1450,
        "ไทยภักดี": 588,
        "ไทยศรีวิไลย์": 451,
        "ไทยสมาร์ท": 89,
        "ไทยสร้างไทย": 804
      }
    },
    {
      "district": 2,
      "total_votes": 106057,
      "party_votes": {
        "ก้าวไกล": 23516,
        "คลองไทย": 300,
        "ประชาธิปัตย์": 977,
        "พลังประชารัฐ": 17777,
        "ภูมิใจไทย": 17843,
        "รวมไทยสร้างชาติ": 12765,
        "เพื่อไทย": 30819,
        "เสรีรวมไทย": 442,
        "ไทยภักดี": 722,
        "ไทยศรีวิไลย์": 275,
        "ไทยสร้างไทย": 621
      }
    },
    {
      "district": 3,
      "total_votes": 93539,
      "party_votes": {
        "ก้าวไกล": 18331,
        "ประชาธิปัตย์": 938,
        "พลังประชารัฐ": 9200,
        "ภูมิใจไทย": 18460,
        "รวมไทยสร้างชาติ": 22765,
        "เพื่อไทย": 21969,
        "เสรีรวมไทย": 638,
        "แนวทางใหม่": 173,
        "ไทยภักดี": 463,
        "ไทยศรีวิไลย์": 117,
        "ไทยสร้างไทย": 485
      }
    },
    {
      "district": 4,
      "total_votes": 92136,
      "party_votes": {
        "ก้าวไกล": 14556,
        "คลองไทย": 63,
        "ประชาธิปัตย์": 543,
        "พลังประชารัฐ": 438,
        "พลังปวงชนไทย": 108,
        "ภูมิใจไทย": 32818,
        "รวมไทยสร้างชาติ": 2076,
        "เพื่อไทย": 40236,
        "เสรีรวมไทย": 266,
        "ไทยภักดี": 523,
        "ไทยศรีวิไลย์": 151,
        "ไทยสร้างไทย": 358
      }
    },
    {
      "district": 5,
      "total_votes": 92371,
      "party_votes": {
        "ก้าวไกล": 25792,
        "คลองไทย": 397,
        "ประชาธิปัตย์": 383,
        "พลังประชารัฐ": 16843,
        "พลังปวงชนไทย": 618,
        "พลังสังคมใหม่": 377,
        "ภูมิใจไทย": 11871,
        "รวมไทยสร้างชาติ": 14908,
        "อนาคตไทย": 506,
        "เพื่อไทย": 12409,
        "เสรีรวมไทย": 235,
        "แนวทางใหม่": 111,
        "ไทยภักดี": 228,
        "ไทยสร้างไทย": 7693
      }
    }
  ],
  "ภูเก็ต": [
    {
      "district": 1,
      "total_votes": 70733,
      "party_votes": {
        "ก้าวไกล": 21252,
        "คลองไทย": 179,
        "ประชาธิปัตย์": 8802,
        "พลังประชารัฐ": 10639,
        "ภูมิใจไทย": 7790,
        "รวมไทยสร้างชาติ": 16483,
        "เปลี่ยน": 323,
        "เพื่อไทย": 3802,
        "เสรีรวมไทย": 686,
        "ไทยภักดี": 471,
        "ไทยสร้างไทย": 306
      }
    },
    {
      "district": 2,
      "total_votes": 70176,
      "party_votes": {
        "ก้าวไกล": 21913,
        "ชาติพัฒนากล้า": 7540,
        "ประชาธิปัตย์": 8686,
        "พลังประชารัฐ": 662,
        "ภูมิใจไทย": 9596,
        "รวมไทยสร้างชาติ": 14967,
        "เพื่อชาติไทย": 168,
        "เพื่อไทย": 5976,
        "เสรีรวมไทย": 323,
        "ไทยสร้างไทย": 345
      }
    },
    {
      "district": 3,
      "total_votes": 78282,
      "party_votes": {
        "ก้าวไกล": 20421,
        "คลองไทย": 410,
        "ชาติพัฒนากล้า": 16469,
        "ประชาธิปัตย์": 8995,
        "พลังประชารัฐ": 3480,
        "ภูมิใจไทย": 13692,
        "รวมไทยสร้างชาติ": 9650,
        "เพื่อไทย": 3459,
        "เสรีรวมไทย": 410,
        "ไทยภักดี": 210,
        "ไทยสร้างไทย": 1086
      }
    }
  ],
  "มหาสารคาม": [
    {
      "district": 1,
      "total_votes": 91972,
      "party_votes": {
        "ก้าวไกล": 26224,
        "คลองไทย": 114,
        "ชาติพัฒนากล้า": 418,
        "ชาติไทยพัฒนา": 474,
        "ทางเลือกใหม่": 51,
        "ประชาธิปัตย์": 1130,
        "พลังประชารัฐ": 20479,
        "ภูมิใจไทย": 2449,
        "รวมไทยสร้างชาติ": 3256,
        "เพื่อชาติไทย": 210,
        "เพื่อไทย": 30859,
        "เสรีรวมไทย": 624,
        "ไทยพร้อม": 376,
        "ไทยภักดี": 389,
        "ไทยศรีวิไลย์": 241,
        "ไทยสร้างไทย": 4678
      }
    },
    {
      "district": 2,
      "total_votes": 85707,
      "party_votes": {
        "ก้าวไกล": 17631,
        "คลองไทย": 324,
        "ชาติไทยพัฒนา": 70,
        "ทางเลือกใหม่": 90,
        "ประชาธิปัตย์": 208,
        "พลังประชารัฐ": 29338,
        "พลังสังคมใหม่": 91,
        "ภูมิใจไทย": 606,
        "รวมไทยสร้างชาติ": 1116,
        "เพื่อชาติ": 366,
        "เพื่อชาติไทย": 278,
        "เพื่อไทย": 34062,
        "เสรีรวมไทย": 567,
        "ไทยชนะ": 225,
        "ไทยภักดี": 527,
        "ไทยสร้างไทย": 208
      }
    },
    {
      "district": 3,
      "total_votes": 88325,
      "party_votes": {
        "ก้าวไกล": 7606,
        "คลองไทย": 207,
        "ชาติพัฒนากล้า": 147,
        "ชาติไทยพัฒนา": 41,
        "ทางเลือกใหม่": 88,
        "ประชาธิปัตย์": 46,
        "พลังประชารัฐ": 851,
        "พลังสังคมใหม่": 105,
        "ภูมิใจไทย": 44122,
        "รวมไทยสร้างชาติ": 661,
        "เพื่อชาติไทย": 146,
        "เพื่อไทย": 33746,
        "เสรีรวมไทย": 117,
        "ไทยภักดี": 268,
        "ไทยสร้างไทย": 174
      }
    },
    {
      "district": 4,
      "total_votes": 85701,
      "party_votes": {
        "ก้าวไกล": 10588,
        "คลองไทย": 127,
        "ชาติไทยพัฒนา": 401,
        "ทางเลือกใหม่": 211,
        "ประชาธิปัตย์": 454,
        "พลังประชารัฐ": 909,
        "ภูมิใจไทย": 31281,
        "รวมไทยสร้างชาติ": 1542,
        "เพื่อชาติไทย": 248,
        "เพื่อไทย": 38744,
        "เสรีรวมไทย": 762,
        "ไทยภักดี": 93,
        "ไทยสร้างไทย": 341
      }
    },
    {
      "district": 5,
      "total_votes": 92029,
      "party_votes": {
        "ก้าวไกล": 18570,
        "คลองไทย": 314,
        "ชาติไทยพัฒนา": 94,
        "ช่วยชาติ": 275,
        "ประชาธิปัตย์": 1086,
        "พลังประชารัฐ": 21379,
        "ภูมิใจไทย": 228,
        "รวมไทยสร้างชาติ": 3234,
        "เพื่อไทย": 45087,
        "เสรีรวมไทย": 387,
        "ไทยภักดี": 376,
        "ไทยศรีวิไลย์": 582,
        "ไทยสร้างไทย": 417
      }
    },
    {
      "district": 6,
      "total_votes": 93713,
      "party_votes": {
        "ก้าวไกล": 15932,
        "คลองไทย": 199,
        "ชาติไทยพัฒนา": 85,
        "ประชาธิปัตย์": 181,
        "พลังประชารัฐ": 1320,
        "ภูมิใจไทย": 27080,
        "รวมไทยสร้างชาติ": 1056,
        "เพื่อไทย": 46765,
        "เสรีรวมไทย": 158,
        "ไทยภักดี": 445,
        "ไทยสร้างไทย": 492
      }
    }
  ],
  "มุกดาหาร": [
    {
      "district": 1,
      "total_votes": 100842,
      "party_votes": {
        "ก้าวไกล": 28451,
        "คลองไทย": 410,
        "ทางเลือกใหม่": 126,
        "ประชาธิปัตย์": 640,
        "ประชาธิปไตยใหม่": 99,
        "พลังประชารัฐ": 33514,
        "ภูมิใจไทย": 1332,
        "รวมไทยสร้างชาติ": 1573,
        "เพื่อไทย": 26406,
        "เสรีรวมไทย": 2034,
        "ไทยภักดี": 151,
        "ไทยสร้างไทย": 6106
      }
    },
    {
      "district": 2,
      "total_votes": 97661,
      "party_votes": {
        "ก้าวไกล": 28555,
        "ช่วยชาติ": 458,
        "ทางเลือกใหม่": 190,
        "ประชาธิปัตย์": 1532,
        "ประชาธิปไตยใหม่": 379,
        "พลังธรรมใหม่": 496,
        "พลังประชารัฐ": 18572,
        "ภูมิใจไทย": 13727,
        "รวมไทยสร้างชาติ": 1668,
        "เพื่อไทย": 23764,
        "เสรีรวมไทย": 2669,
        "ไทยภักดี": 335,
        "ไทยสมาร์ท": 478,
        "ไทยสร้างไทย": 4838
      }
    }
  ],
  "ยะลา": [
    {
      "district": 1,
      "total_votes": 91672,
      "party_votes": {
        "ก้าวไกล": 14871,
        "ประชาชาติ": 23682,
        "ประชาธิปัตย์": 17378,
        "พลังประชารัฐ": 20451,
        "ภูมิใจไทย": 737,
        "รวมแผ่นดิน": 345,
        "รวมใจไทย": 233,
        "รวมไทยสร้างชาติ": 7367,
        "เป็นธรรม": 3125,
        "เพื่อชาติ": 387,
        "เพื่อไทย": 1707,
        "เสรีรวมไทย": 424,
        "ไทยศรีวิไลย์": 559,
        "ไทยสร้างไทย": 406
      }
    },
    {
      "district": 2,
      "total_votes": 93349,
      "party_votes": {
        "ก้าวไกล": 6540,
        "ประชาชาติ": 51946,
        "ประชาธิปัตย์": 1758,
        "พลังประชารัฐ": 24611,
        "พลังปวงชนไทย": 246,
        "ภูมิใจไทย": 2527,
        "รวมแผ่นดิน": 453,
        "รวมไทยสร้างชาติ": 1040,
        "เป็นธรรม": 987,
        "เพื่อชาติ": 318,
        "เพื่อไทย": 876,
        "เสรีรวมไทย": 440,
        "ไทยพร้อม": 133,
        "ไทยศรีวิไลย์": 970,
        "ไทยสร้างไทย": 504
      }
    },
    {
      "district": 3,
      "total_votes": 90913,
      "party_votes": {
        "ก้าวไกล": 16575,
        "คลองไทย": 210,
        "ประชาชาติ": 31741,
        "ประชาธิปัตย์": 5286,
        "พลังประชารัฐ": 24885,
        "พลังปวงชนไทย": 290,
        "ภูมิใจไทย": 616,
        "รวมไทยสร้างชาติ": 6270,
        "เป็นธรรม": 1098,
        "เพื่อชาติ": 210,
        "เพื่อไทย": 2659,
        "เสรีรวมไทย": 465,
        "ไทยศรีวิไลย์": 207,
        "ไทยสร้างไทย": 401
      }
    }
  ],
  "ยโสธร": [
    {
      "district": 1,
      "total_votes": 106293,
      "party_votes": {
        "ก้าวไกล": 11714,
        "คลองไทย": 128,
        "ชาติไทยพัฒนา": 25214,
        "ประชาธิปัตย์": 145,
        "ประชาธิปไตยใหม่": 109,
        "พลังประชารัฐ": 956,
        "ภูมิใจไทย": 595,
        "รวมแผ่นดิน": 346,
        "เพื่อไทย": 13394,
        "เสรีรวมไทย": 369,
        "ไทยภักดี": 193,
        "ไทยสร้างไทย": 53130
      }
    },
    {
      "district": 2,
      "total_votes": 94418,
      "party_votes": {
        "ก้าวไกล": 9541,
        "คลองไทย": 116,
        "ประชาธิปัตย์": 277,
        "ประชาธิปไตยใหม่": 249,
        "พลังประชารัฐ": 388,
        "ภูมิใจไทย": 1435,
        "รวมแผ่นดิน": 1353,
        "รวมไทยสร้างชาติ": 1097,
        "เพื่ออนาคตไทย": 301,
        "เพื่อไทย": 44851,
        "เสรีรวมไทย": 121,
        "ไทยภักดี": 108,
        "ไทยสร้างไทย": 34581
      }
    },
    {
      "district": 3,
      "total_votes": 100298,
      "party_votes": {
        "ก้าวไกล": 14564,
        "ชาติไทยพัฒนา": 13622,
        "ประชาธิปัตย์": 498,
        "ประชาธิปไตยใหม่": 483,
        "พลังประชารัฐ": 4963,
        "ภูมิใจไทย": 38074,
        "รวมไทยสร้างชาติ": 632,
        "เพื่อไทย": 25205,
        "เสรีรวมไทย": 583,
        "ไทยภักดี": 176,
        "ไทยสร้างไทย": 1498
      }
    }
  ],
  "ระนอง": [
    {
      "district": 1,
      "total_votes": 99407,
      "party_votes": {
        "ก้าวไกล": 13568,
        "คลองไทย": 141,
        "ช่วยชาติ": 90,
        "ประชาธิปัตย์": 1803,
        "พลังประชารัฐ": 12940,
        "ภูมิใจไทย": 44717,
        "รวมไทยสร้างชาติ": 22853,
        "เพื่อไทย": 2297,
        "เสรีรวมไทย": 358,
        "ไทยสร้างไทย": 640
      }
    }
  ],
  "ระยอง": [
    {
      "district": 1,
      "total_votes": 88281,
      "party_votes": {
        "ก้าวไกล": 37820,
        "ประชาธิปัตย์": 17829,
        "พลังประชารัฐ": 312,
        "ภูมิใจไทย": 1313,
        "รวมไทยสร้างชาติ": 16204,
        "เพื่อไทย": 13590,
        "เสรีรวมไทย": 343,
        "ไทยภักดี": 253,
        "ไทยศรีวิไลย์": 69,
        "ไทยสร้างไทย": 548
      }
    },
    {
      "district": 2,
      "total_votes": 79281,
      "party_votes": {
        "ก้าวไกล": 38813,
        "ประชาธิปัตย์": 23298,
        "พลังประชารัฐ": 491,
        "รวมไทยสร้างชาติ": 5249,
        "เพื่อไทย": 8221,
        "เสรีรวมไทย": 670,
        "แรงงานสร้างชาติ": 457,
        "ไทยภักดี": 432,
        "ไทยสร้างไทย": 1650
      }
    },
    {
      "district": 3,
      "total_votes": 89470,
      "party_votes": {
        "ก้าวไกล": 29034,
        "คลองไทย": 158,
        "ชาติพัฒนากล้า": 3772,
        "ประชาธิปัตย์": 14668,
        "พลังประชารัฐ": 21726,
        "ภูมิใจไทย": 1004,
        "รวมไทยสร้างชาติ": 3608,
        "เพื่อไทย": 11647,
        "เสรีรวมไทย": 2755,
        "ไทยภักดี": 606,
        "ไทยสร้างไทย": 492
      }
    },
    {
      "district": 4,
      "total_votes": 86278,
      "party_votes": {
        "ก้าวไกล": 38707,
        "ประชาธิปัตย์": 27055,
        "พลังประชารัฐ": 755,
        "รวมไทยสร้างชาติ": 3554,
        "เพื่อไทย": 13425,
        "เสรีรวมไทย": 809,
        "ไทยภักดี": 590,
        "ไทยสร้างไทย": 1383
      }
    },
    {
      "district": 5,
      "total_votes": 86090,
      "party_votes": {
        "ก้าวไกล": 34713,
        "คลองไทย": 373,
        "ประชาธิปัตย์": 19082,
        "พลังประชารัฐ": 452,
        "รวมไทยสร้างชาติ": 16130,
        "เพื่อไทย": 13210,
        "เสรีรวมไทย": 771,
        "ไทยภักดี": 212,
        "ไทยสร้างไทย": 1147
      }
    }
  ],
  "ราชบุรี": [
    {
      "district": 1,
      "total_votes": 101935,
      "party_votes": {
        "ก้าวไกล": 29646,
        "คลองไทย": 238,
        "ชาติพัฒนากล้า": 364,
        "ประชาธิปัตย์": 1446,
        "พลังประชารัฐ": 649,
        "ภูมิใจไทย": 1403,
        "รวมไทยสร้างชาติ": 52941,
        "เพื่อไทย": 14372,
        "เสรีรวมไทย": 628,
        "ไทยภักดี": 248
      }
    },
    {
      "district": 2,
      "total_votes": 95993,
      "party_votes": {
        "ก้าวไกล": 27403,
        "คลองไทย": 258,
        "ประชาธิปัตย์": 2035,
        "พลังประชารัฐ": 41807,
        "ภูมิใจไทย": 1430,
        "รวมไทยสร้างชาติ": 6496,
        "ราษฎร์วิถี": 522,
        "เพื่อชาติไทย": 133,
        "เพื่อไทย": 13778,
        "เสรีรวมไทย": 1289,
        "ไทยภักดี": 842
      }
    },
    {
      "district": 3,
      "total_votes": 112219,
      "party_votes": {
        "ก้าวไกล": 20781,
        "คลองไทย": 305,
        "ประชาธิปัตย์": 1288,
        "พลังประชารัฐ": 49262,
        "ภูมิใจไทย": 26114,
        "รวมแผ่นดิน": 237,
        "รวมไทยสร้างชาติ": 5357,
        "เพื่อชาติไทย": 378,
        "เพื่อไทย": 7848,
        "เสรีรวมไทย": 535,
        "ไทยภักดี": 114
      }
    },
    {
      "district": 4,
      "total_votes": 110903,
      "party_votes": {
        "ก้าวไกล": 19982,
        "ชาติพัฒนากล้า": 105,
        "ประชาธิปัตย์": 22089,
        "พลังประชารัฐ": 551,
        "ภูมิใจไทย": 413,
        "รวมไทยสร้างชาติ": 54815,
        "เพื่อไทย": 12129,
        "เสรีรวมไทย": 268,
        "ไทยภักดี": 136,
        "ไทยศรีวิไลย์": 188,
        "ไทยสร้างไทย": 227
      }
    },
    {
      "district": 5,
      "total_votes": 110005,
      "party_votes": {
        "ก้าวไกล": 17095,
        "คลองไทย": 231,
        "ชาติพัฒนากล้า": 223,
        "ประชาธิปัตย์": 783,
        "พลังประชารัฐ": 44253,
        "ภูมิใจไทย": 38284,
        "รวมไทยสร้างชาติ": 2298,
        "เพื่อไทย": 6179,
        "เสรีรวมไทย": 247,
        "ไทยภักดี": 269,
        "ไทยสร้างไทย": 143
      }
    }
  ],
  "ร้อยเอ็ด": [
    {
      "district": 1,
      "total_votes": 93870,
      "party_votes": {
        "ก้าวไกล": 16306,
        "คลองไทย": 360,
        "ชาติพัฒนากล้า": 436,
        "ชาติไทยพัฒนา": 40436,
        "ประชาธิปัตย์": 528,
        "พลังประชารัฐ": 1029,
        "พลังปวงชนไทย": 58,
        "ภูมิใจไทย": 205,
        "รวมไทยสร้างชาติ": 1087,
        "เปลี่ยน": 117,
        "เพื่อไทย": 32318,
        "เสรีรวมไทย": 545,
        "ไทยภักดี": 69,
        "ไทยสร้างไทย": 376
      }
    },
    {
      "district": 2,
      "total_votes": 92275,
      "party_votes": {
        "ก้าวไกล": 27477,
        "ทางเลือกใหม่": 171,
        "ประชาธิปัตย์": 522,
        "พลังประชารัฐ": 26568,
        "ภูมิใจไทย": 811,
        "รวมแผ่นดิน": 876,
        "รวมไทยสร้างชาติ": 884,
        "เพื่อไทย": 33466,
        "เสรีรวมไทย": 487,
        "แนวทางใหม่": 82,
        "ไทยภักดี": 161,
        "ไทยสร้างไทย": 770
      }
    },
    {
      "district": 3,
      "total_votes": 87513,
      "party_votes": {
        "ก้าวไกล": 13005,
        "คลองไทย": 745,
        "ประชาธิปัตย์": 345,
        "ประชาธิปไตยใหม่": 528,
        "พลังประชารัฐ": 39181,
        "ภูมิใจไทย": 255,
        "รวมแผ่นดิน": 124,
        "รวมไทยสร้างชาติ": 605,
        "เพื่อไทย": 31093,
        "เสรีรวมไทย": 295,
        "ไทยภักดี": 353,
        "ไทยศรีวิไลย์": 361,
        "ไทยสร้างไทย": 623
      }
    },
    {
      "district": 4,
      "total_votes": 83127,
      "party_votes": {
        "ก้าวไกล": 15691,
        "คลองไทย": 135,
        "ประชาธิปัตย์": 443,
        "พลังประชารัฐ": 25853,
        "พลังปวงชนไทย": 319,
        "ภูมิใจไทย": 1106,
        "รวมแผ่นดิน": 357,
        "เพื่อชาติไทย": 200,
        "เพื่อไทย": 36822,
        "เสรีรวมไทย": 697,
        "ไทยภักดี": 128,
        "ไทยสร้างไทย": 1376
      }
    },
    {
      "district": 5,
      "total_votes": 84013,
      "party_votes": {
        "ก้าวไกล": 15201,
        "ประชาธิปัตย์": 510,
        "พลังประชารัฐ": 841,
        "พลังสังคมใหม่": 325,
        "ภูมิใจไทย": 1615,
        "รวมไทยสร้างชาติ": 2910,
        "เพื่อไทย": 61288,
        "เสรีรวมไทย": 639,
        "ไทยภักดี": 153,
        "ไทยสร้างไทย": 531
      }
    },
    {
      "district": 6,
      "total_votes": 84460,
      "party_votes": {
        "ก้าวไกล": 12838,
        "ประชาธิปัตย์": 357,
        "ประชาธิปไตยใหม่": 82,
        "พลังประชารัฐ": 4358,
        "ภูมิใจไทย": 16306,
        "รวมไทยสร้างชาติ": 1322,
        "เพื่อชาติไทย": 153,
        "เพื่อไทย": 36878,
        "เสรีรวมไทย": 1158,
        "ไทยภักดี": 175,
        "ไทยสร้างไทย": 10603,
        "ไทยเป็นหนึ่ง": 230
      }
    },
    {
      "district": 7,
      "total_votes": 89428,
      "party_votes": {
        "ก้าวไกล": 11980,
        "คลองไทย": 479,
        "ชาติไทยพัฒนา": 1300,
        "ประชาธิปัตย์": 211,
        "ประชาธิปไตยใหม่": 71,
        "พลังประชารัฐ": 3753,
        "พลังสังคมใหม่": 67,
        "ภูมิใจไทย": 6502,
        "รวมไทยสร้างชาติ": 540,
        "เพื่อชาติ": 303,
        "เพื่อไทย": 20956,
        "เสรีรวมไทย": 691,
        "ไทยภักดี": 83,
        "ไทยสร้างไทย": 42492
      }
    },
    {
      "district": 8,
      "total_votes": 90499,
      "party_votes": {
        "ก้าวไกล": 15533,
        "คลองไทย": 25,
        "ทางเลือกใหม่": 105,
        "ประชาธิปัตย์": 751,
        "ประชาธิปไตยใหม่": 305,
        "พลังประชารัฐ": 627,
        "พลังปวงชนไทย": 491,
        "พลังสังคมใหม่": 93,
        "ภูมิใจไทย": 2337,
        "รวมไทยสร้างชาติ": 1117,
        "เพื่อชาติไทย": 86,
        "เพื่อไทย": 47305,
        "เสรีรวมไทย": 445,
        "แนวทางใหม่": 92,
        "ไทยภักดี": 359,
        "ไทยสร้างไทย": 20828
      }
    }
  ],
  "ลพบุรี": [
    {
      "district": 1,
      "total_votes": 87126,
      "party_votes": {
        "ก้าวไกล": 25409,
        "คลองไทย": 305,
        "ถิ่นกาขาวชาววิไล": 247,
        "ประชาธิปัตย์": 6147,
        "พลังประชารัฐ": 10884,
        "ภูมิใจไทย": 290,
        "รวมไทยสร้างชาติ": 13317,
        "เปลี่ยน": 199,
        "เพื่อชาติไทย": 100,
        "เพื่อไทย": 28405,
        "เสรีรวมไทย": 667,
        "ไทยภักดี": 436,
        "ไทยสร้างไทย": 720
      }
    },
    {
      "district": 2,
      "total_votes": 87922,
      "party_votes": {
        "ก้าวไกล": 26330,
        "ประชาธิปัตย์": 896,
        "พลังประชารัฐ": 1687,
        "ภูมิใจไทย": 16385,
        "รวมไทยสร้างชาติ": 23040,
        "เปลี่ยน": 229,
        "เพื่อชาติไทย": 430,
        "เพื่อไทย": 16943,
        "เสรีรวมไทย": 1138,
        "ไทยภักดี": 844
      }
    },
    {
      "district": 3,
      "total_votes": 91298,
      "party_votes": {
        "ก้าวไกล": 13256,
        "คลองไทย": 117,
        "ประชาธิปัตย์": 419,
        "พลังประชารัฐ": 589,
        "ภูมิใจไทย": 43330,
        "รวมไทยสร้างชาติ": 2102,
        "เปลี่ยน": 540,
        "เพื่อชาติไทย": 375,
        "เพื่อไทย": 30123,
        "เสรีรวมไทย": 379,
        "ไทยภักดี": 68
      }
    },
    {
      "district": 4,
      "total_votes": 83193,
      "party_votes": {
        "ก้าวไกล": 18421,
        "คลองไทย": 130,
        "ถิ่นกาขาวชาววิไล": 629,
        "ประชาธิปัตย์": 450,
        "พลังประชารัฐ": 664,
        "ภูมิใจไทย": 41413,
        "รวมไทยสร้างชาติ": 1992,
        "เปลี่ยน": 93,
        "เพื่อชาติ": 441,
        "เพื่อไทย": 18326,
        "เสรีรวมไทย": 504,
        "ไทยภักดี": 130
      }
    },
    {
      "district": 5,
      "total_votes": 85488,
      "party_votes": {
        "ก้าวไกล": 9634,
        "คลองไทย": 364,
        "ประชาธิปัตย์": 263,
        "พลังประชารัฐ": 6690,
        "ภูมิใจไทย": 24389,
        "รวมไทยสร้างชาติ": 1119,
        "เปลี่ยน": 221,
        "เพื่อไทย": 41827,
        "เสรีรวมไทย": 334,
        "ไทยสมาร์ท": 90,
        "ไทยสร้างไทย": 557
      }
    }
  ],
  "ลำปาง": [
    {
      "district": 1,
      "total_votes": 111945,
      "party_votes": {
        "ก้าวไกล": 51579,
        "ชาติพัฒนากล้า": 571,
        "ประชาธิปัตย์": 1361,
        "พลังประชารัฐ": 8808,
        "ภูมิใจไทย": 3994,
        "รวมไทยสร้างชาติ": 7207,
        "เพื่อชาติ": 406,
        "เพื่อชาติไทย": 587,
        "เพื่อไทย": 34747,
        "เสรีรวมไทย": 1081,
        "ไทยศรีวิไลย์": 478,
        "ไทยสร้างไทย": 1126
      }
    },
    {
      "district": 2,
      "total_votes": 109622,
      "party_votes": {
        "ก้าวไกล": 35484,
        "ชาติพัฒนากล้า": 704,
        "ประชาธิปัตย์": 1037,
        "พลังประชารัฐ": 16919,
        "ภูมิใจไทย": 714,
        "รวมไทยสร้างชาติ": 3591,
        "เพื่อชาติ": 576,
        "เพื่อไทย": 41114,
        "เสรีรวมไทย": 809,
        "ไทยศรีวิไลย์": 523,
        "ไทยสร้างไทย": 8151
      }
    },
    {
      "district": 3,
      "total_votes": 111311,
      "party_votes": {
        "ก้าวไกล": 41651,
        "ชาติพัฒนากล้า": 786,
        "ประชาธิปัตย์": 817,
        "พลังประชารัฐ": 27786,
        "พลังสังคมใหม่": 748,
        "ภูมิใจไทย": 1865,
        "รวมไทยสร้างชาติ": 5403,
        "เพื่อชาติไทย": 288,
        "เพื่อไทย": 28756,
        "เสรีรวมไทย": 1602,
        "ไทยศรีวิไลย์": 421,
        "ไทยสร้างไทย": 1188
      }
    },
    {
      "district": 4,
      "total_votes": 113026,
      "party_votes": {
        "ก้าวไกล": 47027,
        "ประชาธิปัตย์": 1224,
        "พลังประชารัฐ": 15672,
        "พลังสังคมใหม่": 524,
        "ภูมิใจไทย": 2731,
        "รวมไทยสร้างชาติ": 14884,
        "เพื่อชาติไทย": 482,
        "เพื่อไทย": 27962,
        "เสรีรวมไทย": 1791,
        "ไทยศรีวิไลย์": 325,
        "ไทยสร้างไทย": 404
      }
    }
  ],
  "ลำพูน": [
    {
      "district": 1,
      "total_votes": 137569,
      "party_votes": {
        "ก้าวไกล": 60127,
        "คลองไทย": 235,
        "ประชาธิปัตย์": 6033,
        "พลังประชารัฐ": 16233,
        "พลังปวงชนไทย": 199,
        "ภูมิใจไทย": 887,
        "รวมแผ่นดิน": 17464,
        "รวมไทยสร้างชาติ": 3404,
        "เพื่อไทย": 28328,
        "เสรีรวมไทย": 587,
        "ไทยสร้างไทย": 4072
      }
    },
    {
      "district": 2,
      "total_votes": 131375,
      "party_votes": {
        "ก้าวไกล": 43266,
        "คลองไทย": 352,
        "ประชาธิปัตย์": 3162,
        "พลังประชารัฐ": 29174,
        "พลังปวงชนไทย": 1017,
        "พลังสยาม": 235,
        "พลังสังคมใหม่": 1032,
        "ภูมิใจไทย": 1078,
        "รวมไทยสร้างชาติ": 3070,
        "เพื่อไทย": 47050,
        "เสรีรวมไทย": 932,
        "ไทยสร้างไทย": 1007
      }
    }
  ],
  "ศรีสะเกษ": [
    {
      "district": 1,
      "total_votes": 95568,
      "party_votes": {
        "ก้าวไกล": 14003,
        "ทางเลือกใหม่": 53,
        "ประชาธิปัตย์": 665,
        "ประชาธิปไตยใหม่": 208,
        "พลังประชารัฐ": 288,
        "ภูมิใจไทย": 35940,
        "รวมไทยสร้างชาติ": 1099,
        "เพื่อไทย": 42445,
        "เสรีรวมไทย": 597,
        "แนวทางใหม่": 119,
        "ไทยภักดี": 151
      }
    },
    {
      "district": 2,
      "total_votes": 82157,
      "party_votes": {
        "ก้าวไกล": 24821,
        "คลองไทย": 351,
        "ทางเลือกใหม่": 208,
        "ประชาธิปัตย์": 615,
        "ประชาธิปไตยใหม่": 386,
        "พลังประชารัฐ": 1152,
        "ภูมิใจไทย": 336,
        "รวมไทยสร้างชาติ": 2409,
        "เพื่อไทย": 42475,
        "เสรีรวมไทย": 2180,
        "แนวทางใหม่": 418,
        "ไทยภักดี": 436,
        "ไทยสร้างไทย": 6370
      }
    },
    {
      "district": 3,
      "total_votes": 84363,
      "party_votes": {
        "ก้าวไกล": 10288,
        "คลองไทย": 199,
        "ทางเลือกใหม่": 122,
        "ประชาธิปัตย์": 550,
        "พลังประชารัฐ": 969,
        "ภูมิใจไทย": 37934,
        "รวมพลัง": 96,
        "รวมไทยสร้างชาติ": 904,
        "เพื่อไทย": 32162,
        "เสรีรวมไทย": 489,
        "แนวทางใหม่": 96,
        "ไทยภักดี": 217,
        "ไทยสร้างไทย": 337
      }
    },
    {
      "district": 4,
      "total_votes": 81190,
      "party_votes": {
        "ก้าวไกล": 9744,
        "คลองไทย": 94,
        "ประชาธิปัตย์": 641,
        "พลังประชารัฐ": 1848,
        "ภูมิใจไทย": 28731,
        "รวมไทยสร้างชาติ": 857,
        "เพื่อไทย": 38410,
        "เสรีรวมไทย": 301,
        "ไทยภักดี": 270,
        "ไทยสร้างไทย": 294
      }
    },
    {
      "district": 5,
      "total_votes": 81433,
      "party_votes": {
        "ก้าวไกล": 18978,
        "คลองไทย": 99,
        "ประชาธิปัตย์": 322,
        "พลังประชารัฐ": 394,
        "พลังปวงชนไทย": 488,
        "ภูมิใจไทย": 25837,
        "รวมไทยสร้างชาติ": 1450,
        "เพื่อไทย": 32884,
        "เสรีรวมไทย": 598,
        "ไทยภักดี": 383
      }
    },
    {
      "district": 6,
      "total_votes": 83105,
      "party_votes": {
        "ก้าวไกล": 18239,
        "คลองไทย": 265,
        "ประชาธิปัตย์": 666,
        "ประชาธิปไตยใหม่": 370,
        "พลังประชารัฐ": 23573,
        "ภูมิใจไทย": 2277,
        "รวมไทยสร้างชาติ": 1686,
        "เพื่อไทย": 35379,
        "เสรีรวมไทย": 227,
        "ไทยภักดี": 423
      }
    },
    {
      "district": 7,
      "total_votes": 80860,
      "party_votes": {
        "ก้าวไกล": 17953,
        "คลองไทย": 439,
        "ประชาธิปัตย์": 446,
        "พลังประชารัฐ": 6219,
        "ภูมิใจไทย": 1443,
        "เพื่อไทย": 52952,
        "เสรีรวมไทย": 206,
        "ไทยภักดี": 734,
        "ไทยสร้างไทย": 468
      }
    },
    {
      "district": 8,
      "total_votes": 92860,
      "party_votes": {
        "ก้าวไกล": 8158,
        "คลองไทย": 627,
        "ประชาธิปัตย์": 230,
        "พลังประชารัฐ": 4971,
        "ภูมิใจไทย": 42882,
        "รวมไทยสร้างชาติ": 379,
        "เพื่อไทย": 34811,
        "เสรีรวมไทย": 465,
        "ไทยภักดี": 337
      }
    },
    {
      "district": 9,
      "total_votes": 92818,
      "party_votes": {
        "ก้าวไกล": 19086,
        "ประชาธิปัตย์": 804,
        "ประชาธิปไตยใหม่": 446,
        "พลังประชารัฐ": 1475,
        "ภูมิใจไทย": 30637,
        "รวมไทยสร้างชาติ": 1066,
        "เพื่อไทย": 38051,
        "เสรีรวมไทย": 112,
        "แนวทางใหม่": 112,
        "ไทยภักดี": 537,
        "ไทยสร้างไทย": 492
      }
    }
  ],
  "สกลนคร": [
    {
      "district": 1,
      "total_votes": 90682,
      "party_votes": {
        "ก้าวไกล": 27493,
        "คลองไทย": 296,
        "ชาติพัฒนากล้า": 161,
        "ประชาธิปัตย์": 1687,
        "พลังประชารัฐ": 484,
        "พลังสังคมใหม่": 309,
        "ภูมิใจไทย": 753,
        "รวมแผ่นดิน": 318,
        "รวมไทยสร้างชาติ": 3195,
        "เพื่อไทย": 29716,
        "เสรีรวมไทย": 638,
        "ไทยภักดี": 229,
        "ไทยสร้างไทย": 25403
      }
    },
    {
      "district": 2,
      "total_votes": 87077,
      "party_votes": {
        "ก้าวไกล": 21317,
        "คลองไทย": 259,
        "ช่วยชาติ": 374,
        "ประชาธิปัตย์": 27406,
        "พลังประชารัฐ": 863,
        "พลังสยาม": 220,
        "ภูมิใจไทย": 1960,
        "รวมแผ่นดิน": 1210,
        "รวมไทยสร้างชาติ": 3570,
        "เพื่อชาติไทย": 505,
        "เพื่อไทย": 26700,
        "เสรีรวมไทย": 374,
        "แนวทางใหม่": 143,
        "ไทยภักดี": 593,
        "ไทยรวมไทย": 157,
        "ไทยสร้างไทย": 1426
      }
    },
    {
      "district": 3,
      "total_votes": 88312,
      "party_votes": {
        "ก้าวไกล": 12737,
        "คลองไทย": 164,
        "ช่วยชาติ": 98,
        "ประชาธิปัตย์": 11723,
        "พลังประชารัฐ": 11738,
        "ภูมิใจไทย": 438,
        "รวมแผ่นดิน": 340,
        "รวมไทยสร้างชาติ": 862,
        "เพื่อไทย": 49346,
        "เสรีรวมไทย": 464,
        "ไทยภักดี": 93,
        "ไทยสร้างไทย": 309
      }
    },
    {
      "district": 4,
      "total_votes": 84157,
      "party_votes": {
        "ก้าวไกล": 20947,
        "คลองไทย": 284,
        "ชาติพัฒนากล้า": 468,
        "ช่วยชาติ": 132,
        "ประชาธิปัตย์": 15745,
        "พลังประชารัฐ": 1311,
        "พลังสังคมใหม่": 47,
        "ภูมิใจไทย": 1465,
        "รวมแผ่นดิน": 196,
        "รวมไทยสร้างชาติ": 5312,
        "เพื่อชาติ": 941,
        "เพื่อไทย": 35690,
        "เสรีรวมไทย": 324,
        "แนวทางใหม่": 305,
        "ไทยภักดี": 79,
        "ไทยสร้างไทย": 911
      }
    },
    {
      "district": 5,
      "total_votes": 81702,
      "party_votes": {
        "ก้าวไกล": 19980,
        "คลองไทย": 70,
        "ช่วยชาติ": 257,
        "ประชาธิปัตย์": 221,
        "พลังประชารัฐ": 29085,
        "ภูมิใจไทย": 282,
        "รวมแผ่นดิน": 1061,
        "รวมไทยสร้างชาติ": 997,
        "เพื่อไทย": 25973,
        "เสรีรวมไทย": 800,
        "ไทยภักดี": 97,
        "ไทยสร้างไทย": 2879
      }
    },
    {
      "district": 6,
      "total_votes": 80143,
      "party_votes": {
        "ก้าวไกล": 21506,
        "คลองไทย": 157,
        "ช่วยชาติ": 208,
        "ทางเลือกใหม่": 165,
        "ประชาธิปัตย์": 12956,
        "พลังประชารัฐ": 722,
        "พลังสังคมใหม่": 551,
        "ภูมิใจไทย": 1066,
        "รวมแผ่นดิน": 337,
        "รวมไทยสร้างชาติ": 1202,
        "เพื่อไทย": 39035,
        "เสรีรวมไทย": 468,
        "ไทยภักดี": 157,
        "ไทยรวมไทย": 237,
        "ไทยสร้างไทย": 1376
      }
    },
    {
      "district": 7,
      "total_votes": 79233,
      "party_votes": {
        "ก้าวไกล": 27180,
        "คลองไทย": 94,
        "ความหวังใหม่": 387,
        "ประชาธิปัตย์": 475,
        "พลังประชารัฐ": 2934,
        "พลังสังคมใหม่": 332,
        "ภูมิใจไทย": 11579,
        "รวมไทยสร้างชาติ": 1563,
        "เพื่อไทย": 32195,
        "เสรีรวมไทย": 553,
        "ไทยภักดี": 134,
        "ไทยสมาร์ท": 736,
        "ไทยสร้างไทย": 1071
      }
    }
  ],
  "สงขลา": [
    {
      "district": 1,
      "total_votes": 95993,
      "party_votes": {
        "ก้าวไกล": 19112,
        "ชาติพัฒนากล้า": 2058,
        "ประชาธิปัตย์": 40521,
        "พลังประชารัฐ": 2026,
        "พลังปวงชนไทย": 58,
        "ภูมิใจไทย": 12573,
        "รวมไทยสร้างชาติ": 17509,
        "เพื่อไทย": 1467,
        "เสรีรวมไทย": 262,
        "ไทยสมาร์ท": 174,
        "ไทยสร้างไทย": 233
      }
    },
    {
      "district": 2,
      "total_votes": 82316,
      "party_votes": {
        "ก้าวไกล": 20385,
        "ชาติพัฒนากล้า": 15368,
        "ประชาธิปัตย์": 9573,
        "พลังประชารัฐ": 6209,
        "พลังสังคมใหม่": 114,
        "ภูมิใจไทย": 7432,
        "รวมไทยสร้างชาติ": 20553,
        "เพื่อชาติ": 82,
        "เพื่อไทย": 2155,
        "เสรีรวมไทย": 217,
        "ไทยสร้างไทย": 228
      }
    },
    {
      "district": 3,
      "total_votes": 101092,
      "party_votes": {
        "ก้าวไกล": 19885,
        "ชาติพัฒนากล้า": 3115,
        "ประชาธิปัตย์": 39577,
        "พลังประชารัฐ": 625,
        "พลังปวงชนไทย": 150,
        "พลังสังคมใหม่": 463,
        "ภูมิใจไทย": 20703,
        "รวมไทยสร้างชาติ": 13247,
        "เพื่อชาติ": 258,
        "เพื่อไทย": 2050,
        "เสรีรวมไทย": 327,
        "ไทยสร้างไทย": 692
      }
    },
    {
      "district": 4,
      "total_votes": 96619,
      "party_votes": {
        "ก้าวไกล": 8526,
        "ประชาธิปัตย์": 34036,
        "พลังประชารัฐ": 35289,
        "พลังสังคมใหม่": 81,
        "ภูมิใจไทย": 6068,
        "รวมไทยสร้างชาติ": 10857,
        "เพื่อไทย": 798,
        "เสรีรวมไทย": 381,
        "ไทยศรีวิไลย์": 58,
        "ไทยสร้างไทย": 525
      }
    },
    {
      "district": 5,
      "total_votes": 92196,
      "party_votes": {
        "ก้าวไกล": 14230,
        "ประชากรไทย": 547,
        "ประชาธิปัตย์": 54343,
        "พลังประชารัฐ": 6698,
        "พลังปวงชนไทย": 345,
        "พลังสังคมใหม่": 111,
        "ภูมิใจไทย": 1619,
        "รวมไทยสร้างชาติ": 9804,
        "เพื่อไทย": 3200,
        "เสรีรวมไทย": 688,
        "ไทยสร้างไทย": 611
      }
    },
    {
      "district": 6,
      "total_votes": 87971,
      "party_votes": {
        "ก้าวไกล": 12719,
        "ประชาธิปัตย์": 34835,
        "พลังประชารัฐ": 33648,
        "พลังปวงชนไทย": 168,
        "พลังสังคมใหม่": 215,
        "รวมไทยสร้างชาติ": 4462,
        "เพื่อไทย": 1108,
        "เสรีรวมไทย": 193,
        "ไทยสมาร์ท": 255,
        "ไทยสร้างไทย": 368
      }
    },
    {
      "district": 7,
      "total_votes": 90326,
      "party_votes": {
        "ประชาธิปัตย์": 28723,
        "พลังประชารัฐ": 20983,
        "พลังปวงชนไทย": 136,
        "พลังสังคมใหม่": 264,
        "ภูมิใจไทย": 31926,
        "รวมไทยสร้างชาติ": 1513,
        "เพื่อไทย": 4604,
        "เสรีรวมไทย": 891,
        "ไทยสมาร์ท": 1286
      }
    },
    {
      "district": 8,
      "total_votes": 90444,
      "party_votes": {
        "ก้าวไกล": 8016,
        "ประชาธิปัตย์": 42932,
        "ประชาไทย": 749,
        "พลังประชารัฐ": 1791,
        "พลังปวงชนไทย": 203,
        "พลังสังคมใหม่": 285,
        "ภูมิใจไทย": 25375,
        "รวมไทยสร้างชาติ": 4270,
        "เพื่อไทย": 5165,
        "เสรีรวมไทย": 584,
        "ไทยสร้างไทย": 1074
      }
    },
    {
      "district": 9,
      "total_votes": 100430,
      "party_votes": {
        "ก้าวไกล": 19729,
        "ชาติพัฒนากล้า": 2803,
        "ช่วยชาติ": 180,
        "ประชาธิปัตย์": 38200,
        "พลังประชารัฐ": 2245,
        "พลังสังคมใหม่": 250,
        "ภูมิใจไทย": 26865,
        "รวมพลัง": 337,
        "รวมไทยสร้างชาติ": 6843,
        "เพื่อไทย": 2217,
        "เสรีรวมไทย": 552,
        "ไทยสร้างไทย": 209
      }
    }
  ],
  "สตูล": [
    {
      "district": 1,
      "total_votes": 81297,
      "party_votes": {
        "ก้าวไกล": 12950,
        "คลองไทย": 373,
        "ชาติพัฒนากล้า": 863,
        "ประชาธิปัตย์": 13687,
        "พลังประชารัฐ": 1657,
        "พลังปวงชนไทย": 252,
        "ภูมิใจไทย": 36810,
        "รวมไทยสร้างชาติ": 5249,
        "เพื่อไทย": 8148,
        "เสรีรวมไทย": 593,
        "ไทยสร้างไทย": 715
      }
    },
    {
      "district": 2,
      "total_votes": 99761,
      "party_votes": {
        "ก้าวไกล": 11863,
        "คลองไทย": 772,
        "ชาติพัฒนากล้า": 409,
        "ประชาธิปัตย์": 1883,
        "พลังประชารัฐ": 19957,
        "พลังปวงชนไทย": 119,
        "ภูมิใจไทย": 55621,
        "รวมไทยสร้างชาติ": 2174,
        "เพื่อไทย": 6059,
        "เสรีรวมไทย": 425,
        "ไทยสร้างไทย": 479
      }
    }
  ],
  "สมุทรปราการ": [
    {
      "district": 1,
      "total_votes": 95110,
      "party_votes": {
        "ก้าวไกล": 46383,
        "คลองไทย": 97,
        "ชาติพัฒนากล้า": 491,
        "ประชาธิปัตย์": 1140,
        "พลังประชารัฐ": 21460,
        "ภูมิใจไทย": 160,
        "รวมไทยสร้างชาติ": 9612,
        "เพื่อไทย": 13889,
        "เสรีรวมไทย": 1124,
        "ไทยภักดี": 276,
        "ไทยสร้างไทย": 478
      }
    },
    {
      "district": 2,
      "total_votes": 94926,
      "party_votes": {
        "ก้าวไกล": 43435,
        "คลองไทย": 128,
        "ประชาธิปัตย์": 828,
        "พลังประชารัฐ": 24725,
        "ภูมิใจไทย": 128,
        "รวมแผ่นดิน": 571,
        "รวมไทยสร้างชาติ": 5389,
        "ราษฎร์วิถี": 113,
        "เพื่อไทย": 18029,
        "เสรีรวมไทย": 510,
        "ไทยภักดี": 383,
        "ไทยสร้างไทย": 687
      }
    },
    {
      "district": 3,
      "total_votes": 101108,
      "party_votes": {
        "ก้าวไกล": 50177,
        "คลองไทย": 130,
        "ประชาธิปัตย์": 1343,
        "พลังประชารัฐ": 17067,
        "ภูมิใจไทย": 302,
        "รวมไทยสร้างชาติ": 12131,
        "ราษฎร์วิถี": 64,
        "เพื่อไทย": 17484,
        "เสรีรวมไทย": 1205,
        "ไทยภักดี": 472,
        "ไทยสร้างไทย": 733
      }
    },
    {
      "district": 4,
      "total_votes": 96700,
      "party_votes": {
        "ก้าวไกล": 49043,
        "ประชาธิปัตย์": 1210,
        "พลังประชารัฐ": 11930,
        "ภูมิใจไทย": 418,
        "รวมไทยสร้างชาติ": 19038,
        "ราษฎร์วิถี": 84,
        "เพื่อไทย": 13098,
        "เสรีรวมไทย": 822,
        "ไทยภักดี": 283,
        "ไทยสร้างไทย": 774
      }
    },
    {
      "district": 5,
      "total_votes": 114386,
      "party_votes": {
        "ก้าวไกล": 60282,
        "คลองไทย": 191,
        "ประชาธิปัตย์": 1568,
        "พลังประชารัฐ": 19474,
        "ภูมิใจไทย": 394,
        "รวมไทยสร้างชาติ": 7555,
        "ราษฎร์วิถี": 60,
        "เพื่อไทย": 22505,
        "เสรีรวมไทย": 1009,
        "ไทยภักดี": 436,
        "ไทยสร้างไทย": 912
      }
    },
    {
      "district": 6,
      "total_votes": 96672,
      "party_votes": {
        "ก้าวไกล": 37730,
        "คลองไทย": 83,
        "ชาติพัฒนากล้า": 656,
        "ประชาธิปัตย์": 742,
        "พลังประชารัฐ": 20909,
        "ภูมิใจไทย": 233,
        "รวมไทยสร้างชาติ": 16670,
        "เพื่อไทย": 18457,
        "เสรีรวมไทย": 478,
        "ไทยภักดี": 166,
        "ไทยสร้างไทย": 548
      }
    },
    {
      "district": 7,
      "total_votes": 109232,
      "party_votes": {
        "ก้าวไกล": 39151,
        "คลองไทย": 150,
        "ชาติพัฒนากล้า": 335,
        "ประชาธิปัตย์": 369,
        "พลังประชารัฐ": 19838,
        "ภูมิใจไทย": 251,
        "รวมไทยสร้างชาติ": 27455,
        "เพื่อไทย": 20638,
        "เสรีรวมไทย": 497,
        "ไทยภักดี": 65,
        "ไทยสร้างไทย": 483
      }
    },
    {
      "district": 8,
      "total_votes": 107511,
      "party_votes": {
        "ก้าวไกล": 46539,
        "คลองไทย": 142,
        "ประชาธิปัตย์": 1540,
        "พลังประชารัฐ": 24764,
        "ภูมิใจไทย": 197,
        "รวมแผ่นดิน": 570,
        "รวมไทยสร้างชาติ": 5451,
        "ราษฎร์วิถี": 367,
        "เพื่อไทย": 24814,
        "เสรีรวมไทย": 1429,
        "ไทยภักดี": 271,
        "ไทยสร้างไทย": 1427
      }
    }
  ],
  "สมุทรสงคราม": [
    {
      "district": 1,
      "total_votes": 113574,
      "party_votes": {
        "ก้าวไกล": 42882,
        "ประชาธิปัตย์": 16353,
        "พลังประชารัฐ": 15716,
        "ภูมิใจไทย": 532,
        "รวมไทยสร้างชาติ": 21953,
        "เพื่อชาติไทย": 120,
        "เพื่อไทย": 14082,
        "เสรีรวมไทย": 601,
        "ไทยภักดี": 602,
        "ไทยสร้างไทย": 733
      }
    }
  ],
  "สมุทรสาคร": [
    {
      "district": 1,
      "total_votes": 110869,
      "party_votes": {
        "ก้าวไกล": 45550,
        "คลองไทย": 149,
        "ประชาธิปัตย์": 6850,
        "พลังประชารัฐ": 29890,
        "ภูมิใจไทย": 575,
        "รวมไทยสร้างชาติ": 9180,
        "เพื่อไทย": 16604,
        "เสรีรวมไทย": 828,
        "ไทยภักดี": 479,
        "ไทยสร้างไทย": 764
      }
    },
    {
      "district": 2,
      "total_votes": 106996,
      "party_votes": {
        "ก้าวไกล": 46897,
        "คลองไทย": 142,
        "ประชาธิปัตย์": 3274,
        "พลังประชารัฐ": 15257,
        "ภูมิใจไทย": 1335,
        "รวมไทยสร้างชาติ": 15718,
        "เพื่อไทย": 22370,
        "เสรีรวมไทย": 1129,
        "ไทยภักดี": 372,
        "ไทยสร้างไทย": 502
      }
    },
    {
      "district": 3,
      "total_votes": 112623,
      "party_votes": {
        "ก้าวไกล": 37511,
        "ประชาธิปัตย์": 2113,
        "พลังประชารัฐ": 20527,
        "ภูมิใจไทย": 29986,
        "รวมไทยสร้างชาติ": 6697,
        "เพื่อไทย": 13008,
        "เสรีรวมไทย": 629,
        "ไทยภักดี": 404,
        "ไทยสร้างไทย": 1748
      }
    }
  ],
  "สระบุรี": [
    {
      "district": 1,
      "total_votes": 96672,
      "party_votes": {
        "ก้าวไกล": 32444,
        "คลองไทย": 496,
        "ประชาธิปัตย์": 9777,
        "พลังประชารัฐ": 9744,
        "ภูมิใจไทย": 339,
        "รวมไทยสร้างชาติ": 13450,
        "เพื่อไทย": 29074,
        "เสรีรวมไทย": 893,
        "ไทยภักดี": 455
      }
    },
    {
      "district": 2,
      "total_votes": 102734,
      "party_votes": {
        "ก้าวไกล": 29164,
        "ช่วยชาติ": 115,
        "ประชาธิปัตย์": 986,
        "พลังประชารัฐ": 460,
        "ภูมิใจไทย": 517,
        "รวมไทยสร้างชาติ": 32412,
        "เปลี่ยน": 220,
        "เพื่อไทย": 38203,
        "เสรีรวมไทย": 335,
        "ไทยภักดี": 322
      }
    },
    {
      "district": 3,
      "total_votes": 97748,
      "party_votes": {
        "ก้าวไกล": 27124,
        "ประชาธิปัตย์": 2050,
        "พลังประชารัฐ": 7431,
        "ภูมิใจไทย": 45424,
        "รวมไทยสร้างชาติ": 2542,
        "เพื่อไทย": 12758,
        "เสรีรวมไทย": 419
      }
    },
    {
      "district": 4,
      "total_votes": 96817,
      "party_votes": {
        "ก้าวไกล": 26809,
        "คลองไทย": 95,
        "ประชาธิปัตย์": 1419,
        "พลังประชารัฐ": 29676,
        "ภูมิใจไทย": 361,
        "รวมไทยสร้างชาติ": 13878,
        "เปลี่ยน": 797,
        "เพื่อไทย": 23180,
        "เสรีรวมไทย": 365,
        "ไทยภักดี": 237
      }
    }
  ],
  "สระแก้ว": [
    {
      "district": 1,
      "total_votes": 101222,
      "party_votes": {
        "ก้าวไกล": 23918,
        "คลองไทย": 83,
        "ประชาธิปัตย์": 779,
        "พลังประชารัฐ": 42183,
        "ภูมิใจไทย": 20570,
        "รวมไทยสร้างชาติ": 1123,
        "เพื่อไทย": 12217,
        "เสรีรวมไทย": 349
      }
    },
    {
      "district": 2,
      "total_votes": 97570,
      "party_votes": {
        "ก้าวไกล": 27533,
        "คลองไทย": 432,
        "ประชาธิปัตย์": 262,
        "พลังประชารัฐ": 47173,
        "ภูมิใจไทย": 2568,
        "รวมไทยสร้างชาติ": 1619,
        "ราษฎร์วิถี": 413,
        "เพื่อไทย": 16943,
        "เสรีรวมไทย": 357,
        "ไทยภักดี": 76,
        "ไทยรวมไทย": 194
      }
    },
    {
      "district": 3,
      "total_votes": 103426,
      "party_votes": {
        "ก้าวไกล": 20828,
        "คลองไทย": 203,
        "ประชาธิปัตย์": 935,
        "พลังประชารัฐ": 24116,
        "รวมไทยสร้างชาติ": 2620,
        "ราษฎร์วิถี": 145,
        "เพื่อไทย": 54116,
        "เสรีรวมไทย": 331,
        "ไทยภักดี": 132
      }
    }
  ],
  "สิงห์บุรี": [
    {
      "district": 1,
      "total_votes": 121478,
      "party_votes": {
        "ก้าวไกล": 39290,
        "คลองไทย": 183,
        "ประชาธิปัตย์": 626,
        "พลังประชารัฐ": 42292,
        "ภูมิใจไทย": 693,
        "รวมไทยสร้างชาติ": 5047,
        "เพื่อไทย": 29193,
        "เสรีรวมไทย": 1162,
        "ไทยภักดี": 675,
        "ไทยสร้างไทย": 2317
      }
    }
  ],
  "สุพรรณบุรี": [
    {
      "district": 1,
      "total_votes": 91750,
      "party_votes": {
        "ก้าวไกล": 26551,
        "ชาติไทยพัฒนา": 46324,
        "ประชาธิปัตย์": 975,
        "พลังประชารัฐ": 740,
        "พลังสังคมใหม่": 501,
        "ภูมิใจไทย": 816,
        "เพื่อชาติไทย": 159,
        "เพื่อไทย": 13641,
        "เสรีรวมไทย": 731,
        "ไทยสร้างไทย": 1312
      }
    },
    {
      "district": 2,
      "total_votes": 89686,
      "party_votes": {
        "ก้าวไกล": 24571,
        "ชาติไทยพัฒนา": 43795,
        "ประชาธิปัตย์": 1985,
        "พลังประชารัฐ": 1023,
        "พลังสังคมใหม่": 189,
        "ภูมิใจไทย": 563,
        "รวมไทยสร้างชาติ": 1788,
        "เพื่อชาติไทย": 144,
        "เพื่อไทย": 7741,
        "เสรีรวมไทย": 892,
        "ไทยสร้างไทย": 6995
      }
    },
    {
      "district": 3,
      "total_votes": 97074,
      "party_votes": {
        "ก้าวไกล": 14774,
        "ชาติไทยพัฒนา": 39348,
        "ประชาธิปัตย์": 32990,
        "พลังประชารัฐ": 303,
        "ภูมิใจไทย": 345,
        "รวมไทยสร้างชาติ": 1073,
        "เพื่อชาติไทย": 104,
        "เพื่อไทย": 7423,
        "เสรีรวมไทย": 230,
        "ไทยสร้างไทย": 484
      }
    },
    {
      "district": 4,
      "total_votes": 101388,
      "party_votes": {
        "ก้าวไกล": 17088,
        "ชาติไทยพัฒนา": 42639,
        "ทางเลือกใหม่": 442,
        "ประชาธิปัตย์": 577,
        "พลังประชารัฐ": 20400,
        "ภูมิใจไทย": 463,
        "รวมไทยสร้างชาติ": 1120,
        "เพื่อไทย": 17876,
        "เสรีรวมไทย": 278,
        "ไทยสร้างไทย": 505
      }
    },
    {
      "district": 5,
      "total_votes": 104473,
      "party_votes": {
        "ก้าวไกล": 24311,
        "คลองไทย": 150,
        "ชาติไทยพัฒนา": 55877,
        "ทางเลือกใหม่": 309,
        "ประชาธิปัตย์": 5358,
        "พลังประชารัฐ": 903,
        "ภูมิใจไทย": 219,
        "รวมไทยสร้างชาติ": 1600,
        "เพื่อชาติไทย": 120,
        "เพื่อไทย": 14543,
        "เสรีรวมไทย": 750,
        "ไทยสร้างไทย": 333
      }
    }
  ],
  "สุราษฎร์ธานี": [
    {
      "district": 1,
      "total_votes": 82701,
      "party_votes": {
        "ก้าวไกล": 23031,
        "คลองไทย": 137,
        "ความหวังใหม่": 110,
        "ชาติพัฒนากล้า": 1427,
        "ประชาธิปัตย์": 9963,
        "พลังประชารัฐ": 1405,
        "ภูมิใจไทย": 13775,
        "รวมไทยสร้างชาติ": 27978,
        "เพื่อชาติ": 130,
        "เพื่อไทย": 3345,
        "เสรีรวมไทย": 579,
        "ไทยภักดี": 329,
        "ไทยสร้างไทย": 492
      }
    },
    {
      "district": 2,
      "total_votes": 80009,
      "party_votes": {
        "ก้าวไกล": 14768,
        "คลองไทย": 100,
        "ชาติพัฒนากล้า": 801,
        "ประชาธิปัตย์": 5369,
        "พลังประชารัฐ": 21378,
        "ภูมิใจไทย": 3174,
        "รวมไทยสร้างชาติ": 24625,
        "เพื่อไทย": 7477,
        "เสรีรวมไทย": 220,
        "ไทยสร้างไทย": 2097
      }
    },
    {
      "district": 3,
      "total_votes": 86371,
      "party_votes": {
        "ก้าวไกล": 13167,
        "คลองไทย": 99,
        "ประชาธิปัตย์": 17783,
        "พลังประชารัฐ": 634,
        "ภูมิใจไทย": 248,
        "รวมไทยสร้างชาติ": 46456,
        "เพื่อไทย": 5732,
        "เสรีรวมไทย": 410,
        "ไทยภักดี": 772,
        "ไทยสร้างไทย": 1070
      }
    },
    {
      "district": 4,
      "total_votes": 81814,
      "party_votes": {
        "ก้าวไกล": 17036,
        "คลองไทย": 210,
        "ชาติพัฒนากล้า": 1076,
        "ประชาธิปัตย์": 21836,
        "พลังประชารัฐ": 503,
        "พลังสังคมใหม่": 319,
        "ภูมิใจไทย": 4049,
        "รวมไทยสร้างชาติ": 26043,
        "เปลี่ยนอนาคต": 207,
        "เพื่อชาติ": 296,
        "เพื่อไทย": 8238,
        "เสรีรวมไทย": 424,
        "ไทยภักดี": 661,
        "ไทยสร้างไทย": 916
      }
    },
    {
      "district": 5,
      "total_votes": 79136,
      "party_votes": {
        "ก้าวไกล": 19854,
        "คลองไทย": 155,
        "ชาติพัฒนากล้า": 737,
        "ประชาธิปัตย์": 13667,
        "พลังประชารัฐ": 1282,
        "ภูมิใจไทย": 3014,
        "รวมไทยสร้างชาติ": 25520,
        "เปลี่ยนอนาคต": 513,
        "เพื่อไทย": 9072,
        "เสรีรวมไทย": 718,
        "ไทยสมาร์ท": 1440,
        "ไทยสร้างไทย": 3164
      }
    },
    {
      "district": 6,
      "total_votes": 90991,
      "party_votes": {
        "ก้าวไกล": 12311,
        "คลองไทย": 69,
        "ความหวังใหม่": 115,
        "ทางเลือกใหม่": 213,
        "ประชาธิปัตย์": 3608,
        "พลังประชารัฐ": 696,
        "ภูมิใจไทย": 43112,
        "รวมไทยสร้างชาติ": 26801,
        "เพื่อไทย": 2834,
        "เสรีรวมไทย": 369,
        "ไทยภักดี": 226,
        "ไทยสร้างไทย": 637
      }
    },
    {
      "district": 7,
      "total_votes": 83524,
      "party_votes": {
        "ก้าวไกล": 20219,
        "คลองไทย": 158,
        "ทางเลือกใหม่": 315,
        "ประชาชาติ": 5197,
        "ประชาธิปัตย์": 14668,
        "พลังประชารัฐ": 5950,
        "ภูมิใจไทย": 915,
        "รวมไทยสร้างชาติ": 30359,
        "เพื่อไทย": 3023,
        "เสรีรวมไทย": 496,
        "ไทยภักดี": 1436,
        "ไทยสร้างไทย": 788
      }
    }
  ],
  "สุรินทร์": [
    {
      "district": 1,
      "total_votes": 94612,
      "party_votes": {
        "ก้าวไกล": 26047,
        "ประชาธิปัตย์": 1547,
        "ประชาธิปไตยใหม่": 123,
        "พลังประชารัฐ": 1410,
        "พลังสังคมใหม่": 70,
        "ภูมิใจไทย": 36305,
        "รวมไทยสร้างชาติ": 2690,
        "เพื่อไทย": 24094,
        "เสรีรวมไทย": 400,
        "แนวทางใหม่": 173,
        "ไทยก้าวหน้า": 505,
        "ไทยภักดี": 829,
        "ไทยสร้างไทย": 419
      }
    },
    {
      "district": 2,
      "total_votes": 95922,
      "party_votes": {
        "ก้าวไกล": 15086,
        "ประชาธิปัตย์": 399,
        "ประชาธิปไตยใหม่": 100,
        "พลังประชารัฐ": 1690,
        "พลังสังคมใหม่": 340,
        "ภูมิใจไทย": 35525,
        "รวมไทยสร้างชาติ": 1347,
        "เพื่อไทย": 39570,
        "เสรีรวมไทย": 458,
        "แนวทางใหม่": 128,
        "ไทยก้าวหน้า": 521,
        "ไทยภักดี": 758
      }
    },
    {
      "district": 3,
      "total_votes": 89833,
      "party_votes": {
        "ก้าวไกล": 16307,
        "ประชาธิปัตย์": 465,
        "ประชาธิปไตยใหม่": 193,
        "พลังประชารัฐ": 1154,
        "พลังสังคมใหม่": 451,
        "ภูมิใจไทย": 44534,
        "รวมไทยสร้างชาติ": 937,
        "เพื่อไทย": 24342,
        "เสรีรวมไทย": 152,
        "แนวทางใหม่": 141,
        "ไทยก้าวหน้า": 208,
        "ไทยภักดี": 200,
        "ไทยสร้างไทย": 749
      }
    },
    {
      "district": 4,
      "total_votes": 88110,
      "party_votes": {
        "ก้าวไกล": 23403,
        "คลองไทย": 811,
        "ประชาธิปัตย์": 940,
        "ประชาธิปไตยใหม่": 158,
        "พลังประชารัฐ": 2980,
        "พลังสังคมใหม่": 523,
        "ภูมิใจไทย": 7218,
        "รวมไทยสร้างชาติ": 15001,
        "เพื่อไทย": 35198,
        "เสรีรวมไทย": 812,
        "ไทยก้าวหน้า": 154,
        "ไทยภักดี": 95,
        "ไทยสร้างไทย": 817
      }
    },
    {
      "district": 5,
      "total_votes": 84087,
      "party_votes": {
        "ก้าวไกล": 18572,
        "คลองไทย": 233,
        "ประชาธิปัตย์": 402,
        "ประชาธิปไตยใหม่": 613,
        "พลังประชารัฐ": 5105,
        "พลังสังคมใหม่": 316,
        "ภูมิใจไทย": 1451,
        "รวมไทยสร้างชาติ": 1623,
        "เพื่อไทย": 36021,
        "เสรีรวมไทย": 382,
        "แนวทางใหม่": 706,
        "ไทยภักดี": 160,
        "ไทยสร้างไทย": 18503
      }
    },
    {
      "district": 6,
      "total_votes": 83578,
      "party_votes": {
        "ก้าวไกล": 13621,
        "คลองไทย": 160,
        "ประชาธิปัตย์": 239,
        "ประชาธิปไตยใหม่": 59,
        "พลังประชารัฐ": 917,
        "พลังสังคมใหม่": 393,
        "ภูมิใจไทย": 38611,
        "เพื่อไทย": 28280,
        "เสรีรวมไทย": 337,
        "แนวทางใหม่": 169,
        "ไทยภักดี": 211,
        "ไทยสร้างไทย": 581
      }
    },
    {
      "district": 7,
      "total_votes": 91499,
      "party_votes": {
        "ก้าวไกล": 19089,
        "คลองไทย": 724,
        "ประชาธิปัตย์": 504,
        "พลังประชารัฐ": 2659,
        "พลังสังคมใหม่": 116,
        "ภูมิใจไทย": 42050,
        "รวมไทยสร้างชาติ": 2036,
        "เพื่อไทย": 22894,
        "เสรีรวมไทย": 490,
        "แนวทางใหม่": 217,
        "ไทยภักดี": 251,
        "ไทยสร้างไทย": 469
      }
    },
    {
      "district": 8,
      "total_votes": 84720,
      "party_votes": {
        "ก้าวไกล": 17521,
        "ประชาธิปัตย์": 669,
        "ประชาธิปไตยใหม่": 106,
        "ภูมิใจไทย": 39558,
        "รวมไทยสร้างชาติ": 1349,
        "เพื่อไทย": 23489,
        "เสรีรวมไทย": 356,
        "แนวทางใหม่": 297,
        "ไทยภักดี": 517,
        "ไทยสร้างไทย": 858
      }
    }
  ],
  "สุโขทัย": [
    {
      "district": 1,
      "total_votes": 82373,
      "party_votes": {
        "ก้าวไกล": 26117,
        "คลองไทย": 656,
        "ประชาธิปัตย์": 1732,
        "พลังประชารัฐ": 290,
        "พลังสังคมใหม่": 243,
        "ภูมิใจไทย": 310,
        "รวมไทยสร้างชาติ": 19230,
        "เพื่อไทย": 32130,
        "เสรีรวมไทย": 492,
        "ไทยภักดี": 910,
        "ไทยสร้างไทย": 263
      }
    },
    {
      "district": 2,
      "total_votes": 78406,
      "party_votes": {
        "ก้าวไกล": 19781,
        "คลองไทย": 95,
        "ประชาธิปัตย์": 17924,
        "พลังประชารัฐ": 511,
        "ภูมิใจไทย": 5498,
        "รวมไทยสร้างชาติ": 2005,
        "เพื่อไทย": 31314,
        "เสรีรวมไทย": 653,
        "ไทยภักดี": 227,
        "ไทยสร้างไทย": 398
      }
    },
    {
      "district": 3,
      "total_votes": 86017,
      "party_votes": {
        "ก้าวไกล": 11647,
        "ประชาธิปัตย์": 578,
        "พลังประชารัฐ": 13570,
        "ภูมิใจไทย": 24982,
        "รวมไทยสร้างชาติ": 1381,
        "เพื่อไทย": 33260,
        "เสรีรวมไทย": 167,
        "ไทยสร้างไทย": 432
      }
    },
    {
      "district": 4,
      "total_votes": 83056,
      "party_votes": {
        "ก้าวไกล": 18512,
        "ชาติพัฒนากล้า": 230,
        "ประชาธิปัตย์": 1837,
        "พลังประชารัฐ": 223,
        "ภูมิใจไทย": 16797,
        "รวมไทยสร้างชาติ": 3140,
        "เพื่อชาติ": 5165,
        "เพื่อไทย": 36738,
        "เสรีรวมไทย": 414
      }
    }
  ],
  "หนองคาย": [
    {
      "district": 1,
      "total_votes": 91626,
      "party_votes": {
        "ก้าวไกล": 23909,
        "คลองไทย": 193,
        "ช่วยชาติ": 243,
        "ประชาธิปัตย์": 614,
        "พลังประชารัฐ": 33078,
        "พลังสังคมใหม่": 233,
        "ภูมิใจไทย": 2930,
        "รวมไทยสร้างชาติ": 1469,
        "เพื่อไทย": 25783,
        "เสรีรวมไทย": 533,
        "ไทยภักดี": 787,
        "ไทยสร้างไทย": 1854
      }
    },
    {
      "district": 2,
      "total_votes": 82084,
      "party_votes": {
        "ก้าวไกล": 17000,
        "ช่วยชาติ": 342,
        "ประชาธิปัตย์": 370,
        "ประชาธิปไตยใหม่": 131,
        "พลังประชารัฐ": 509,
        "ภูมิใจไทย": 26450,
        "รวมไทยสร้างชาติ": 1111,
        "เพื่อไทย": 33527,
        "เสรีรวมไทย": 514,
        "ไทยภักดี": 416,
        "ไทยสร้างไทย": 1714
      }
    },
    {
      "district": 3,
      "total_votes": 87345,
      "party_votes": {
        "ก้าวไกล": 24909,
        "คลองไทย": 526,
        "ช่วยชาติ": 259,
        "ประชาธิปัตย์": 310,
        "พลังประชารัฐ": 23806,
        "พลังสังคมใหม่": 574,
        "ภูมิใจไทย": 880,
        "รวมไทยสร้างชาติ": 1132,
        "เพื่อไทย": 32539,
        "เสรีรวมไทย": 899,
        "ไทยชนะ": 331,
        "ไทยภักดี": 234,
        "ไทยศรีวิไลย์": 198,
        "ไทยสร้างไทย": 748
      }
    }
  ],
  "หนองบัวลำภู": [
    {
      "district": 1,
      "total_votes": 90284,
      "party_votes": {
        "ก้าวไกล": 21795,
        "คลองไทย": 195,
        "ช่วยชาติ": 177,
        "ประชาธิปัตย์": 536,
        "พลังประชารัฐ": 25377,
        "ภูมิใจไทย": 7551,
        "รวมแผ่นดิน": 637,
        "รวมไทยสร้างชาติ": 2243,
        "เพื่อไทย": 26309,
        "เสรีรวมไทย": 456,
        "ไทยภักดี": 118,
        "ไทยสร้างไทย": 4890
      }
    },
    {
      "district": 2,
      "total_votes": 85316,
      "party_votes": {
        "ก้าวไกล": 17344,
        "คลองไทย": 43,
        "ประชาธิปัตย์": 421,
        "พลัง": 198,
        "พลังประชารัฐ": 7030,
        "พลังปวงชนไทย": 602,
        "ภูมิใจไทย": 308,
        "รวมไทยสร้างชาติ": 1982,
        "เพื่อชาติ": 2649,
        "เพื่อไทย": 32247,
        "เสรีรวมไทย": 566,
        "แรงงานสร้างชาติ": 128,
        "ไทยภักดี": 137,
        "ไทยสร้างไทย": 21661
      }
    },
    {
      "district": 3,
      "total_votes": 83043,
      "party_votes": {
        "ก้าวไกล": 14575,
        "ช่วยชาติ": 475,
        "ประชาธิปัตย์": 521,
        "พลัง": 360,
        "พลังประชารัฐ": 10002,
        "พลังปวงชนไทย": 94,
        "พลังสังคมใหม่": 391,
        "ภูมิใจไทย": 1883,
        "รวมไทยสร้างชาติ": 1237,
        "เพื่อไทย": 32375,
        "เสรีรวมไทย": 274,
        "ไทยภักดี": 110,
        "ไทยสร้างไทย": 20746
      }
    }
  ],
  "อำนาจเจริญ": [
    {
      "district": 1,
      "total_votes": 100946,
      "party_votes": {
        "ก้าวไกล": 16724,
        "คลองไทย": 126,
        "ชาติพัฒนากล้า": 459,
        "ประชาธิปัตย์": 15926,
        "ประชาธิปไตยใหม่": 127,
        "พลังประชารัฐ": 2825,
        "พลังสังคมใหม่": 212,
        "ภูมิใจไทย": 38275,
        "รวมไทยสร้างชาติ": 2701,
        "เพื่อไทย": 21388,
        "เสรีรวมไทย": 668,
        "ไทยภักดี": 234,
        "ไทยสร้างไทย": 1281
      }
    },
    {
      "district": 2,
      "total_votes": 106888,
      "party_votes": {
        "ก้าวไกล": 19188,
        "คลองไทย": 193,
        "ประชาธิปัตย์": 2530,
        "ประชาธิปไตยใหม่": 197,
        "พลังประชารัฐ": 16009,
        "ภูมิใจไทย": 46881,
        "รวมไทยสร้างชาติ": 1156,
        "เพื่อไทย": 17637,
        "เสรีรวมไทย": 519,
        "แนวทางใหม่": 173,
        "ไทยภักดี": 378,
        "ไทยสร้างไทย": 2027
      }
    }
  ],
  "อุดรธานี": [
    {
      "district": 1,
      "total_votes": 85692,
      "party_votes": {
        "ก้าวไกล": 32476,
        "คลองไทย": 139,
        "ชาติพัฒนากล้า": 687,
        "ประชาธิปัตย์": 843,
        "พลังประชารัฐ": 16111,
        "พลังปวงชนไทย": 158,
        "พลังสังคมใหม่": 189,
        "ภูมิใจไทย": 437,
        "รวมไทยสร้างชาติ": 5748,
        "เพื่อไทย": 27176,
        "เสรีรวมไทย": 537,
        "ไทยภักดี": 350,
        "ไทยสมาร์ท": 152,
        "ไทยสร้างไทย": 689
      }
    },
    {
      "district": 2,
      "total_votes": 85226,
      "party_votes": {
        "ก้าวไกล": 26489,
        "ชาติพัฒนากล้า": 300,
        "ประชาธิปัตย์": 510,
        "พลังประชารัฐ": 4004,
        "พลังปวงชนไทย": 89,
        "ภูมิใจไทย": 1412,
        "รวมแผ่นดิน": 390,
        "รวมไทยสร้างชาติ": 5984,
        "เพื่อชาติไทย": 393,
        "เพื่อไทย": 40220,
        "เสรีรวมไทย": 2015,
        "แนวทางใหม่": 99,
        "ไทยภักดี": 160,
        "ไทยรวมไทย": 408,
        "ไทยศรีวิไลย์": 194,
        "ไทยสมาร์ท": 116,
        "ไทยสร้างไทย": 2443
      }
    },
    {
      "district": 3,
      "total_votes": 78714,
      "party_votes": {
        "ก้าวไกล": 17654,
        "คลองไทย": 229,
        "ประชาธิปัตย์": 326,
        "พลังประชารัฐ": 807,
        "พลังสังคมใหม่": 344,
        "ภูมิใจไทย": 465,
        "รวมไทยสร้างชาติ": 827,
        "เพื่อไทย": 20248,
        "เสรีรวมไทย": 619,
        "แนวทางใหม่": 253,
        "ไทยภักดี": 207,
        "ไทยศรีวิไลย์": 416,
        "ไทยสมาร์ท": 69,
        "ไทยสร้างไทย": 36250
      }
    },
    {
      "district": 4,
      "total_votes": 77462,
      "party_votes": {
        "ก้าวไกล": 8603,
        "คลองไทย": 114,
        "ประชาธิปัตย์": 209,
        "พลังประชารัฐ": 7560,
        "พลังปวงชนไทย": 226,
        "พลังสังคมใหม่": 65,
        "ภูมิใจไทย": 224,
        "รวมไทยสร้างชาติ": 745,
        "ราษฎร์วิถี": 445,
        "เพื่อชาติไทย": 221,
        "เพื่อไทย": 21475,
        "เสรีรวมไทย": 18145,
        "แนวทางใหม่": 94,
        "ไทยภักดี": 69,
        "ไทยศรีวิไลย์": 208,
        "ไทยสมาร์ท": 29,
        "ไทยสร้างไทย": 19030
      }
    },
    {
      "district": 5,
      "total_votes": 74315,
      "party_votes": {
        "ก้าวไกล": 22559,
        "ครูไทยเพื่อประชาชน": 422,
        "คลองไทย": 184,
        "ชาติรุ่งเรือง": 129,
        "ประชาธิปัตย์": 289,
        "พลังประชารัฐ": 1779,
        "พลังปวงชนไทย": 106,
        "พลังสังคมใหม่": 209,
        "ภูมิใจไทย": 736,
        "รวมไทยสร้างชาติ": 2064,
        "เพื่อชาติไทย": 233,
        "เพื่อไทย": 37890,
        "เสรีรวมไทย": 239,
        "ไทยภักดี": 430,
        "ไทยศรีวิไลย์": 150,
        "ไทยสมาร์ท": 58,
        "ไทยสร้างไทย": 6838
      }
    },
    {
      "district": 6,
      "total_votes": 81383,
      "party_votes": {
        "ก้าวไกล": 22150,
        "คลองไทย": 395,
        "ชาติพัฒนากล้า": 771,
        "ประชาธิปัตย์": 204,
        "พลังประชารัฐ": 4362,
        "พลังปวงชนไทย": 405,
        "พลังสังคมใหม่": 92,
        "ภูมิใจไทย": 266,
        "รวมไทยสร้างชาติ": 1036,
        "เพื่อชาติไทย": 258,
        "เพื่อไทย": 22885,
        "เสรีรวมไทย": 226,
        "แนวทางใหม่": 373,
        "ไทยภักดี": 103,
        "ไทยสมาร์ท": 106,
        "ไทยสร้างไทย": 27751
      }
    },
    {
      "district": 7,
      "total_votes": 80244,
      "party_votes": {
        "ก้าวไกล": 32943,
        "คลองไทย": 130,
        "ชาติพัฒนากล้า": 659,
        "ประชากรไทย": 127,
        "ประชาธิปัตย์": 418,
        "พลังประชารัฐ": 2573,
        "พลังปวงชนไทย": 71,
        "พลังสังคมใหม่": 744,
        "ภูมิใจไทย": 3178,
        "รวมไทยสร้างชาติ": 3643,
        "เพื่อชาติไทย": 231,
        "เพื่อไทย": 33928,
        "เสรีรวมไทย": 537,
        "แนวทางใหม่": 88,
        "ไทยภักดี": 227,
        "ไทยศรีวิไลย์": 315,
        "ไทยสมาร์ท": 76,
        "ไทยสร้างไทย": 356
      }
    },
    {
      "district": 8,
      "total_votes": 78392,
      "party_votes": {
        "ก้าวไกล": 24018,
        "คลองไทย": 45,
        "ประชาธิปัตย์": 550,
        "พลังประชารัฐ": 10126,
        "พลังปวงชนไทย": 64,
        "พลังสังคมใหม่": 140,
        "ภูมิใจไทย": 622,
        "รวมแผ่นดิน": 436,
        "รวมไทยสร้างชาติ": 2174,
        "เพื่อชาติไทย": 371,
        "เพื่อไทย": 33537,
        "เสรีรวมไทย": 960,
        "แนวทางใหม่": 349,
        "ไทยภักดี": 132,
        "ไทยศรีวิไลย์": 555,
        "ไทยสมาร์ท": 769,
        "ไทยสร้างไทย": 3544
      }
    },
    {
      "district": 9,
      "total_votes": 81226,
      "party_votes": {
        "ก้าวไกล": 21666,
        "คลองไทย": 127,
        "ประชาธิปัตย์": 488,
        "พลังประชารัฐ": 7401,
        "พลังปวงชนไทย": 633,
        "ภูมิใจไทย": 542,
        "รวมแผ่นดิน": 1103,
        "รวมไทยสร้างชาติ": 1911,
        "เพื่อไทย": 43529,
        "เสรีรวมไทย": 791,
        "แนวทางใหม่": 224,
        "ไทยภักดี": 346,
        "ไทยศรีวิไลย์": 465,
        "ไทยสมาร์ท": 165,
        "ไทยสร้างไทย": 1835
      }
    },
    {
      "district": 10,
      "total_votes": 78604,
      "party_votes": {
        "ก้าวไกล": 20793,
        "คลองไทย": 355,
        "ประชาธิปัตย์": 582,
        "พลังประชารัฐ": 1661,
        "พลังปวงชนไทย": 128,
        "พลังสังคมใหม่": 167,
        "รวมไทยสร้างชาติ": 1551,
        "เพื่อไทย": 47763,
        "เสรีรวมไทย": 734,
        "แนวทางใหม่": 700,
        "ไทยภักดี": 344,
        "ไทยศรีวิไลย์": 257,
        "ไทยสมาร์ท": 128,
        "ไทยสร้างไทย": 3441
      }
    }
  ],
  "อุตรดิตถ์": [
    {
      "district": 1,
      "total_votes": 85026,
      "party_votes": {
        "ก้าวไกล": 19857,
        "คลองไทย": 269,
        "ประชาธิปัตย์": 820,
        "พลังประชารัฐ": 362,
        "ภูมิใจไทย": 25696,
        "รวมไทยสร้างชาติ": 4089,
        "เพื่อไทย": 32820,
        "เสรีรวมไทย": 396,
        "ไทยสร้างไทย": 717
      }
    },
    {
      "district": 2,
      "total_votes": 82656,
      "party_votes": {
        "ก้าวไกล": 20952,
        "ครูไทยเพื่อประชาชน": 535,
        "คลองไทย": 231,
        "ประชาธิปัตย์": 1087,
        "พลังประชารัฐ": 846,
        "พลังสังคมใหม่": 493,
        "ภูมิใจไทย": 503,
        "รวมไทยสร้างชาติ": 20714,
        "เพื่อไทย": 36183,
        "เสรีรวมไทย": 652,
        "ไทยสร้างไทย": 460
      }
    },
    {
      "district": 3,
      "total_votes": 86162,
      "party_votes": {
        "ก้าวไกล": 18506,
        "คลองไทย": 111,
        "ประชาธิปัตย์": 1543,
        "พลังประชารัฐ": 1284,
        "ภูมิใจไทย": 824,
        "รวมไทยสร้างชาติ": 12896,
        "เพื่อไทย": 48779,
        "เสรีรวมไทย": 654,
        "ไทยศรีวิไลย์": 415,
        "ไทยสร้างไทย": 1150
      }
    }
  ],
  "อุทัยธานี": [
    {
      "district": 1,
      "total_votes": 84828,
      "party_votes": {
        "ก้าวไกล": 15832,
        "ประชาธิปัตย์": 1333,
        "พลังประชารัฐ": 511,
        "ภูมิใจไทย": 49525,
        "รวมไทยสร้างชาติ": 5153,
        "เพื่อไทย": 11272,
        "เสรีรวมไทย": 490,
        "ไทยสร้างไทย": 712
      }
    },
    {
      "district": 2,
      "total_votes": 86791,
      "party_votes": {
        "ก้าวไกล": 18435,
        "ประชาธิปัตย์": 1528,
        "พลังประชารัฐ": 613,
        "ภูมิใจไทย": 43505,
        "รวมไทยสร้างชาติ": 3304,
        "เพื่อไทย": 18690,
        "เสรีรวมไทย": 471,
        "ไทยสร้างไทย": 245
      }
    }
  ],
  "อุบลราชธานี": [
    {
      "district": 1,
      "total_votes": 99023,
      "party_votes": {
        "ก้าวไกล": 31112,
        "คลองไทย": 65,
        "ชาติพัฒนากล้า": 303,
        "ประชาธิปัตย์": 943,
        "พลังประชารัฐ": 1340,
        "พลังปวงชนไทย": 106,
        "พลังสังคมใหม่": 148,
        "ภูมิใจไทย": 307,
        "รวมไทยสร้างชาติ": 9086,
        "เพื่อชาติ": 399,
        "เพื่อไทย": 32468,
        "เสรีรวมไทย": 815,
        "แนวทางใหม่": 75,
        "ไทยภักดี": 188,
        "ไทยศรีวิไลย์": 89,
        "ไทยสร้างไทย": 21579
      }
    },
    {
      "district": 2,
      "total_votes": 92346,
      "party_votes": {
        "ก้าวไกล": 17520,
        "คลองไทย": 418,
        "ประชาธิปัตย์": 38164,
        "พลังประชารัฐ": 1829,
        "พลังปวงชนไทย": 257,
        "ภูมิใจไทย": 787,
        "เพื่อไทย": 31953,
        "เสรีรวมไทย": 624,
        "ไทยภักดี": 422,
        "ไทยศรีวิไลย์": 372
      }
    },
    {
      "district": 3,
      "total_votes": 99574,
      "party_votes": {
        "ก้าวไกล": 8140,
        "คลองไทย": 176,
        "ประชาธิปัตย์": 6888,
        "ประชาธิปไตยใหม่": 148,
        "พลังประชารัฐ": 12423,
        "พลังปวงชนไทย": 510,
        "ภูมิใจไทย": 16572,
        "รวมไทยสร้างชาติ": 730,
        "เพื่อไทย": 22020,
        "เพื่อไทรวมพลัง": 31218,
        "เสรีรวมไทย": 456,
        "ไทยภักดี": 209,
        "ไทยศรีวิไลย์": 84
      }
    },
    {
      "district": 4,
      "total_votes": 100575,
      "party_votes": {
        "ก้าวไกล": 31052,
        "คลองไทย": 107,
        "ชาติไทยพัฒนา": 4013,
        "ประชาธิปัตย์": 755,
        "พลังประชารัฐ": 2847,
        "ภูมิใจไทย": 19511,
        "เพื่อชาติไทย": 344,
        "เพื่อไทย": 39462,
        "เสรีรวมไทย": 891,
        "ไทยภักดี": 693,
        "ไทยศรีวิไลย์": 230,
        "ไทยสร้างไทย": 670
      }
    },
    {
      "district": 5,
      "total_votes": 89798,
      "party_votes": {
        "ก้าวไกล": 12050,
        "คลองไทย": 127,
        "ประชาธิปัตย์": 359,
        "พลังประชารัฐ": 452,
        "พลังปวงชนไทย": 411,
        "ภูมิใจไทย": 44121,
        "รวมไทยสร้างชาติ": 779,
        "เพื่อไทย": 30596,
        "เสรีรวมไทย": 412,
        "ไทยภักดี": 360,
        "ไทยศรีวิไลย์": 131
      }
    },
    {
      "district": 6,
      "total_votes": 84825,
      "party_votes": {
        "ก้าวไกล": 9177,
        "ประชาธิปัตย์": 2504,
        "ประชาธิปไตยใหม่": 338,
        "พลังประชารัฐ": 611,
        "พลังสังคมใหม่": 126,
        "ภูมิใจไทย": 4023,
        "รวมไทยสร้างชาติ": 1049,
        "เพื่อไทย": 43430,
        "เสรีรวมไทย": 180,
        "แนวทางใหม่": 203,
        "ไทยภักดี": 315,
        "ไทยศรีวิไลย์": 110,
        "ไทยสร้างไทย": 22759
      }
    },
    {
      "district": 7,
      "total_votes": 88473,
      "party_votes": {
        "ก้าวไกล": 10300,
        "คลองไทย": 148,
        "ประชาธิปัตย์": 262,
        "ประชาธิปไตยใหม่": 128,
        "พลังประชารัฐ": 404,
        "พลังปวงชนไทย": 102,
        "ภูมิใจไทย": 33499,
        "รวมแผ่นดิน": 776,
        "รวมไทยสร้างชาติ": 2962,
        "เพื่อไทย": 38533,
        "เสรีรวมไทย": 264,
        "แผ่นดินธรรม": 369,
        "ไทยภักดี": 196,
        "ไทยศรีวิไลย์": 127,
        "ไทยสร้างไทย": 403
      }
    },
    {
      "district": 8,
      "total_votes": 92056,
      "party_votes": {
        "ก้าวไกล": 14621,
        "คลองไทย": 662,
        "ประชาธิปัตย์": 644,
        "ประชาธิปไตยใหม่": 260,
        "พลังประชารัฐ": 12037,
        "พลังปวงชนไทย": 251,
        "ภูมิใจไทย": 31773,
        "รวมไทยสร้างชาติ": 1230,
        "เพื่อชาติไทย": 560,
        "เพื่อไทย": 27893,
        "เสรีรวมไทย": 759,
        "ไทยภักดี": 221,
        "ไทยสร้างไทย": 1145
      }
    },
    {
      "district": 9,
      "total_votes": 81849,
      "party_votes": {
        "ก้าวไกล": 12105,
        "ช่วยชาติ": 364,
        "ทางเลือกใหม่": 492,
        "ประชาธิปัตย์": 480,
        "พลังประชารัฐ": 961,
        "พลังสังคมใหม่": 228,
        "ภูมิใจไทย": 1528,
        "รวมไทยสร้างชาติ": 1613,
        "เพื่อชาติไทย": 184,
        "เพื่อไทย": 30851,
        "เสรีรวมไทย": 1049,
        "ไทยภักดี": 366,
        "ไทยศรีวิไลย์": 317,
        "ไทยสร้างไทย": 31311
      }
    },
    {
      "district": 10,
      "total_votes": 97428,
      "party_votes": {
        "ก้าวไกล": 9735,
        "คลองไทย": 78,
        "ทางเลือกใหม่": 724,
        "ประชาธิปัตย์": 331,
        "พลังประชารัฐ": 816,
        "พลังปวงชนไทย": 33,
        "ภูมิใจไทย": 1177,
        "รวมไทยสร้างชาติ": 973,
        "เพื่อชาติ": 264,
        "เพื่อไทย": 19351,
        "เพื่อไทรวมพลัง": 63127,
        "เสรีรวมไทย": 307,
        "แนวทางใหม่": 163,
        "ไทยภักดี": 120,
        "ไทยศรีวิไลย์": 229
      }
    },
    {
      "district": 11,
      "total_votes": 89953,
      "party_votes": {
        "ก้าวไกล": 13063,
        "ความหวังใหม่": 85,
        "ช่วยชาติ": 154,
        "ทางเลือกใหม่": 139,
        "ประชาธิปัตย์": 513,
        "พลังประชารัฐ": 580,
        "พลังปวงชนไทย": 520,
        "ภูมิใจไทย": 43797,
        "รวมไทยสร้างชาติ": 946,
        "เพื่อไทย": 24288,
        "เสรีรวมไทย": 399,
        "ไทยก้าวหน้า": 168,
        "ไทยภักดี": 224,
        "ไทยศรีวิไลย์": 244,
        "ไทยสร้างไทย": 4833
      }
    }
  ],
  "อ่างทอง": [
    {
      "district": 1,
      "total_votes": 84595,
      "party_votes": {
        "ก้าวไกล": 15614,
        "ประชาธิปัตย์": 482,
        "พลังประชารัฐ": 618,
        "ภูมิใจไทย": 44780,
        "รวมไทยสร้างชาติ": 1602,
        "เพื่อไทย": 20886,
        "เสรีรวมไทย": 254,
        "ไทยภักดี": 359
      }
    },
    {
      "district": 2,
      "total_votes": 86144,
      "party_votes": {
        "ก้าวไกล": 12501,
        "ประชาธิปัตย์": 709,
        "พลังประชารัฐ": 816,
        "ภูมิใจไทย": 47887,
        "รวมไทยสร้างชาติ": 1417,
        "เพื่อไทย": 22071,
        "เสรีรวมไทย": 241,
        "ไทยภักดี": 308,
        "ไทยศรีวิไลย์": 194
      }
    }
  ],
  "เชียงราย": [
    {
      "district": 1,
      "total_votes": 102861,
      "party_votes": {
        "ก้าวไกล": 43153,
        "ประชากรไทย": 499,
        "ประชาธิปัตย์": 605,
        "พลังประชารัฐ": 580,
        "พลังปวงชนไทย": 163,
        "ภูมิใจไทย": 15644,
        "รวมไทยสร้างชาติ": 3993,
        "เพื่อไทย": 36100,
        "เสรีรวมไทย": 504,
        "ไทยภักดี": 148,
        "ไทยศรีวิไลย์": 599,
        "ไทยสร้างไทย": 873
      }
    },
    {
      "district": 2,
      "total_votes": 96192,
      "party_votes": {
        "ก้าวไกล": 33085,
        "ท้องที่ไทย": 362,
        "ประชาธิปัตย์": 292,
        "พลังประชารัฐ": 1216,
        "ภูมิใจไทย": 1017,
        "รวมไทยสร้างชาติ": 2738,
        "เพื่อไทย": 55778,
        "เสรีรวมไทย": 354,
        "ไทยภักดี": 215,
        "ไทยศรีวิไลย์": 263,
        "ไทยสร้างไทย": 872
      }
    },
    {
      "district": 3,
      "total_votes": 101575,
      "party_votes": {
        "ก้าวไกล": 25056,
        "ชาติไทยพัฒนา": 14096,
        "ประชาธิปัตย์": 620,
        "พลังประชารัฐ": 15091,
        "ภูมิใจไทย": 10400,
        "รวมไทยสร้างชาติ": 2669,
        "เพื่อไทย": 23384,
        "เสรีรวมไทย": 287,
        "ไทยภักดี": 428,
        "ไทยสร้างไทย": 9544
      }
    },
    {
      "district": 4,
      "total_votes": 106011,
      "party_votes": {
        "ก้าวไกล": 25502,
        "ชาติไทยพัฒนา": 19199,
        "ประชาธิปัตย์": 699,
        "พลังประชารัฐ": 1371,
        "พลังปวงชนไทย": 149,
        "พลังสังคมใหม่": 293,
        "ภูมิใจไทย": 8335,
        "รวมไทยสร้างชาติ": 2417,
        "เพื่อไทย": 39589,
        "เสรีรวมไทย": 520,
        "ไทยภักดี": 136,
        "ไทยสร้างไทย": 7801
      }
    },
    {
      "district": 5,
      "total_votes": 97225,
      "party_votes": {
        "ก้าวไกล": 18181,
        "คลองไทย": 126,
        "ประชาธิปัตย์": 907,
        "พลังประชารัฐ": 13620,
        "พลังปวงชนไทย": 84,
        "ภูมิใจไทย": 27073,
        "รวมไทยสร้างชาติ": 862,
        "เพื่อไทย": 35162,
        "เสรีรวมไทย": 399,
        "ไทยภักดี": 414,
        "ไทยสร้างไทย": 397
      }
    },
    {
      "district": 6,
      "total_votes": 80461,
      "party_votes": {
        "ก้าวไกล": 31789,
        "ประชากรไทย": 172,
        "ประชาธิปัตย์": 1127,
        "พลังประชารัฐ": 9913,
        "ภูมิใจไทย": 16011,
        "รวมไทยสร้างชาติ": 2105,
        "เพื่อไทย": 18027,
        "เสรีรวมไทย": 532,
        "ไทยภักดี": 332,
        "ไทยสร้างไทย": 453
      }
    },
    {
      "district": 7,
      "total_votes": 93009,
      "party_votes": {
        "ก้าวไกล": 25889,
        "ชาติไทยพัฒนา": 558,
        "ประชากรไทย": 286,
        "ประชาธิปัตย์": 570,
        "พลังประชารัฐ": 623,
        "ภูมิใจไทย": 18153,
        "รวมไทยสร้างชาติ": 10824,
        "เพื่อไทย": 31588,
        "เสรีรวมไทย": 877,
        "ไทยภักดี": 222,
        "ไทยศรีวิไลย์": 782,
        "ไทยสร้างไทย": 2637
      }
    }
  ],
  "เชียงใหม่": [
    {
      "district": 1,
      "total_votes": 102293,
      "party_votes": {
        "ก้าวไกล": 48823,
        "คลองไทย": 117,
        "ชาติพัฒนากล้า": 453,
        "ประชาธิปัตย์": 1514,
        "ประชาไทย": 69,
        "พลังประชารัฐ": 1019,
        "ภูมิใจไทย": 387,
        "รวมแผ่นดิน": 483,
        "รวมไทยสร้างชาติ": 9772,
        "เพื่อชาติไทย": 152,
        "เพื่อไทย": 30086,
        "เสรีรวมไทย": 675,
        "แนวทางใหม่": 75,
        "ไทยศรีวิไลย์": 197,
        "ไทยสร้างไทย": 8471
      }
    },
    {
      "district": 2,
      "total_votes": 108017,
      "party_votes": {
        "ก้าวไกล": 51181,
        "คลองไทย": 88,
        "ประชาธิปัตย์": 1290,
        "พลัง": 920,
        "พลังประชารัฐ": 2695,
        "พลังไทยรักชาติ": 132,
        "ภูมิใจไทย": 579,
        "รวมแผ่นดิน": 837,
        "รวมไทยสร้างชาติ": 7371,
        "ราษฎร์วิถี": 189,
        "เพื่อชาติไทย": 273,
        "เพื่อไทย": 39091,
        "เสรีรวมไทย": 956,
        "แนวทางใหม่": 211,
        "ไทยสร้างไทย": 2204
      }
    },
    {
      "district": 3,
      "total_votes": 107061,
      "party_votes": {
        "ก้าวไกล": 47469,
        "ชาติพัฒนากล้า": 573,
        "ประชาธิปัตย์": 772,
        "พลังประชารัฐ": 1625,
        "ภูมิใจไทย": 3024,
        "รวมแผ่นดิน": 2443,
        "รวมไทยสร้างชาติ": 5197,
        "เพื่อชาติไทย": 336,
        "เพื่อไทย": 43244,
        "เสรีรวมไทย": 677,
        "แนวทางใหม่": 286,
        "ไทยภักดี": 364,
        "ไทยศรีวิไลย์": 266,
        "ไทยสร้างไทย": 785
      }
    },
    {
      "district": 4,
      "total_votes": 108205,
      "party_votes": {
        "ก้าวไกล": 62009,
        "คลองไทย": 333,
        "ชาติพัฒนากล้า": 632,
        "ประชาธิปัตย์": 1790,
        "พลังประชารัฐ": 1523,
        "พลังสังคมใหม่": 288,
        "ภูมิใจไทย": 653,
        "รวมแผ่นดิน": 1261,
        "รวมไทยสร้างชาติ": 15211,
        "เพื่อไทย": 21942,
        "เสรีรวมไทย": 657,
        "แนวทางใหม่": 99,
        "ไทยศรีวิไลย์": 151,
        "ไทยสร้างไทย": 1656
      }
    },
    {
      "district": 5,
      "total_votes": 100408,
      "party_votes": {
        "ก้าวไกล": 37738,
        "คลองไทย": 244,
        "ประชาธิปัตย์": 2259,
        "ประชาไทย": 172,
        "พลังประชารัฐ": 7858,
        "พลังเพื่อไทย": 333,
        "ภูมิใจไทย": 668,
        "รวมแผ่นดิน": 455,
        "รวมไทยสร้างชาติ": 8239,
        "เพื่อไทย": 38015,
        "เสรีรวมไทย": 472,
        "แนวทางใหม่": 347,
        "ไทยศรีวิไลย์": 399,
        "ไทยสร้างไทย": 3209
      }
    },
    {
      "district": 6,
      "total_votes": 90433,
      "party_votes": {
        "ก้าวไกล": 25828,
        "คลองไทย": 200,
        "ประชาธิปัตย์": 534,
        "พลังบูรพา": 424,
        "พลังประชารัฐ": 12140,
        "ภูมิใจไทย": 354,
        "รวมแผ่นดิน": 21937,
        "รวมไทยสร้างชาติ": 3034,
        "เพื่อชาติไทย": 269,
        "เพื่อไทย": 21374,
        "เสรีรวมไทย": 671,
        "แนวทางใหม่": 456,
        "ไทยภักดี": 144,
        "ไทยศรีวิไลย์": 342,
        "ไทยสร้างไทย": 2726
      }
    },
    {
      "district": 7,
      "total_votes": 93968,
      "party_votes": {
        "ก้าวไกล": 32990,
        "ประชาธิปัตย์": 6400,
        "พลังบูรพา": 465,
        "พลังประชารัฐ": 1228,
        "ภูมิใจไทย": 231,
        "รวมแผ่นดิน": 5531,
        "รวมไทยสร้างชาติ": 8830,
        "เพื่อชาติ": 4304,
        "เพื่อไทย": 29387,
        "เสรีรวมไทย": 830,
        "ไทยภักดี": 529,
        "ไทยศรีวิไลย์": 182,
        "ไทยสร้างไทย": 3061
      }
    },
    {
      "district": 8,
      "total_votes": 112000,
      "party_votes": {
        "ก้าวไกล": 50878,
        "คลองไทย": 167,
        "ประชาธิปัตย์": 626,
        "ประชาไทย": 104,
        "พลังประชารัฐ": 15257,
        "พลังสังคมใหม่": 302,
        "ภูมิใจไทย": 942,
        "รวมแผ่นดิน": 1509,
        "รวมไทยสร้างชาติ": 4145,
        "เพื่อชาติไทย": 269,
        "เพื่อไทย": 35237,
        "เสรีรวมไทย": 667,
        "แนวทางใหม่": 112,
        "ไทยศรีวิไลย์": 163,
        "ไทยสร้างไทย": 1622
      }
    },
    {
      "district": 9,
      "total_votes": 103315,
      "party_votes": {
        "ก้าวไกล": 26415,
        "ประชาธิปัตย์": 698,
        "พลัง": 837,
        "พลังประชารัฐ": 31107,
        "ภูมิใจไทย": 12847,
        "รวมแผ่นดิน": 363,
        "รวมไทยสร้างชาติ": 1434,
        "เพื่อชาติไทย": 583,
        "เพื่อไทย": 27032,
        "เสรีรวมไทย": 221,
        "แนวทางใหม่": 330,
        "ไทยภักดี": 396,
        "ไทยศรีวิไลย์": 140,
        "ไทยสร้างไทย": 912
      }
    },
    {
      "district": 10,
      "total_votes": 91720,
      "party_votes": {
        "ก้าวไกล": 20680,
        "ประชาธิปัตย์": 2566,
        "ประชาไทย": 292,
        "พลัง": 492,
        "พลังประชารัฐ": 29138,
        "พลังสังคมใหม่": 540,
        "ภูมิใจไทย": 516,
        "รวมแผ่นดิน": 482,
        "รวมไทยสร้างชาติ": 983,
        "เพื่อชาติไทย": 585,
        "เพื่อไทย": 32638,
        "เสรีรวมไทย": 803,
        "ไทยศรีวิไลย์": 1092,
        "ไทยสร้างไทย": 913
      }
    }
  ],
  "เพชรบุรี": [
    {
      "district": 1,
      "total_votes": 99652,
      "party_votes": {
        "ก้าวไกล": 14184,
        "คลองไทย": 76,
        "ชาติไทยพัฒนา": 25700,
        "ประชาธิปัตย์": 4478,
        "พลังประชารัฐ": 265,
        "ภูมิใจไทย": 10250,
        "รวมไทยสร้างชาติ": 40235,
        "เพื่อไทย": 3978,
        "เสรีรวมไทย": 368,
        "ไทยภักดี": 118
      }
    },
    {
      "district": 2,
      "total_votes": 107853,
      "party_votes": {
        "ก้าวไกล": 14735,
        "คลองไทย": 162,
        "ประชาธิปัตย์": 9287,
        "พลังประชารัฐ": 295,
        "ภูมิใจไทย": 44482,
        "รวมไทยสร้างชาติ": 33901,
        "เพื่อไทย": 4089,
        "เสรีรวมไทย": 584,
        "ไทยภักดี": 318
      }
    },
    {
      "district": 3,
      "total_votes": 104138,
      "party_votes": {
        "ก้าวไกล": 15095,
        "คลองไทย": 121,
        "ประชาธิปัตย์": 8130,
        "พลังประชารัฐ": 1488,
        "ภูมิใจไทย": 25238,
        "รวมไทยสร้างชาติ": 48107,
        "เพื่อไทย": 5273,
        "เสรีรวมไทย": 241,
        "ไทยภักดี": 445
      }
    }
  ],
  "เพชรบูรณ์": [
    {
      "district": 1,
      "total_votes": 89156,
      "party_votes": {
        "ก้าวไกล": 24550,
        "ชาติไทยพัฒนา": 3100,
        "ประชาธิปัตย์": 654,
        "พลังประชารัฐ": 35905,
        "ภูมิใจไทย": 414,
        "รวมไทยสร้างชาติ": 3379,
        "เพื่อไทย": 20609,
        "ไทยศรีวิไลย์": 241,
        "ไทยสร้างไทย": 304
      }
    },
    {
      "district": 2,
      "total_votes": 91696,
      "party_votes": {
        "ก้าวไกล": 17655,
        "คลองไทย": 102,
        "ประชาธิปัตย์": 539,
        "พลังประชารัฐ": 38352,
        "พลังปวงชนไทย": 130,
        "ภูมิใจไทย": 1087,
        "รวมไทยสร้างชาติ": 3733,
        "เพื่อไทย": 28857,
        "เสรีรวมไทย": 776,
        "ไทยสร้างไทย": 465
      }
    },
    {
      "district": 3,
      "total_votes": 90365,
      "party_votes": {
        "ก้าวไกล": 17663,
        "ประชาธิปัตย์": 26105,
        "พลังประชารัฐ": 31707,
        "พลังปวงชนไทย": 940,
        "ภูมิใจไทย": 217,
        "รวมไทยสร้างชาติ": 3047,
        "เพื่อไทย": 9801,
        "เสรีรวมไทย": 411,
        "ไทยศรีวิไลย์": 99,
        "ไทยสร้างไทย": 375
      }
    },
    {
      "district": 4,
      "total_votes": 80372,
      "party_votes": {
        "ก้าวไกล": 13176,
        "ประชาธิปัตย์": 530,
        "ประชาสามัคคี": 65,
        "พลังประชารัฐ": 41039,
        "พลังปวงชนไทย": 141,
        "ภูมิใจไทย": 281,
        "รวมไทยสร้างชาติ": 1324,
        "เพื่อไทย": 22599,
        "เสรีรวมไทย": 600,
        "ไทยศรีวิไลย์": 296,
        "ไทยสร้างไทย": 321
      }
    },
    {
      "district": 5,
      "total_votes": 84221,
      "party_votes": {
        "ก้าวไกล": 20365,
        "ประชาธิปัตย์": 555,
        "พลังประชารัฐ": 34971,
        "ภูมิใจไทย": 300,
        "รวมไทยสร้างชาติ": 2515,
        "เพื่อไทย": 24563,
        "เสรีรวมไทย": 519,
        "ไทยสร้างไทย": 433
      }
    },
    {
      "district": 6,
      "total_votes": 87668,
      "party_votes": {
        "ก้าวไกล": 18881,
        "ชาติพัฒนากล้า": 120,
        "ประชาธิปัตย์": 847,
        "พลังประชารัฐ": 47118,
        "พลังปวงชนไทย": 139,
        "พลังสังคมใหม่": 161,
        "ภูมิใจไทย": 469,
        "รวมไทยสร้างชาติ": 2007,
        "เพื่อไทย": 16356,
        "เสรีรวมไทย": 846,
        "ไทยศรีวิไลย์": 276,
        "ไทยสร้างไทย": 448
      }
    }
  ],
  "เลย": [
    {
      "district": 1,
      "total_votes": 89960,
      "party_votes": {
        "ก้าวไกล": 24202,
        "ประชาธิปัตย์": 915,
        "พลังประชารัฐ": 2541,
        "พลังปวงชนไทย": 208,
        "ภูมิใจไทย": 2981,
        "รวมไทยสร้างชาติ": 6024,
        "เพื่อไทย": 49831,
        "เสรีรวมไทย": 1230,
        "ไทยภักดี": 974,
        "ไทยศรีวิไลย์": 491,
        "ไทยสร้างไทย": 563
      }
    },
    {
      "district": 2,
      "total_votes": 86945,
      "party_votes": {
        "ก้าวไกล": 20444,
        "คลองไทย": 257,
        "ประชาธิปัตย์": 267,
        "ประชาธิปไตยใหม่": 326,
        "พลังประชารัฐ": 2463,
        "พลังปวงชนไทย": 669,
        "ภูมิใจไทย": 193,
        "รวมไทยสร้างชาติ": 7908,
        "เพื่อไทย": 50421,
        "เสรีรวมไทย": 819,
        "ไทยภักดี": 663,
        "ไทยศรีวิไลย์": 839,
        "ไทยสร้างไทย": 1676
      }
    },
    {
      "district": 3,
      "total_votes": 93190,
      "party_votes": {
        "ก้าวไกล": 19962,
        "คลองไทย": 690,
        "ประชาธิปัตย์": 640,
        "พลังประชารัฐ": 3893,
        "พลังปวงชนไทย": 182,
        "ภูมิใจไทย": 44272,
        "รวมไทยสร้างชาติ": 1765,
        "เพื่อไทย": 19838,
        "เสรีรวมไทย": 717,
        "ไทยภักดี": 97,
        "ไทยศรีวิไลย์": 238,
        "ไทยสร้างไทย": 896
      }
    },
    {
      "district": 4,
      "total_votes": 87711,
      "party_votes": {
        "ก้าวไกล": 21686,
        "คลองไทย": 490,
        "ประชาธิปัตย์": 1437,
        "พลังประชารัฐ": 9500,
        "ภูมิใจไทย": 2868,
        "รวมไทยสร้างชาติ": 2259,
        "เพื่อไทย": 45638,
        "เสรีรวมไทย": 371,
        "ไทยภักดี": 97,
        "ไทยศรีวิไลย์": 390,
        "ไทยสร้างไทย": 2975
      }
    }
  ],
  "แพร่": [
    {
      "district": 1,
      "total_votes": 96577,
      "party_votes": {
        "ก้าวไกล": 21703,
        "ประชาธิปัตย์": 319,
        "พลังประชารัฐ": 6867,
        "พลังปวงชนไทย": 372,
        "ภูมิใจไทย": 389,
        "รวมไทยสร้างชาติ": 24023,
        "เพื่อไทย": 41563,
        "เสรีรวมไทย": 1097,
        "ไทยศรีวิไลย์": 244
      }
    },
    {
      "district": 2,
      "total_votes": 88027,
      "party_votes": {
        "ก้าวไกล": 19097,
        "ประชาธิปัตย์": 294,
        "พลังประชารัฐ": 2353,
        "ภูมิใจไทย": 3354,
        "รวมไทยสร้างชาติ": 29063,
        "เพื่อไทย": 32845,
        "เสรีรวมไทย": 813,
        "ไทยศรีวิไลย์": 208
      }
    },
    {
      "district": 3,
      "total_votes": 85967,
      "party_votes": {
        "ก้าวไกล": 21781,
        "ประชาธิปัตย์": 290,
        "พลังประชารัฐ": 14168,
        "ภูมิใจไทย": 9910,
        "รวมไทยสร้างชาติ": 4918,
        "เพื่อไทย": 33616,
        "เสรีรวมไทย": 655,
        "ไทยศรีวิไลย์": 629
      }
    }
  ],
  "แม่ฮ่องสอน": [
    {
      "district": 1,
      "total_votes": 65774,
      "party_votes": {
        "ก้าวไกล": 13876,
        "คลองไทย": 172,
        "ชาติไทยพัฒนา": 754,
        "ประชาธิปัตย์": 12460,
        "ประชาไทย": 119,
        "พลังประชารัฐ": 18772,
        "ภูมิใจไทย": 6485,
        "รวมไทยสร้างชาติ": 7510,
        "เพื่อไทย": 4957,
        "เสรีรวมไทย": 669
      }
    },
    {
      "district": 2,
      "total_votes": 69933,
      "party_votes": {
        "ก้าวไกล": 11596,
        "คลองไทย": 348,
        "ชาติรุ่งเรือง": 239,
        "ประชาธิปัตย์": 20346,
        "พลังประชารัฐ": 14753,
        "พลังสังคมใหม่": 724,
        "ภูมิใจไทย": 476,
        "รวมแผ่นดิน": 627,
        "รวมไทยสร้างชาติ": 1858,
        "เพื่อชาติ": 365,
        "เพื่อไทย": 17536,
        "เสรีรวมไทย": 475,
        "ไทยสร้างไทย": 590
      }
    }
  ]
};